Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: Command line interface for Morpho
es: Interfaz de línea de comandos para Morpho

source: ![Command line interface for Morpho](./Figures/commandline.jpg)
es: ![Interfaz de línea de comandos para Morpho] (./Figuras/commandline.jpg)

source: As shown in the figure above, you'll be greeted by a brief welcome and a prompt `>` inviting you to enter _morpho_ commands. For now, try a classic:
es: Como se muestra en la figura anterior, serás recibido con una breve bienvenida y un mensaje '>' que te invitará a ingresar comandos _morpho_. Por ahora, pruebe un clásico:

source: "Hello World"
es: "Hola Mundo"

source: which will display `Hello World` as output. More information about the _morpho_ language is provided in the Reference section, especially chapter [Language](./reference/language.md) if you're familiar with C-like languages such as C, C++, Java, Javascript, etc. things should be quite familiar.
es: que mostrará 'Hola Mundo' como salida. Se proporciona más información sobre el lenguaje _morpho_ en la sección de referencias, especialmente en el capítulo [Lenguaje](./reference/language.md) si está familiarizado con lenguajes similares a C como C, C++, Java, Javascript, etc., las cosas deberían ser bastante familiares.

source: To assist the user, the contents of the reference manual are available to the user in interactive mode as online help. To get help, simply type:
es: Para ayudar al usuario, el contenido del manual de referencia está disponible para el usuario en modo interactivo como ayuda en línea. Para obtener ayuda, simplemente escriba:

source: or even more briefly,
es: o aún más brevemente,

source: to see the list of main topics. To find help on a particular topic, for example `for` loops, simply type the topic name afterwards:
es: para ver la lista de temas principales. Para encontrar ayuda sobre un tema en particular, por ejemplo, ciclos 'for', simplemente escriba el nombre del tema después:

source: Once you're done using _morpho_, simply type
es: Una vez que hayas terminado de usar _morpho_, simplemente escriba

source: to exit the program and return to the shell.
es: para salir del programa y volver al shell.

source: The interactive environment has a few other useful features to assist the user:
es: El entorno interactivo tiene algunas otras características útiles para ayudar al usuario:

source: **Autocomplete.** As you type, _morpho_ will show you any suggested commands that it thinks you're trying to enter. For example, if you type `v` the command line will show the `var` keyword. To accept the suggestion, press the tab key. Multiple suggestions may be available; use the up and down arrow keys to rotate through them.
es: **Autocompletar.** A medida que escribes, _morpho_ te mostrará los comandos sugeridos que cree que estás intentando ingresar. Por ejemplo, si escribe `v`, la línea de comandos mostrará la palabra clave `var`. Para aceptar la sugerencia, presione la tecla de tabulación. Es posible que haya varias sugerencias disponibles; Utilice las teclas de flecha hacia arriba y hacia abajo para rotar a través de ellos.

source: **Command history.** Use the arrow keys to retrieve previously entered commands. You may then edit them before running them.
es: **Historial de comandos.** Utilice las teclas de flecha para recuperar los comandos introducidos anteriormente. A continuación, puede editarlos antes de ejecutarlos.

source: **Line editing.** As you're typing a command, use the left and right arrows to move the cursor around; you can insert new characters at the cursor just by typing them or delete characters with the `delete` key. Hold down the `shift` key as you use the left and right arrow keys to select text; you can then use` Ctrl-C` to copy and `Ctrl-V` to paste. `Ctrl-A` moves to the start of the line and `Ctrl-E` the end.
es: **Edición de líneas.** Mientras escribes un comando, usa las flechas izquierda y derecha para mover el cursor; Puede insertar nuevos caracteres en el cursor simplemente escribiéndolos o eliminar caracteres con la tecla `delete`. Mantenga presionada la tecla `shift` mientras usa las teclas de flecha izquierda y derecha para seleccionar texto; luego puede usar 'Ctrl-C' para copiar y `Ctrl-V` para pegar. `Ctrl-A` se mueve al principio de la línea y `Ctrl-E` al final.

source: To illustrate how to use _morpho_, we will solve a problem involving nematic liquid crystals (NLCs), fluids composed of long, rigid molecules that possess a local average molecular orientation described by a unit vector field \\(\mathbf{n}\\). Droplets of NLC immersed in a host isotropic fluid such as water are called _tactoids_ and, unlike droplets of, say, oil in water that form spheres, tactoids can adopt elongated shapes.
es: Para ilustrar cómo usar _morpho_, resolveremos un problema que involucra cristales líquidos nemáticos (NLC), fluidos compuestos por moléculas largas y rígidas que poseen una orientación molecular promedio local descrita por un campo vectorial unitario \\(\mathbf{n}\\). Las gotas de NLC sumergidas en un fluido isótropo huésped como el agua se denominan tactoides, y, a diferencia de las gotas de, por ejemplo, aceite en el agua que forman esferas, los tactoides pueden adoptar formas alargadas.

source: The functional to be minimized, the free energy of the system, is quite complex,
es: La funcional a minimizar, esto es, la energía libre del sistema, es bastante compleja,

source: where the three terms include **liquid crystal elasticity** that drives elongation of the droplet, **surface tension** _(s.t.)_ that opposes lengthening of the boundary and an **anchoring term** that imposes a preferred orientation at the boundary. We need a local constraint, \\(\mathbf{n}\cdot\mathbf{n}=1\\), and will also impose a constraint on the volume of the droplet. For simplicity, we'll solve this problem in 2D. The complete code for this tutorial example is contained in the `examples/tactoid` folder in the repository.
es: donde los tres términos incluyen **elasticidad de cristal líquido** que impulsa el alargamiento de la gota, **tensión superficial** _(s.t.)_ que se opone al alargamiento del límite y un **término de anclaje** que impone una orientación preferida en el límite. Necesitamos una restricción local, \\(\mathbf{n}\cdot\mathbf{n}=1\\), y también impondrá una restricción en el volumen de la gota. Para simplificar, resolveremos este problema en 2D. El código completo de este ejemplo de tutorial se encuentra en la carpeta 'examples/tactoid' del repositorio.

source: Importing modules
es: Importación de módulos

source: _Morpho_ is a modular system and hence we typically begin our program by telling _morpho_ the modules we need so that they're available for us to use. To do so, we use the `import` keyword followed by the name of the module:
es: _Morpho_ es un sistema modular y, por lo tanto, normalmente comenzamos nuestro programa diciéndole a _morpho_ los módulos que necesitamos para que estén disponibles para que los usemos. Para ello, utilizamos la palabra clave `import` seguida del nombre del módulo:

source: We can also use the `import` keyword to import additional program files to assist in modularizing large programs. These are the modules we'll use for this example:
es: También podemos usar la palabra clave `import` para importar archivos de programa adicionales para ayudar a modularizar programas grandes. Estos son los módulos que usaremos para este ejemplo:

source: Module
es: Módulo

source: Purpose
es: Finalidad

source: `meshtools`
es: `Herramientas de malla`

source: Utility code to create and refine meshes
es: Código de utilidad para crear y refinar mallas

source: `optimize`
es: `Optimizar`

source: Perform optimization
es: Realizar la optimización

source: Visualize results
es: Visualiza los resultados

source: Morpho language
es: El lenguaje Morpho

source: The _morpho_ language is simple but expressive. If you're familiar with C-like languages (C, C++, Java, Javascript) you'll find it very natural. A much more detailed description is provided in Chapter [Language](../reference/language.md), but a brief summary is provided in the above figure and we provide an overview of key ideas to help you follow the tutorial:
es: El lenguaje _morpho_ es simple pero expresivo. Si estás familiarizado con los lenguajes tipo C (C, C++, Java, Javascript) te resultará muy natural. Una descripción mucho más detallada se proporciona en el Capítulo [Idioma](.. /reference/language.md), pero en la figura anterior se proporciona un breve resumen y proporcionamos una descripción general de las ideas clave para ayudarlo a seguir el tutorial:

source: **Comments.** Any text after `//` or surrounded by ```/``*``` and ```*``/``` is a comment and not processed by morpho:
es: **Comentarios.** Cualquier texto después de `//` o rodeado por ```/``*``` y ```*``/``` es un comentario y no es procesado por morpho:

source: ``` // This is a comment /* This too! */ ```
es: ``` Este es un comentario /* ¡Esto también! */ ```

source: **Variables.** To create a variable, use the `var` keyword; you can then assign and use the variable arbitrarily:
es: **Variables.** Para crear una variable, utilice la palabra clave `var`; A continuación, puede asignar y utilizar la variable arbitrariamente:

source: **Functions.** Functions may take parameters, and you call them like this:
es: **Funciones.** Las funciones pueden tomar parámetros, y se les llama así:

source: and declare them like this:
es: y decláralos así:

source: Some functions take optional arguments, which look like this:
es: Algunas funciones toman argumentos opcionales, que se ven así:

source: **Objects.** _Morpho_ is deeply object-oriented. Most things in morpho are represented as objects, which provide _methods_ that you can use to control them. Objects are made by _constructor functions_ that begin with a capital letter (and may take arguments):
es: **Objetos.** _Morpho_ está profundamente orientado a objetos. La mayoría de las cosas en morpho se representan como objetos, que proporcionan _métodos_ que puedes usar para controlarlos. Los objetos están formados por _funciones constructoras_ que comienzan con una letra mayúscula (y pueden tomar argumentos):

source: Method calls then look like this:
es: Las llamadas a métodos tienen el siguiente aspecto:

source: **Collections.** _Morpho_ provides a number of collection typesall of which are objectsincluding Lists,
es: **Colecciones.** _Morpho_ proporciona una serie de tipos de colecciones, todos los cuales son objetos, incluidas listas,

source: and Dictionaries:
es: y Diccionarios:

source: and Ranges (often used in loops):
es: y Rangos (a menudo utilizados en ciclos):

source: There are many others, including Matrices, Sparse matrices, etc.
es: Hay muchas otras, incluyendo Matrices, Matrices dispersas, etc.

source: Meshes are discretized regions of space. The very simplest region we can imagine is a _point_ or _vertex_ described by a set of coordinates \\((x\_{1},x\_{2},....,x\_{D})\\) where the number of coordinates \\(D\\) defines the dimensionality of the space that the manifold is said to be _embedded_ in. From more than one point, we can start constructing more complex regions. First, between two points we can imagine fixing an imaginary ruler and drawing a straight line or _edge_ between them. Three points define a plane, and also a triangle; we can therefore identify the two dimensional area of the plane bounded by the triangle as a _face_, as in the face of a polyhedron. Using four points, we can define the volume bounded by a tetrahedron. Each of these **elements** has a different dimensionalitycalled a _grade_and a complete `Mesh` may contain elements of many different grades as shown in Fig. [4.2](#fig:Mesh).
es: Las mallas son regiones discretizadas del espacio. La región más simple que podemos imaginar es un _punto_ o _vértice_ descrito por un conjunto de coordenadas \\((x\_{1},x\_{2},....,x\_{D})\\) donde el número de coordenadas \\(D\\) define la dimensionalidad del espacio en el que se dice que la variedad está _incrustada_. A partir de más de un punto, podemos empezar a construir regiones más complejas. En primer lugar, entre dos puntos podemos imaginar que fijamos una regla imaginaria y dibujamos una línea recta o _borde_ entre ellos. Tres puntos definen un plano, y también un triángulo; Por lo tanto, podemos identificar el área bidimensional del plano delimitada por el triángulo como una _cara_, como en la cara de un poliedro. Usando cuatro puntos, podemos definir el volumen delimitado por un tetraedro. Cada uno de estos **elementos** tiene una dimensionalidad diferente llamada _grade_and una 'Malla' completa puede contener elementos de muchos grados diferentes, como se muestra en la Fig. [4.2] (#fig:Malla).

source: _Morpho_ provides a number of ways of creating a mesh. One can load a mesh from a file, build one manually from a set of points, create one from a polyhedron, or from the level set (contours) of a function.
es: _Morpho_ proporciona varias formas de crear una malla. Se puede cargar una malla a partir de un archivo, construir una manualmente a partir de un conjunto de puntos, crear una a partir de un poliedro o a partir del conjunto de niveles (curvas de nivel) de una función.

source: For this example, we'll use a predefined mesh file `disk.mesh`. To create a Mesh object from this file, we call the _Mesh_ function with the file name:
es: Para este ejemplo, usaremos un archivo de malla predefinido 'disk.mesh'. Para crear un objeto Mesh a partir de este archivo, llamamos a la función _Mesh_ con el nombre del archivo:

source: Here, the **var** keyword tells morpho to create a new variable _m_, which now refers to the newly created _Mesh_ object.
es: Aquí, la palabra clave **var** le dice a morpho que cree una nueva variable _m_, que ahora se refiere al objeto _Mesh_ recién creado.

source: The initial mesh is depicted in Fig. [4.3](#fig:InitialMesh); we'll provide the code to perform the visualization in section [Visualizing the results](./visualizing_the_results.md).
es: La malla inicial se muestra en la Fig. [4.3] (#fig:Malla inicial); proporcionaremos el código para realizar la visualización en la sección [Visualización de los resultados](./visualizing_the_results.md).

source: If you open the file `disk.mesh`, which you can find in the same folder as `tactoid.morpho`, you'll find it has a simple human readable format:
es: Si abres el archivo `disk.mesh`, que puedes encontrar en la misma carpeta que `tactoid.morpho`, verás que tiene un formato simple legible por humanos:

source: The file is broken into sections, each describing elements of a different grade. Each line begins either with a section delimiter such as _vertices_, _edges_ or _faces_, or with an id. Vertices are then defined by a set of coordinates; edges and faces are defined by providing the respective vertex ids.
es: El archivo se divide en secciones, cada una de las cuales describe elementos de un grado diferente. Cada línea comienza con un delimitador de sección como _vertices_, _edges_ o _faces_, o con un id. Los vértices se definen entonces por un conjunto de coordenadas; Las aristas y las caras se definen proporcionando los respectivos identificadores de vértice.

source: Sometimes, we want to refer to specific parts of a `Mesh` object: elements that match some criterion, for example. `Selection` objects enable us to do this. Because selecting the boundary is a very common activity, the `Selection` constructor function takes an optional argument to do this:
es: A veces, queremos referirnos a partes específicas de un objeto 'Mesh': elementos que coinciden con algún criterio, por ejemplo. Los objetos de 'selección' nos permiten hacer esto. Debido a que la selección del límite es una actividad muy común, la función constructora 'Selection' toma un argumento opcional para hacer esto:

source: By default, only the boundary elements are included in the `Selection`. For a mesh with at most grade 2 elements (facets), the boundaries are grade 1 elements (lines); for a mesh with grade 3 elements (volumes), the boundaries are grade 2 elements (facets). Quite often we want the vertices themselves as well, so we can call a method to achieve that:
es: De forma predeterminada, solo los elementos de límite se incluyen en la `Selección`. Para una malla con un máximo de elementos de grado 2 (facets), los límites son elementos de grado 1 (líneas); Para una malla con elementos de grado 3 (volúmenes), los límites son elementos de grado 2 (facets). Muy a menudo también queremos los vértices en sí, por lo que podemos llamar a un método para lograrlo:

source: Once a `Selection` has been created, it can be helpful to visualize it to ensure the correct elements are selected. We'll talk more about visualization in section [Visualizing Results](./visualizing_the_results.md), but for now the line
es: Una vez que se ha creado una `Selección`, puede ser útil visualizarla para asegurarse de que se seleccionan los elementos correctos. Hablaremos más sobre la visualización en la sección [Visualización de resultados](./visualizing_the_results.md), pero por ahora la línea

source: shows a visualization of the mesh with the selected grade 1 elements shaded red as displayed in Fig. [4.4](#fig:Boundary){reference-type="ref" reference="fig:Boundary"}.
es: muestra una visualización de la malla con los elementos de grado 1 seleccionados sombreados en rojo como se muestra en la Fig. [4.4] (#fig:Frontera) {reference-type="ref" reference="fig:Boundary"}.

source: ![Selection](../Figures/Tutorial/2Visualize/selection.png) _Selecting the boundary of the mesh_
es: ! [Selección] (.. /Figures/Tutorial/2Visualize/selection.png) _Seleccionando la frontera del la malla_

source: Having created our initial computational domain, we will now create a `Field` object representing the director field \\(\mathbf{n}\\):
es: Habiendo creado nuestro dominio computacional inicial, ahora creamos un objeto 'Field' que representa el campo director \\(\mathbf{n}\\):

source: As with the `Mesh` object earlier, we declare a variable, _nn_, to refer to the `Field` object. We have to provide two arguments to `Field`: the `Mesh` object on which the `Field` is defined, and something to initialize it. Here, we want the initial director to have a spatially uniform value, so we can just provide `Field` a constant `Matrix` object. By default, _morpho_ stores a copy of this matrix on each vertex in the mesh; Fields can however store information on elements of any grade (and store both more than one quantity per grade and information on multiple grades at the same time).
es: Al igual que con el objeto `Mesh` anteriormente, declaramos una variable, _nn_, para hacer referencia al objeto `Field`. Tenemos que proporcionar dos argumentos a `Field`: el objeto `Mesh` en el que se define el `Field`, y algo para inicializarlo. Aquí, queremos que el director inicial tenga un valor espacialmente uniforme, por lo que podemos proporcionar a `Field` un objeto `Matrix` constante. De forma predeterminada, _morpho_ almacena una copia de esta matriz en cada vértice de la malla; Sin embargo, los campos pueden almacenar información sobre elementos de cualquier grado (y almacenar más de una cantidad por grado e información sobre varios grados al mismo tiempo).

source: It's possible to initialize a `Field` with spatially varying values by providing an _anonymous function_ to `Field` like this:
es: Es posible inicializar un 'Campo' con valores que varían espacialmente proporcionando una _función anónima a `Field` como esta:

source: Here, _phi_ is a scalar field that takes on the value \\(x^{2}+y^{2}\\). The **fn** keyword is used to define functions.
es: Aquí, _phi_ es un campo escalar que toma el valor \\(x^{2}+y^{2}\\). La palabra clave **fn** se utiliza para definir funciones.

source: We now turn to setting up the problem. Each term in the energy functional [(1)](../tutorial.md#eq:free) is represented by a corresponding _functional_ object, which acts on a `Mesh` (and possibly a `Field`) to calculate an integral quantity such as an energy; Functional objects are also responsible for calculating gradients of the energy with respect to vertex positions and components of Fields.
es: Pasamos ahora a plantear el problema. Cada término en el funcional energético [(1)](.. /tutorial.md#eq:free) está representado por un objeto _functional_ correspondiente, que actúa sobre una `Mesh` (Malla) (y posiblemente un `Mesh` (Campo) para calcular una cantidad integral como una energía; Los objetos funcionales también son responsables de calcular gradientes de la energía con respecto a las posiciones de los vértices y los componentes de los campos.

source: Let's take the terms in [(1)](../tutorial.md#eq:free) one by one: To represent the nematic elasticity we create a `Nematic` object:
es: Tomemos los términos de [(1)](.. /tutorial.md#eq:free) uno por uno: Para representar la elasticidad nemática creamos un objeto `Nematic` :

source: The surface tension term involves the length of the boundary, so we need a `Length` object:
es: El término de tensión superficial implica la longitud del límite, por lo que necesitamos un o~bjeto `Length`:

source: The anchoring term doesn't have a simple built in object type, but we can use a general `LineIntegral` object to achieve the correct result.
es: El término de anclaje no tiene un tipo de objeto integrado simple, pero podemos usar un objeto general LineIntegral` para lograr el resultado correcto.

source: Notice that we have to supply a functionthe integrandwhich will be called by `LineIntegral` when it evaluates the integral. Integrand functions are called with the local coordinates first (as a `Matrix` object representing a column vector) and then the local interpolated value of any number of `Fields`. We also make use of the special function `tangent()` that locally returns a local tangent to the line.
es: Tenga en cuenta que tenemos que proporcionar una función la integrando y que será llamada por `LineIntegral` cuando evalúe la integral. Las funciones integrando se llaman primero con las coordenadas locales (como un objeto `Matrix` que representa un vector columna) y luego el valor interpolado local de cualquier número de `Campos`. También hacemos uso de la función especial `tangent()` que devuelve localmente una tangente local a la recta.

source: We also need to impose constraints. Any _functional_ object can be used equally well as an energy or a constraint, and hence we create a `NormSq` (norm-squared) object that will be used to implement the local unit vector constraint on the director field:
es: También tenemos que imponer limitaciones. Cualquier objeto _funcional_ se puede usar igualmente bien como una energía o una restricción, y por lo tanto creamos un objeto `NormSq` (norm-squared) que se usará para implementar la restricción de vector unitario local en el campo director:

source: and an `Area` object for the global constraint. This is really a constraint fixing the volume of fluid in the droplet, but since we're in 2D that becomes a constraint on the area of the mesh:
es: y un objeto `Area` para la restricción global. Esto es realmente una restricción que fija el volumen de fluido en la gota, pero como estamos en 2D, eso se convierte en una restricción en el área de la malla:
