Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: This error occurs if you try to index something that isn't a collection:
es: Este error se produce si intenta indexar algo que no es una colección:

source: This error can occur when selecting an entry from a collection object (such as a list) if the index supplied is bigger than the number of entries:
es: Este error puede producirse al seleccionar una entrada de un objeto de colección (como una lista) si el índice proporcionado es mayor que el número de entradas:

source: This error occurs if you try to index an array with a non-numerical index:
es: Este error se produce si intenta indexar una matriz con un índice no numérico:

source: This error occurs if you try to index an array with the wrong number of indices:
es: Este error se produce si intenta indexar una matriz con un número incorrecto de índices:

source: This notification is generated after selecting `Quit` within the debugger. Execution of the program is halted and control returns to the user.
es: Esta notificación se genera después de seleccionar `Quit` en el depurador. La ejecución del programa se detiene y el control vuelve al usuario.

source: This error occurs if you refer to something that has not been previously declared, for example trying to use a variable of call a function that doesn't exist. It's possible that the symbol is spelt incorrectly, or that the capitalization doesn't match the definition (_morpho_ symbols are case-sensitive).
es: Este error se produce si hace referencia a algo que no se ha declarado previamente, por ejemplo, al intentar usar una variable de llamada a una función que no existe. Es posible que el símbolo esté mal escrito o que las mayúsculas no coincidan con la definición (los símbolos _morpho_ distinguen entre mayúsculas y minúsculas).

source: A common problem is to try to assign to a variable that hasn't yet been declared:
es: Un problema común es intentar asignar a una variable que aún no se ha declarado:

source: To fix this, prefix with `var`:
es: Para solucionar esto, prefije con `var`:

source: This error occurs when an arithmetic operation is performed on two 'incompatible' matrices. For example, two matrices must have the same dimensions, i.e. the same number of rows and columns, to be added or subtracted,
es: Este error se produce cuando se realiza una operación aritmética en dos matrices "incompatibles". Por ejemplo, dos matrices deben tener las mismas dimensiones, es decir, el mismo número de filas y columnas, para sumar o restar,

source: // generates a `MtrxIncmptbl` error.
es: // genera un error 'MtrxIncmptbl'.

source: Or to be multiplied together, the number of columns of the left hand matrix must equal the number of rows of the right hand matrix.
es: O para multiplicarse, el número de columnas de la matriz de la izquierda debe ser igual al número de filas de la matriz de la derecha.

source: Builtin functions
es: Funciones integradas

source: Morpho provides a number of built-in functions.
es: Morpho proporciona una serie de funciones integradas.

source: Random
es: Aleatorio

source: The `random` function generates a random number from a uniform distribution on the interval \[0,1\].
es: La función `random` genera un número aleatorio a partir de una distribución uniforme en el intervalo \[0,1\].

source: See also `randomnormal` and `randomint`.
es: Véase también `randomnormal` y `randomint`.

source: The `randomnormal` function generates a random number from a normal (gaussian) distribution with unit variance and zero offset.
es: La función `randomnormal` genera un número aleatorio a partir de una distribución normal (gaussiana) con varianza unitaria y desplazamiento cero.

source: See also `random` and `randomint`.
es: Véase también `random` y `randomint`.

source: The `randomint` function generates a random integer with a specified maximum value.
es: La función `randomint` genera un entero aleatorio con un valor máximo especificado.

source: // Generates a random integer [0,10)
es: // Genera un entero aleatorio [0,10]

source: Returns `true` if a value is `nil` or `false` otherwise.
es: Devuelve `true` si un valor es `nil` o `false` en caso contrario.

source: Returns `true` if a value is an integer or `false` otherwise.
es: Devuelve `true` si un valor es un entero o `false` en caso contrario.

source: Returns `true` if a value is a floating point number or `false` otherwise.
es: Devuelve `true` si un valor es un número de coma flotante o `false` en caso contrario.

source: Returns `true` if a value is a boolean or `false` otherwise.
es: Devuelve `true` si un valor es booleano o `false` en caso contrario.

source: isobject
es: isobjeto

source: Returns `true` if a value is an object or `false` otherwise.
es: Devuelve `true` si un valor es un objeto o `false` en caso contrario.

source: Returns `true` if a value is a string or `false` otherwise.
es: Devuelve `true` si un valor es una cadena o `false` en caso contrario.

source: Returns `true` if a value is a class or `false` otherwise.
es: Devuelve `true` si un valor es una clase o `false` en caso contrario.

source: Returns `true` if a value is a range or `false` otherwise.
es: Devuelve `true` si un valor es un rango o `false` en caso contrario.

source: Returns `true` if a value is a dictionary or `false` otherwise.
es: Devuelve `true` si un valor es un diccionario o `false` en caso contrario.

source: Returns `true` if a value is a list or `false` otherwise.
es: Devuelve `true` si un valor es una lista o `false` en caso contrario.

source: Returns `true` if a value is an array or `false` otherwise.
es: Devuelve `true` si un valor es una matriz o `false` en caso contrario.

source: Returns `true` if a value is a matrix or `false` otherwise.
es: Devuelve `true` si un valor es una matriz o `false` en caso contrario.

source: Returns `true` if a value is a sparse matrix or `false` otherwise.
es: Devuelve `true` si un valor es una matriz dispersa o `false` en caso contrario.

source: Returns `true` if a value is infinite or `false` otherwise.
es: Devuelve `true` si un valor es infinito o `false` en caso contrario.

source: Returns `true` if a value is a Not a Number or `false` otherwise.
es: Devuelve `true` si un valor no es un número o `false` en caso contrario.

source: Returns `true` if a value is callable or `false` otherwise.
es: Devuelve `true` si un valor es invocable o `false` en caso contrario.

source: Returns `true` if a value is finite or `false` otherwise.
es: Devuelve `true` si un valor es finito o `false` en caso contrario.

source: // expect: true
es: // esperado: true

source: // expect: false
es: // esperado: false

source: Returns `true` if a value is a real number, or `false` otherwise.
es: Devuelve `true` si un valor es un número real, o `false` en caso contrario.

source: // expect: false
es: // esperarado: false

source: Returns `true` if a value is a `Mesh`, or `false` otherwise.
es: Devuelve `true` si un valor es una `Malla`, o `false` en caso contrario.

source: Returns `true` if a value is a `Selection`, or `false` otherwise.
es: Devuelve `true` si un valor es una `Selección`, o `false` en caso contrario.

source: Returns `true` if a value is a `Field`, or `false` otherwise.
es: Devuelve `true` si un valor es un `Field`, o `false` en caso contrario.

source: Apply calls a function with the arguments provided as a list:
es: Apply llama a una función con los argumentos proporcionados como una lista:

source: // calls f(0.5, 0.5)
es: // llama f(0.5, 0.5)

source: It's often useful where a function or method and/or the number of parameters isn't known ahead of time. The first parameter to apply can be any callable object, including a method invocation or a closure.
es: A menudo es útil cuando una función o método y/o el número de parámetros no se conoce de antemano. El primer parámetro que se aplica puede ser cualquier objeto invocable, incluida una invocación de método o un cierre.

source: You may also instead omit the list and use apply with multiple arguments:
es: También puede omitir la lista y usar apply con varios argumentos:

source: // calls f(0.5, 0.5)
es: // llama f(0.5, 0.5)

source: There is one edge case that occurs when you want to call a function that accepts a single list as a parameter. In this case, enclose the list in another list:
es: Hay un caso extremo que se produce cuando se desea llamar a una función que acepta una sola lista como parámetro. En este caso, incluya la lista en otra lista:

source: // equivalent to f([1,2])
es: // equivalente a f([1,2])

source: Returns the absolute value of a number:
es: Devuelve el valor absoluto de un número:

source: // prints 10
es: // imprime 10

source: Gives the sign of a number:
es: Da el signo de un número:

source: // expect: -1
es: // esperado: -1

source: // expect: 0
es: // esperado: 0

source: Returns the arctangent of an input value that lies from `-Inf` to `Inf`. You can use one argument:
es: Devuelve el arcotangente de un valor de entrada que se encuentra entre `-Inf` e `Inf`. Puedes usar un argumento:

source: or use two arguments to return the angle in the correct quadrant:
es: o use dos argumentos para devolver el ángulo en el cuadrante correcto:

source: Note the order `x`, `y` differs from some other languages.
es: Tenga en cuenta que el orden `x`, `y` difiere de algunos otros idiomas.

source: Exponential function `e^x`. Inverse of `log`.
es: Función exponencial `e^x`. Inverso de `log`.

source: // expect: -1 + 0im
es: // espera: -1 + 0IM

source: Natural logarithm function. Inverse of `exp`.
es: Función logaritmo natural. Inverso de `exp`.

source: // expect: 0
es: // esperado: 0

source: Base 10 logarithm function.
es: Función logarítmica de base 10.

source: Sine trigonometric function.
es: Función trigonométrica seno.

source: Hyperbolic sine trigonometric function.
es: Función trigonométrica sinusoidal hiperbólica.

source: Cosine trigonometric function.
es: Función trigonométrica del coseno.

source: Hyperbolic cosine trigonometric function.
es: Función trigonométrica del coseno hiperbólico.

source: Tangent trigonometric function.
es: Función trigonométrica tangente.

source: Hyperbolic tangent trigonometric function.
es: Función trigonométrica tangente hiperbólica.

source: Inverse sine trigonometric function. Returns a value on the interval `[-Pi/2,Pi/2]`.
es: Función trigonométrica sinusoidal inversa. Devuelve un valor en el intervalo '[-Pi/2,Pi/2]'.

source: Inverse cosine trigonometric function. Returns a value on the interval `[-Pi/2,Pi/2]`.
es: Función trigonométrica del coseno inverso. Devuelve un valor en el intervalo '[-Pi/2,Pi/2]'.

source: Square root function.
es: Función de raíz cuadrada.

source: Finds the minimum value of its arguments. If any of the arguments are Objects and are enumerable, (e.g. a `List`), `min` will search inside them for a minimum value. Accepts any number of arguments.
es: Busca el valor mínimo de sus argumentos. Si alguno de los argumentos son objetos y son enumerables (por ejemplo, una `lista`), `min` buscará dentro de ellos un valor mínimo. Acepta cualquier número de argumentos.

source: // expect: -2
es: // esperado: -2

source: Finds the maximum value of its arguments. If any of the arguments are Objects and are enumerable, (e.g. a `List`), `max` will search inside them for a maximum value. Accepts any number of arguments.
es: Busca el valor máximo de sus argumentos. Si alguno de los argumentos son objetos y son enumerables (por ejemplo, una `Lista`), `max` buscará dentro de ellos un valor máximo. Acepta cualquier número de argumentos.

source: // expect: 3
es: // esperado: 3

source: // expect: 3
es: // esperaso: 3

source: Returns both the results of `min` and `max` as a list, Providing a set of bounds for its arguments and any enumerable objects within them.
es: Devuelve los resultados de 'min' y 'max' como una lista, proporcionando un conjunto de límites para sus argumentos y cualquier objeto enumerable dentro de ellos.

source: // expect: [1,3]
es: // esperado: [1,3]

source: // expect: [-1,3]
es: // esperado: [-1,3]

source: This section describes the various data types like `List`'s, `Matrix` objects, etc.
es: Esta sección describe los diversos tipos de datos como `Lista`, objetos `Matriz`, etc.

source: Arrays are collection objects that can have any number of indices. Their size is set when they are created:
es: Las matrices son objetos de colección que pueden tener cualquier número de índices. Su tamaño se establece cuando se crean:

source: Values can be retrieved with appropriate indices:
es: Los valores se pueden recuperar con los índices adecuados:

source: Arrays can be indexed with slices:
es: Las matrices se pueden indexar con segmentos:

source: Any morpho value can be stored in an array element
es: Cualquier valor morpho se puede almacenar en un elemento de matriz

source: Get the dimensions of an Array object:
es: Obtenga las dimensiones de un objeto Array:

source: // expect: [ 2, 2 ]
es: // esperado: [ 2, 2 ]

source: Morpho provides complex numbers. The keyword `im` is used to denote the imaginary part of a complex number:
es: Morpho proporciona números complejos. La palabra clave `im` se utiliza para denotar la parte imaginaria de un número complejo:

source: Print values on the unit circle in the complex plane:
es: Imprima valores en el círculo unitario en el plano complejo:

source: Get the real and imaginary parts of a complex number:
es: Obtén las partes real e imaginaria de un número complejo:

source: or alternatively:
es: o alternativamente:

source: Returns the angle `phi` associated with the polar representation of a complex number `r*exp(im*phi)`:
es: Devuelve el ángulo `phi` asociado a la representación polar de un número complejo `r*exp(im*phi)`:

source: Returns the complex conjugate of a number:
es: Devuelve el conjugado complejo de un número:

source: Lists are collection objects that contain a sequence of values each associated with an integer index.
es: Las listas son objetos de colección que contienen una secuencia de valores, cada uno asociado a un índice entero.

source: Create a list like this:
es: Crea una lista como esta:

source: Look up values using index notation:
es: Busque valores mediante notación de índice:

source: Indexing can also be done with slices: list\[0..2\] list\[\[0,1,3\]\]
es: La indexación también se puede realizar con segmentos: list\[0..2\] list\[\[0,1,3\]\]

source: You can change list entries like this:
es: Puede cambiar las entradas de la lista de la siguiente manera:

source: Create an empty list:
es: Crea una lista vacía:

source: Loop over elements of a list:
es: Recorrer en bucle los elementos de una lista:

source: Adds an element to the end of a list:
es: Agrega un elemento al final de una lista:

source: Inserts an element into a list at a specified index:
es: Inserta un elemento en una lista en un índice especificado:

source: // prints [ 1, Foo, 2, 3 ]
es: // imprime [ 1, Foo, 2, 3 ]

source: Remove the last element from a list, returning the element removed:
es: Elimine el último elemento de una lista, devolviendo el elemento eliminado:

source: If an integer argument is supplied, returns and removes that element:
es: Si se proporciona un argumento entero, devuelve y elimina ese elemento:

source: // prints '2'
es: // imprime '2'

source: // prints [ 1, 3 ]
es: // imprime [ 1, 3 ]

source: Sorts the contents of a list into ascending order:
es: Ordena el contenido de una lista en orden ascendente:

source: Note that this sorts the list "in place" (i.e. it modifies the order of the list on which it is invoked) and hence returns `nil`.
es: Tenga en cuenta que esto ordena la lista "in situ" (es decir, modifica el orden de la lista en la que se invoca) y, por lo tanto, devuelve `nil`.

source: You can provide your own function to use to compare values in the list
es: Puede proporcionar su propia función para compararla en la lista

source: This function should return a negative value if `a<b`, a positive value if `a>b` and `0` if `a` and `b` are equal.
es: Esta función debe devolver un valor negativo si `a<b`, un valor positivo si `a>b` y `0` si `a` y `b` son iguales.

source: Returns a list of indices that would, if used in order, would sort a list. For example
es: Devuelve una lista de índices que, si se usaran en orden, ordenarían una lista. Por ejemplo

source: // expect: [2,0,1]
es: // esperado: [2,0,1]

source: would produce `[2,0,1]`
es: produciría `[2,0,1]`

source: Remove any occurrences of a value from a list:
es: Elimine cualquier aparición de un valor de una lista:

source: Tests if a value is a member of a list:
es: Comprueba si un valor es miembro de una lista:

source: // expect: true
es: // esperado: true

source: Join two lists together:
es: Une dos listas:

source: // expect: [1,2,3,4,5,6]
es: // esperado: [1,2,3,4,5,6]

source: Generate all possible 2-tuples from a list:
es: Genere todas las 2 tuplas posibles a partir de una lista:

source: produces `[ [ 1, 1 ], [ 1, 2 ], [ 1, 3 ] ... ]`.
es: produce `[ [ 1, 1 ], [ 1, 2 ], [ 1, 3 ] ... ] `.

source: Generate all possible sets of order 2 from a list.
es: Genere todos los conjuntos posibles de orden 2 a partir de una lista.

source: produces `[ [ 1, 2 ], [ 1, 3 ], [ 2, 3 ] ]`.
es: produce `[ [ 1, 2 ], [ 1, 3 ], [ 2, 3 ] ]`.

source: Note that sets include only distinct elements from the list (no element is repeated) and ordering is unimportant, hence only one of `[ 1, 2 ]` and `[ 2, 1 ]` is returned.
es: Tenga en cuenta que los conjuntos incluyen solo elementos distintos de la lista (no se repite ningún elemento) y el orden no es importante, por lo tanto, solo se devuelve uno de `[ 1, 2 ]` y `[ 2, 1 ]`.

source: The Matrix class provides support for matrices. A matrix can be initialized with a given size,
es: La clase Matrix proporciona compatibilidad con matrices. Una matriz se puede inicializar con un tamaño dado,

source: where all elements are initially set to zero. Alternatively, a matrix can be created from an array,
es: donde todos los elementos se establecen inicialmente en cero. Alternativamente, se puede crear una matriz a partir de una matriz,

source: or a Sparse matrix,
es: o una matriz dispersa,

source: You can create a column vector like this,
es: Puedes crear un vector columna como este,

source: Finally, you can create a Matrix by assembling other matrices like this,
es: Finalmente, puede crear una matriz ensamblando otras matrices como esta,

source: // produces a 4x4 matrix
es: // produce una matriz de 4x4

source: Once a matrix is created, you can use all the regular arithmetic operators with matrix operands, e.g.
es: Una vez creada una matriz, se pueden utilizar todos los operadores aritméticos regulares con operandos de matriz, p. ej.

source: You can retrieved individual matrix entries with specified indices:
es: Puede recuperar entradas de matriz individuales con índices especificados:

source: or create a submatrix using slices:
es: o cree una submatriz usando sectores:

source: The division operator is used to solve a linear system, e.g.
es: El operador de división se utiliza para resolver un sistema lineal, p. ej.

source: yields the solution to the system a\*x = b.
es: da como resultado la solución del sistema a\*x = b.

source: Copies the contents of matrix B into matrix A:
es: Copia el contenido de la matriz B en la matriz A:

source: The two matrices must have the same dimensions.
es: Las dos matrices deben tener las mismas dimensiones.

source: Returns the dimensions of a matrix:
es: Devuelve las dimensiones de una matriz:

source: // Create a column matrix
es: // Crear una matriz de columnas

source: // Expect: [ 3, 1 ]
es: // esperado: [ 3, 1 ]

source: Returns a list of eigenvalues of a Matrix:
es: Devuelve una lista de valores propios de una matriz:

source: // Expect: [1,-1]
es: // esperado: [1,-1]

source: Returns the eigenvalues and eigenvectors of a Matrix:
es: Devuelve los valores propios y los vectores propios de una matriz:

source: Eigensystem returns a two element list: The first element is a List of eigenvalues. The second element is a Matrix containing the corresponding eigenvectors as its columns:
es: Eigensystem devuelve una lista de dos elementos: El primer elemento es una lista de valores propios. El segundo elemento es una matriz que contiene los vectores propios correspondientes como sus columnas:

source: Computes the Frobenius inner product between two matrices:
es: Calcula el producto interno de Frobenius entre dos matrices:

source: Computes the outer produce between two vectors:
es: Calcula el producto externo entre dos vectores:

source: Note that `outer` always treats both vectors as column vectors.
es: Tenga en cuenta que `outer` siempre trata ambos vectores como vectores columna.

source: Returns the inverse of a matrix if it is invertible. Raises a `MtrxSnglr` error if the matrix is singular. E.g.
es: Devuelve el inverso de una matriz si es invertible. Genera un error `MtrxSnglr` si la matriz es singular. P. ej..

source: yields the inverse of the matrix `m`, such that mi\*m is the identity matrix.
es: produce la inversa de la matriz `m`, tal que mi\*m es la matriz identidad.

source: Returns a matrix norm. By default the L2 norm is returned:
es: Devuelve una norma de matriz. De forma predeterminada, se devuelve la norma L2:

source: // Expect: sqrt(30) = 5.47723...
es: // esperado: sqrt(30) = 5.47723...

source: You can select a different norm by supplying an argument:
es: Puede seleccionar una norma diferente proporcionando un argumento:

source: // Expect: 10 (L1 norm is sum of absolute values)
es: // experado: 10 (la norma L1 es la suma de valores absolutos)

source: // Expect: 4.64159 (An unusual choice of norm)
es: // experado: 4.64159 (Una elección inusual de norma)

source: // Expect: 4 (Inf-norm corresponds to maximum absolute value)
es: // esperado: 4 (La norma Inf corresponde al valor absoluto máximo)

source: Changes the dimensions of a matrix such that the total number of elements remains constant:
es: Cambia las dimensiones de una matriz de modo que el número total de elementos permanezca constante:

source: // 1 row, 4 columns
es: // 1 fila, 4 columnas

source: // Expect: [ 1, 2, 3, 4 ]
es: // esperado: [ 1, 2, 3, 4 ]

source: Note that elements are stored in column major-order.
es: Tenga en cuenta que los elementos se almacenan en orden principal de columna.

source: Returns the sum of all entries in a matrix:
es: Devuelve la suma de todas las entradas de una matriz:

source: Transpose
es: Traspose

source: Returns the transpose of a matrix:
es: Devuelve la transpuesta de una matriz:

source: Computes the trace (the sum of the diagonal elements) of a square matrix:
es: Calcula la traza (la suma de los elementos diagonales) de una matriz cuadrada:

source: Rotates values in a Matrix about a given axis by a given shift:
es: Rota los valores de una matriz alrededor de un eje determinado en un desplazamiento determinado:

source: Elements that roll beyond the last position are re-introduced at the first.
es: Los elementos que ruedan más allá de la última posición se vuelven a introducir en la primera.

source: Constructs an identity matrix of a specified size:
es: Construye una matriz de identidad de un tamaño especificado:

source: Ranges represent a sequence of numerical values. There are two ways to create them depending on whether the upper value is included or not:
es: Los rangos representan una secuencia de valores numéricos. Hay dos formas de crearlos en función de si se incluye el valor superior o no:

source: // inclusive version, i.e. [1,2,3,4,5]
es: // versión inclusiva, es decir, [1,2,3,4,5]

source: // exclusive version, i.e. [1,2,3,4]
es: // versión exclusiva, es decir, [1,2,3,4]
