Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: Replace `$...$` with `\\(...\\)` within this MarkDown file to make the inline math compatible with MathJax (I used a small `re` script available on the GitHub repository under `src/replacedollars.py`).
es: Reemplace `$...$` con `\\(…\\)` dentro de este archivo MarkDown para que las matemáticas en línea sean compatibles con MathJax (utilicé un pequeño script `re` disponible en el repositorio de GitHub en `src/replacedollars.py`).

source: Contributing
es: Contribuciones

source: Contributions are absolutely welcome! Check out the [Issues](https://github.com/joshichaitanya3/morpho-manual/issues) on GitHub or make a pull request!
es: ¡Las contribuciones son absolutamente bienvenidas! ¡Echa un vistazo a [Issues](https://github.com/joshichaitanya3/morpho-manual/issues) en GitHub o haz una solicitud de extracción!
