Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: Counts the number of elements. If no argument is provided, returns the number of vertices. Otherwise, returns the number of elements present of a given grade:
es: Cuenta el número de elementos. Si no se proporciona ningún argumento, devuelve el número de vértices. De lo contrario, devuelve el número de elementos presentes de una calificación determinada:

source: // Returns the number of area-like elements.
es: // Devuelve el número de elementos similares a áreas.

source: The Selection class enables you to select components of a mesh for later use. You can supply a function that is applied to the coordinates of every vertex in the mesh, or select components like boundaries.
es: La clase Selection permite seleccionar componentes de una malla para su uso posterior. Puede proporcionar una función que se aplique a las coordenadas de cada vértice de la malla o seleccionar componentes como límites.

source: Create an empty selection:
es: Crea una selección vacía:

source: Select vertices above the z=0 plane using an anonymous function:
es: Seleccione los vértices por encima del plano z=0 usando una función anónima:

source: Select the boundary of a mesh:
es: Seleccione la frontera de una malla:

source: Selection objects can be composed using set operations:
es: Los objetos de selección se pueden componer mediante operaciones de conjunto:

source: To add additional grades, use the addgrade method. For example, to add areas:
es: Para agregar calificaciones adicionales, use el método addgrade. Por ejemplo, para agregar áreas:

source: \[showsubtopics\]: # subtopics
es: \[showsubtopics\]: # subtemas

source: Adds elements of the specified grade to a Selection. For example, to add edges to an existing selection, use
es: Añade elementos de la calificación especificada a una selección. Por ejemplo, para añadir aristas a una selección existente, utilice

source: By default, this only adds an element if _all_ vertices in the element are currently selected. Sometimes, it's useful to be able to add elements for which only some vertices are selected. The optional argument `partials` allows you to do this:
es: De forma predeterminada, esto solo agrega un elemento si _todos_ los vértices del elemento están seleccionados actualmente. A veces, es útil poder agregar elementos para los que solo se seleccionan algunos vértices. El argumento opcional `partials` le permite hacer esto:

source: Note that this method modifies the existing selection, and does not generate a new Selection object.
es: Tenga en cuenta que este método modifica la selección existente y no genera un nuevo objeto Selection.

source: Removes elements of the specified grade from a Selection. For example, to remove edges from an existing selection, use
es: Elimina elementos de la calificación especificada de una selección. Por ejemplo, para eliminar aristas de una selección existente, utilice

source: Returns a list of element ids included in the selection.
es: Devuelve una lista de identificadores de elementos incluidos en la selección.

source: To find out which edges are selected:
es: Para saber qué bordes están seleccionados:

source: Checks if an element id is selected, returning `true` or `false` accordingly.
es: Comprueba si se ha seleccionado un identificador de elemento, devolviendo `true` o `false` en consecuencia.

source: To check if edge number 5 is selected:
es: Para comprobar si se ha seleccionado el borde número 5:

source: This section provides the documentation for the `File` object.
es: En esta sección se proporciona la documentación del objeto `File`.

source: The `File` class provides the capability to read from and write to files, or to obtain the contents of a file in convenient formats.
es: La clase `File` proporciona la capacidad de leer y escribir en archivos, o de obtener el contenido de un archivo en formatos convenientes.

source: To open a file, create a File object with the filename as the argument
es: Para abrir un archivo, cree un objeto File con el nombre de archivo como argumento

source: which opens `"myfile.txt"` for _reading_. To open a file for writing or appending, you need to provide a mode selector
es: que abre `’’myfile.txt’’` para _leer_. Para abrir un archivo para escribirlo o anexarlo, debe proporcionar un selector de modo

source: Once the file is open, you can then read or write by calling appropriate methods:
es: Una vez abierto el archivo, puede leer o escribir llamando a los métodos adecuados:

source: // reads the contents of the file into an array of lines.
es: // lee el contenido del archivo en una matriz de líneas.

source: // reads a single line
es: // lee una sola línea

source: // reads a single character.
es: // lee un solo carácter.

source: // writes the arguments to the file.
es: // escribe los argumentos en el archivo.

source: After you're done with the file, close it with
es: Una vez que haya terminado con el archivo, ciérrelo con

source: Returns the contents of a file as an array of strings; each element corresponds to a single line.
es: Devuelve el contenido de un archivo como una matriz de cadenas; Cada elemento corresponde a una sola línea.

source: Read in the contents of a file and print line by line:
es: Lea el contenido de un archivo e imprima línea por línea:

source: Reads a single line from a file; returns the result as a string.
es: Lee una sola línea de un archivo; Devuelve el resultado como una cuerda.

source: Read in the contents of a file and print each line:
es: Lea el contenido de un archivo e imprima cada línea:

source: Reads a single character from a file; returns the result as a string.
es: Lee un solo carácter de un archivo; Devuelve el resultado como una cadena.

source: Writes to a file.
es: Escribe en un archivo.

source: Write the contents of a list to a file:
es: Escriba el contenido de una lista en un archivo:

source: Closes an open file.
es: Cierra un archivo abierto.

source: Returns true if at the end of the file; false otherwise
es: Devuelve true si está al final del archivo; false de lo contrario

source: The `Folder` class enables you to find whether a filepath refers to a folder, and find the contents of that folder.
es: La clase `Folder` le permite averiguar si una ruta de archivo se refiere a una carpeta y encontrar el contenido de esa carpeta.

source: Find whether a path refers to a folder:
es: Averigüe si una ruta de acceso hace referencia a una carpeta:

source: Get a list of a folder's contents:
es: Obtener una lista del contenido de una carpeta:

source: The `JSON` class provides import and export functionality for the JSON (JavaScript Object Notation) interchange file format as defined by IETF RFC 7159.
es: La clase `JSON` proporciona funcionalidad de importación y exportación para el formato de archivo de intercambio JSON (JavaScript Object Notation) tal como se define en IETF RFC 7159.

source: To parse a string that contains JSON, use the `parse` method:
es: Para analizar una cadena que contiene JSON, use el método `parse`:

source: // expect: [ 1, 2, 3, 4 ]
es: // esperado: [ 1, 2, 3, 4 ]

source: Elements in the JSON string are converted to equivalent morpho values.
es: Los elementos de la cadena JSON se convierten en valores morpho equivalentes.

source: To convert basic data types to JSON, use the `tostring` method:
es: Para convertir tipos de datos básicos a JSON, use el método `tostring`:

source: The exporter supports `nil`, boolean values `true` and `false`, numbers, `String`s as well as `List` and `Dictionary` objects that may contain any of the supported types.
es: El exportador admite `nil`, valores booleanos `true` y `false`, números, `String`s, así como objetos `List` y `Dictionary` que pueden contener cualquiera de los tipos admitidos.

source: This section provides the documentation for the various standard modules shipped with Morpho.
es: Esta sección proporciona la documentación de los diversos módulos estándar enviados con Morpho.

source: The `color` module provides support for working with color. Colors are represented in morpho by `Color` objects. The module predefines some colors including `Red`, `Green`, `Blue`, `Black`, `White`.
es: El módulo `color` proporciona soporte para trabajar con color. Los colores se representan en morpho mediante objetos `Color`. El módulo predefine algunos colores, incluidos `Red`, `Green`, `Blue`, `Black`, `White`.

source: To use the module, use import as usual:
es: Para usar el módulo, use import como de costumbre:

source: Create a Color object from an RGB pair:
es: Cree un objeto Color a partir de un par RGB:

source: // A 50% gray
es: // Un rayo 50% gris

source: The `color` module also provides `ColorMap`s, which are give a sequence of colors as a function of a parameter; these are useful for plotting the values of a `Field` for example.
es: El módulo `color` también proporciona `ColorMap`s, que dan una secuencia de colores en función de un parámetro; estos son útiles para trazar los valores de un `Campo`, por ejemplo.

source: Gets the rgb components of a `Color` or `ColorMap` object as a list. Takes a single argument in the range 0 to 1, although the result will only depend on this argument if the object is a `ColorMap`.
es: Obtiene los componentes rgb de un objeto `Color` o `ColorMap` como una lista. Toma un solo argumento en el rango de 0 a 1, aunque el resultado solo dependerá de este argumento si el objeto es un `ColorMap`.

source: Built in `Color` object for use with the `graphics` and `plot` modules.
es: Objeto `Color` incorporado para su uso con los módulos 'graphics' y `plot`.

source: Colormap
es: Colormap (Mapa de colores)

source: The `color` module provides `ColorMap`s which are subclasses of `Color` that map a single parameter in the range 0 to 1 onto a continuum of colors. `Color`s and `Colormap`s have the same interface.
es: El módulo `color` proporciona `ColorMap`s, que son subclases de `Color` que asignan un solo parámetro en el rango de 0 a 1 en un continuo de colores. `Color` y `Colormap` tienen la misma interfaz.

source: Get the red, green or blue components of a color or colormap:
es: Obtenga los componentes rojos, verdes o azules de un mapa de colores o colores:

source: // argument can be in range 0 to 1
es: // el argumento puede estar en el rango de 0 a 1

source: Get all three components as a list:
es: Obtenga los tres componentes en una lista:

source: Create a grayscale:
es: Crea una escala de grises:

source: // 20% gray
es: // 20% gris

source: Available ColorMaps: `GradientMap`, `GrayMap`, `HueMap`, `ViridisMap`, `MagmaMap`, `InfernoMap` and `PlasmaMap`.
es: Mapas de colores disponibles: `GradientMap`, `GrayMap`, `HueMap`, `ViridisMap`, `MagmaMap`, `InfernoMap` y `PlasmaMap`.

source: `GradientMap` is a `Colormap` that displays a white-green-purple sequence.
es: `GradientMap` es un `Colormap` que muestra una secuencia blanco-verde-púrpura.

source: GrayMap
es: GrayMap (Mapa de grises)

source: `GrayMap` is a `Colormap` that displays grayscales.
es: `GrayMap` es un `Colormap` que muestra escalas de grises.

source: HueMap
es: HueMap (Mapa de tonos)

source: `HueMap` is a `Colormap` that displays vivid colors. It is periodic on the interval 0 to 1.
es: `HueMap` es un `Colormap` que muestra colores vivos. Es periódico en el intervalo de 0 a 1.

source: `ViridisMap` is a `Colormap` that displays a purple-green-yellow sequence. It is perceptually uniform and intended to be improve the accessibility of visualizations for viewers with color vision deficiency.
es: `ViridisMap` es un `Colormap` que muestra una secuencia púrpura-verde-amarilla. Es perceptualmente uniforme y está destinado a mejorar la accesibilidad de las visualizaciones para los espectadores con deficiencia en la visión del color.

source: `MagmaMap` is a `Colormap` that displays a black-red-yellow sequence. It is perceptually uniform and intended to be improve the accessibility of visualizations for viewers with color vision deficiency.
es: `MagmaMap` es un `Colormap` que muestra una secuencia negro-rojo-amarillo. Es perceptualmente uniforme y está destinado a mejorar la accesibilidad de las visualizaciones para los espectadores con deficiencia en la visión del color.

source: `InfernoMap` is a `Colormap` that displays a black-red-yellow sequence. It is perceptually uniform and intended to be improve the accessibility of visualizations for viewers with color vision deficiency.
es: `InfernoMap` es un `Colormap` que muestra una secuencia negro-rojo-amarillo. Es perceptualmente uniforme y está destinado a mejorar la accesibilidad de las visualizaciones para los espectadores con deficiencia en la visión del color.

source: `InfernoMap` is a `Colormap` that displays a blue-red-yellow sequence. It is perceptually uniform and intended to be improve the accessibility of visualizations for viewers with color vision deficiency.
es: `InfernoMap` es un `Colormap` que muestra una secuencia azul-rojo-amarillo. Es perceptualmente uniforme y está destinado a mejorar la accesibilidad de las visualizaciones para los espectadores con deficiencia en la visión del color.

source: The constants module contains a number of useful mathematical constants. Import it like any other module:
es: El módulo de constantes contiene una serie de constantes matemáticas útiles. Impórtalo como cualquier otro módulo:

source: Available constants:
es: Constantes disponibles:

source: `E` the base of natural logarithms.
es: `E` la base de los logaritmos naturales.

source: `Pi` ratio of the perimeter of a circle to its diameter.
es: Relación `Pi` entre el perímetro de un círculo y su diámetro.

source: The `delaunay` module creates Delaunay triangulations from point clouds. It is dimensionally independent, so generates tetrahedra in 3D and higher order simplices beyond.
es: El módulo `delaunay` crea triangulaciones de Delaunay a partir de nubes de puntos. Es dimensionalmente independiente, por lo que genera tetraedros en 3D y simplificaciones de orden superior más allá.

source: To use the module, first import it:
es: Para usar el módulo, primero impórtelo:

source: To create a Delaunary triangulation from a list of points:
es: Para crear una triangulación de Delaunary a partir de una lista de puntos:

source: The module also provides `DelaunayMesh` to directly create meshes from Delaunay triangulations.
es: El módulo también proporciona `DelaunayMesh` para crear directamente mallas a partir de triangulaciones de Delaunay.

source: The `triangulate` method performs the delaunay triangulation. To use it, first construct a `Delaunay` object with the point cloud of interest:
es: El método de `triangulación` realiza la triangulación de Delaunay. Para usarlo, primero construya un objeto `Delaunay` con la nube de puntos de interés:

source: Then call `triangulate`:
es: A continuación, llame a `triangular`:

source: This returns a list of triangles `[ [i, j, k], ... ]`.
es: Esto devuelve una lista de triángulos `[ [i, j, k], ... ] `.

source: Circumsphere
es: Circumsphere (Circunsfera)

source: The `Circumsphere` class calculates the circumsphere of a set of points, i.e. a sphere such that all the points are on the surface of the sphere. It is used internally by the `delaunay` module.
es: La clase `Circumsphere` calcula la circunsfera de un conjunto de puntos, es decir, una esfera tal que todos los puntos están en la superficie de la esfera. Es utilizado internamente por el módulo `delaunay`.

source: Create a `Circumsphere` from a list of points and a triangle specified by indices into that list:
es: Cree una `Circumsphere` a partir de una lista de puntos y un triángulo especificado por índices en esa lista:

source: Test if an arbitrary point is inside the `Circumsphere` or not:
es: Pruebe si un punto arbitrario está dentro de la `Circumsphere` o no:

source: The `graphics` module provides a number of classes to provide simple visualization capabilities. To use it, you first need to import the module:
es: El módulo `graphics` proporciona una serie de clases para proporcionar capacidades de visualización simples. Para utilizarlo, primero hay que importar el módulo:

source: The `Graphics` class acts as an abstract container for graphical information; to actually launch the display see the `Show` class. You can create an empty scene like this,
es: La clase `Graphics` actúa como un contenedor abstracto de información gráfica; para iniciar realmente la pantalla, consulte la clase `Show`. Puedes crear una escena vacía como esta,

source: Additional elements can be added using the `display` method.
es: Se pueden agregar elementos adicionales usando el método `display`.

source: Morpho provides the following fundamental Graphical element classes:
es: Morpho proporciona las siguientes clases fundamentales de elementos gráficos:

source: You can also use functions like `Arrow`, `Tube` and `Cylinder` to create these elements conveniently.
es: También puede usar funciones como `Arrow`, `Tube` y `Cylinder` para crear estos elementos convenientemente.

source: To combine graphics objects, use the add operator:
es: Para combinar objetos gráficos, utilice el operador add:

source: `Show` is used to launch an interactive graphical display using the external `morphoview` application. `Show` takes a `Graphics` object as an argument:
es: `Show` se utiliza para lanzar una pantalla gráfica interactiva utilizando la aplicación externa `morphoview`. `Show` toma un objeto `Graphics` como argumento:

source: A `TriangleComplex` is a graphical element that can be used as part of a graphical display. It consists of a list of vertices and a connectivity matrix that selects which vertices are used in each triangle.
es: Un `TriangleComplex` es un elemento gráfico que se puede utilizar como parte de una representación gráfica. Consta de una lista de vértices y una matriz de conectividad que selecciona qué vértices se utilizan en cada triángulo.

source: To create one, call the constructor with the following arguments:
es: Para crear uno, llame al constructor con los siguientes argumentos:

source: `position` is a `Matrix` containing vertex positions as _columns_.
es: `position` es una 'matriz' que contiene las posiciones de los vértices como _columnas_.

source: `normals` is a `Matrix` with a normal for each vertex.
es: `normals` es una 'matriz' con una normal para cada vértice.

source: `colors` is the color of the object.
es: `colors` es el color del objeto.

source: `connectivity` is a `Sparse` matrix where each column represents a triangle and rows correspond to vertices.
es: `conectivity` es una matriz `Sparse` donde cada columna representa un triángulo y las filas corresponden a vértices.

source: You can also provide optional arguments:
es: También puede proporcionar argumentos opcionales:

source: `transmit` sets the transparency of the object. This parameter is only used by the povray module as of now. Default is 0.
es: `transmit` establece la transparencia del objeto. Este parámetro solo es utilizado por el módulo povray a partir de ahora. El valor predeterminado es 0.

source: `filter` sets the transparency of the object using a filter effect. This parameter is only used by the povray module as of now. Default is 0. For the difference between `transmit` and `filter`, checkout the [POVRay documentation](http://xahlee.info/3d/povray-glassy.html).
es: `filter` establece la transparencia del objeto mediante un efecto de filtro. Este parámetro solo es utilizado por el módulo povray a partir de ahora. El valor predeterminado es 0. Para conocer la diferencia entre `transmit` y `filter`, consulte la [documentación de POVRay](http://xahlee.info/3d/povray-glassy.html).

source: Add to a `Graphics` object using the `display` method.
es: Agregue a un objeto `Gráficos` usando el método `display`.

source: The `Arrow` function creates an arrow. It takes two arguments:
es: La función `Arrow` crea una flecha. Se necesitan dos argumentos:

source: `start` and `end` are the two vertices. The arrow points `start` -> `end`.
es: `start` y `end` son los dos vértices. La flecha apunta a `inicio` > `fin`.

source: `aspectratio` controls the width of the arrow relative to its length
es: `aspectratio` controla el ancho de la flecha en relación con su longitud

source: `n` is an integer that controls the quality of the display. Higher `n` leads to a rounder arrow.
es: `n` es un número entero que controla la calidad de la pantalla. Una `n` más alta conduce a una flecha más redonda.

source: `color` is the color of the arrow. This can be a list of RGB values or a `Color` object
es: `color` es el color de la flecha. Puede ser una lista de valores RGB o un objeto `Color`

source: `transmit` sets the transparency of the arrow. This parameter is only used by the povray module as of now. Default is 0.
es: `transmit` establece la transparencia de la flecha. Este parámetro solo es utilizado por el módulo povray a partir de ahora. El valor predeterminado es 0.

source: `filter` sets the transparency of the arrow using a filter effect. This parameter is only used by the povray module as of now. Default is 0. For the difference between `transmit` and `filter`, checkout the [POVRay documentation](http://xahlee.info/3d/povray-glassy.html).
es: `filter` establece la transparencia de la flecha usando un efecto de filtro. Este parámetro solo es utilizado por el módulo povray a partir de ahora. El valor predeterminado es 0. Para conocer la diferencia entre 'transmitir' y 'filtrar', consulte la [documentación de POVRay](http://xahlee.info/3d/povray-glassy.html).

source: Display an arrow:
es: Mostrar una flecha:

source: Tube
es: Tubo

source: Text
es: Texto

source: ImplicitMesh
es: Implicitmesh (Malla implícita)

source: To create a sphere, first create an ImplicitMeshBuilder object with the implict function you'd like to use:
es: Para crear una esfera, primero cree un objeto ImplicitMeshBuilder con la función implícita que desea usar:

source: You can use an existing function (or method) as well as an anonymous function as above.
es: Puede utilizar una función (o método) existente, así como una función anónima como la anterior.

source: Then build the mesh,
es: A continuación, construye la malla,

source: The `build` method takes a number of optional arguments:
es: El método `build` toma una serie de argumentos opcionales:

source: To create a tree from a list of points:
es: Para crear un árbol a partir de una lista de puntos:

source: Add further points:
es: Añade más puntos:

source: Test whether a given point is present in the tree:
es: Compruebe si un punto dado está presente en el árbol:

source: Find all points within a given bounding box:
es: Encuentre todos los puntos dentro de un cuadro delimitador determinado:

source: Find the nearest point to a given point:
es: Encuentre el punto más cercano a un punto determinado:

source: Inserts a new point into a k-d tree. Returns a KDTreeNode object.
es: Inserta un nuevo punto en un árbol k-d. Devuelve un objeto KDTreeNode.

source: Note that, for performance reasons, if the set of points is known ahead of time, it is generally better to build the tree using the constructor function KDTree rather than one-by-one with insert.
es: Tenga en cuenta que, por razones de rendimiento, si el conjunto de puntos se conoce de antemano, generalmente es mejor construir el árbol usando la función constructora KDTree en lugar de uno por uno con insert.

source: Checks if a point is a member of a k-d tree. Returns `true` or `false`.
es: Comprueba si un punto es miembro de un árbol k-d. Devuelve `verdadero` o `falso`.

source: Nearest
es: Más cercano

source: Finds the point in a k-d tree nearest to a point of interest. Returns a KDTreeNode object.
es: Busca el punto en un árbol k-d más cercano a un punto de interés. Devuelve un objeto KDTreeNode.
