Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: The Morpho Manual
es: El Manual Morpho

source: Foreword
es: Introducción

source: Overview
es: Descripción general

source: Installing Morpho
es: Instalación de Morpho

source: Install with homebrew
es: Instalación via homebrew

source: Install with source
es: Instalación con el código fuente

source: Windows via Windows Subsystem for Linux (WSL)
es: Windows a través del subsistema de Windows para Linux (WSL)

source: Updating _morpho_
es: Actualización de _morpho_

source: Uninstalling _morpho_
es: Desinstalación de _morpho_

source: Using Morpho
es: Usando Morpho

source: Importing Modules
es: Importación de módulos

source: Morpho Language
es: El lenguaje Morpho

source: Creating the initial mesh
es: Creación de la malla inicial

source: Selections
es: Selecciones

source: Fields
es: Campos

source: Defining the problem
es: Definición del problema

source: Performing the optimization
es: Realizando la optimización

source: Visualizing the results
es: Visualización de los resultados

source: Refinement
es: Refinamiento

source: Next steps
es: Siguientes pasos

source: Working with meshes
es: Trabajando con mallas

source: The meshgen module
es: El módulo meshgen

source: The meshtools module
es: El módulo meshtools

source: The vtk module
es: El módulo vtk

source: Merging meshes
es: Uniendo mallas

source: Slicing meshes
es: Seleccionando mallas

source: Visualization
es: Visualización

source: The plot module
es: El módulo de visualización

source: The graphics module
es: El módulo de gráficos

source: The povray module
es: El módulo povray

source: Examples
es: Ejemplos

source: Catenoid
es: Catenoide

source: Cholesteric
es: Colestérico

source: Cube
es: Cubo

source: Electrostatics
es: Electrostática

source: Plot
es: Trama

source: Wrap
es: Envolver

source: Reference
es: Referencias

source: Language
es: Idioma

source: Syntax
es: Sintaxis

source: Values
es: Valores

source: Control Flow
es: Flujo de control

source: Functions
es: Funciones

source: Classes
es: Clases

source: Modules
es: Módulos

source: Help
es: Ayuda

source: Errors
es: Errores

source: Data Types
es: Tipos de datos

source: Complex
es: Complejo

source: List
es: Lista

source: Matrix
es: Matriz

source: Range
es: Rango

source: Sparse
es: Escaso

source: String
es: Cadena

source: Tuple
es: Tupla

source: Computational Geometry
es: Geometría Computacional

source: Field
es: Campo

source: Functionals
es: Funcionales

source: Mesh
es: Malla

source: Selection
es: Selección

source: I/O
es: E/S

source: File
es: Archivo

source: Constants
es: Constantes

source: Graphics
es: Gráficos

source: Optimize
es: Optimizar

source: About this online version
es: Acerca de esta versión en línea

source: Version 0.6.0
es: Versión 0.6.0

source: Acknowledgements
es: Agradecimientos

source: The principal architect of _morpho_, T J Atherton, wishes to thank the many people who have used various versions of the program or otherwise contributed to the project:
es: El arquitecto principal de _morpho_, T J Atherton, desea agradecer a las muchas personas que han utilizado varias versiones del programa o han contribuido al proyecto:

source: Ian Hunter
es: Ian Cazador

source: Mathew Giso
es: Mateo Giso

source: Hudson Ramirez
es: Hudson Ramírez

source: _This material is based upon work supported by the National Science Foundation under grants DMR-1654283 and OAC-2003820._
es: _This material se basa en el trabajo apoyado por la Fundación Nacional de Ciencias bajo las subvenciones DMR-1654283 y OAC-2003820._

source: _Morpho_ aims to solve the following class of problems. Consider a functional, $$F=\int\_{C}f(q,\nabla q,\nabla^{2}q,...)d^{n}x+\int\_{\partial C}g(q,\nabla q,\nabla^{2}q,...)d^{n-1}x,$$ where \\(q\\) represents a set of fields defined on a manifold \\(C\\) that could include scalar, vector, tensor or other quantities and their derivatives \\(\nabla^{n}q\\). The functional includes terms in the bulk and on the boundary \\(\partial C\\) and might also include geometric properties of the manifold such as local curvatures. This functional is to be minimized from an initial guess \\( \\{ C\_{0},q\_{0} \\}\\) with respect to the fields \\(q\\) and the shape of the manifold \\(C\\). Global and local constraints may be imposed both on \\(C\\) and \\(q\\).
es: _Morpho_ tiene como objetivo resolver la siguiente clase de problemas. Considere un funcional, $$F=\int\_{C}f(q,\nabla q,\nabla^{2}q,...) d^{n}x+\int\_{\partial C}g(q,\nabla q,\nabla^{2}q,...) d^{n-1}x,$$ donde \\(q\\) representa un conjunto de campos definidos en una variedad \\(C\\), la cual podría incluir escalares, vectores, tensores u otras cantidades y sus derivadas \\(\nabla^{n}q\\). El funcional incluye términos en el interior y en la frontera \\(\partial C\\) y también puede incluir propiedades geométricas de la variedad, como curvaturas locales. Este funcional debe minimizarse a partir de una valor inicial propuesto \\( \\{ C\_{0},q\_{0} \\}\\) con respecto a los campos \\(q\\) y la forma de la variedad \\(C\\). Se pueden imponer restricciones globales y locales tanto en \\(C\\) como en \\(q\\).

source: _Morpho_ is an object-oriented environment: all components of the problem, including the computational domain, fields, functionals etc. are all represented as objects that interact with one another. Much of the effort in writing a _morpho_ program involves creating and manipulating these objects. The environment is flexible, modular, and users can easily create new kinds of object, or entirely change how _morpho_ works.
es: _Morpho_ es un entorno orientado a objetos: todos los componentes del problema, incluyendo el dominio computacional, los campos, los funcionales, etc., se representan como objetos que interactúan entre sí. Gran parte del esfuerzo en la escritura de un programa en _morpho_ implica la creación y manipulación de estos objetos. El entorno es flexible, modular y los usuarios pueden crear fácilmente nuevos tipos de objetos o cambiar por completo el funcionamiento de _morpho_.

source: This manual aims to help users to learn to use _morpho_. It provides installation instructions in [Chapter 2](installing_morpho.md), information about how to run the program in [Chapter 3](using_morpho.md). A detailed tutorial is provided in [Chapter 4](tutorial.md), showing how to set up and solve an example problem. [Chapter 5](working_with_meshes.md) provides information about working with meshes and [Chapter 6](visualization.md) describes how to visualize the results of your calculation with _morpho_. The examples provided with morpho are described in [Chapter 7](examples.md). The remaining chapters, comprising the second part of the manual, provide a reference guide for all areas of _morpho_ functionality.
es: Este manual tiene como objetivo ayudar a los usuarios a aprender a usar _morpho_. Proporciona instrucciones de instalación en [Capítulo 2](installing_morpho.md), información sobre cómo ejecutar el programa en [Capítulo 3](using_morpho.md). En el [Capítulo 4](tutorial.md) se proporciona un tutorial detallado que muestra cómo configurar y resolver un problema de ejemplo. [Capítulo 5] (working_with_meshes.md) proporciona información sobre cómo trabajar con mallas y [Capítulo 6](visualization.md) describe cómo visualizar los resultados de su cálculo con _morpho_. Los ejemplos proporcionados con morpho se describen en el [Capítulo 7](examples.md). Los capítulos restantes, que comprenden la segunda parte del manual, proporcionan una guía de referencia para todas las áreas de la funcionalidad de _morpho_.

source: Installing _Morpho_
es: Instalación de _Morpho_

source: _Morpho_ is hosted on a publicly available github repository <https://github.com/Morpho-lang/morpho>. _Morpho_ also requires two subsidiary programs, a terminal app hosted in <https://github.com/Morpho-lang/morpho-cli>, and a viewer application <https://github.com/Morpho-lang/morpho-morphoview>. _Morpho_ is extendable, and packages providing additional functionality are hosted in git repositories.
es: _Morpho_ está alojado en un repositorio de github disponible públicamente <https://github.com/Morpho-lang/morpho>. _Morpho_ también requiere dos programas subsidiarios, una aplicación de terminal alojada en <https://github.com/Morpho-lang/morpho-cli> y una aplicación de visualización <https://github.com/Morpho-lang/morpho-morphoview>. _Morpho_ es extensible, y los paquetes que proporcionan funcionalidad adicional se alojan en repositorios de git.

source: For this release, _morpho_ can be installed on all supported platforms using the homebrew package manager. Alternatively, the program can be installed from source as described below. We are continuously working on improving _morpho_ installation, and hope to provide additional mechanisms for installation in upcoming releases.
es: Para esta versión, _morpho_ se puede instalar en todas las plataformas compatibles utilizando el administrador de paquetes homebrew. Alternativamente, el programa se puede instalar desde la fuente como se describe a continuación. Estamos trabajando continuamente para mejorar la instalación de _morpho_ y esperamos proporcionar mecanismos adicionales para la instalación en las próximas versiones.

source: The simplest way to install _morpho_ is through the [homebrew package manager](https://brew.sh). To do so:
es: La forma más sencilla de instalar _morpho_ es a través del [administrador de paquetes homebrew](https://brew.sh). Para ello:

source: If not already installed, install homebrew on your machine as described on the [homebrew website](https://brew.sh).
es: Si aún no está instalado, instale homebrew en su máquina como se describe en el [sitio web de homebrew](https://brew.sh).

source: Open a terminal and type:
es: Abra un terminal y escriba:

source: If you need to uninstall morpho, simply open a terminal and type `brew uninstall morpho`. It's very important to uninstall the homebrew morpho in this way _before_ attempting to install from source as below.
es: Si necesita desinstalar morpho, simplemente abra una terminal y escriba 'brew uninstall morpho'. Es muy importante desinstalar el homebrew morpho de esta manera _antes_ de intentar instalarlo desde la fuente como se muestra a continuación.

source: Install from source
es: Instalación desde el código fuente

source: The second way to install morpho is by compiling the source code directly. Morpho now leverages the [CMake](https://cmake.org) build system, which enables platform independent builds.
es: La segunda forma de instalar morpho es compilando el código fuente directamente. Morpho ahora aprovecha el sistema de compilación [CMake](https://cmake.org), que permite compilaciones independientes de la plataforma.

source: Where a _morpho_ source installation puts things
es: Donde una instalación de código fuente _morpho_ pone las cosas

source: A _morpho_ installation includes help files, modules, and other resources. By default, these are installed in the **/usr/local/** file structure as follows:
es: Una instalación _morpho_ incluye archivos de ayuda, módulos y otros recursos. De forma predeterminada, se instalan en la estructura de archivos **/usr/local/** de la siguiente manera:

source: **/usr/local/bin** : The morpho and morphoview executables are placed here.
es: **/usr/local/bin** : Aquí se colocan los ejecutables morpho y morphoview.

source: **/usr/local/share/morpho** : Help files and modules are stored here.
es: **/usr/local/share/morpho** : Aquí se almacenan los archivos y módulos de ayuda.

source: **/usr/local/include/morpho** : Morpho header files for building extensions.
es: **/usr/local/include/morpho** : Archivos de cabecera de Morpho para construir extensiones.

source: **/usr/local/lib/morpho** : Morpho extensions.
es: **/usr/local/lib/morpho** : Extensiones de Morpho.

source: Collect Dependencies
es: Recopilación de dependencias

source: _Morpho_ requires a few libraries to provide certain functionality:
es: _Morpho_ requiere algunas bibliotecas para proporcionar cierta funcionalidad:

source: **blas/lapack** : are used for dense linear algebra.
es: **blas/lapack** : se utilizan para cálculos demandantes de álgebra lineal.

source: **suitesparse** : is used for sparse linear algebra.
es: **suitesparse** : se utiliza para álgebra lineal dispersa.

source: See <https://people.engr.tamu.edu/davis/suitesparse.html> and publications for details
es: Consulte <https://people.engr.tamu.edu/davis/suitesparse.html> y publicaciones para obtener más detalles

source: **povray** : is a ray-tracer that is used for publication-quality graphics (only required by the `povray` module).
es: **povray** : es un trazador de rayos que se utiliza para gráficos con calidad de publicación (solo requerido por el módulo 'Povray').

source: The terminal application uses
es: La aplicación de terminal utiliza

source: **libgrapheme** _or_,
es: **libgrapheme** _o_,

source: **libunistring**: for unicode grapheme support.
es: **libunistring**: para soporte de grafemas Unicode.

source: _Morphoview_ additionally requires
es: _Morphoview_ requiere adicionalmente

source: **glfw** : to provide gui functionality.
es: **glfw** : para proporcionar la funcionalidad de la interfaz gráfica de usuario.

source: **freetype** : provides text display.
es: **freetype** : Proporciona visualización de texto.

source: Each of these dependencies can be installed using any appropriate package manager.
es: Cada una de estas dependencias se puede instalar utilizando cualquier administrador de paquetes adecuado.

source: Homebrew (preferred on macOS):
es: Homebrew (preferido en macOS):

source: Apt (preferred on Ubuntu):
es: Apt (preferido en Ubuntu):

source: Build the morpho shared library
es: Compilar la biblioteca compartida morpho

source: The core piece of _morpho_ is a shared library, that can then be used by multiple applications. To build it,
es: La pieza central de _morpho_ es una biblioteca compartida, que luego puede ser utilizada por múltiples aplicaciones. Para construirla,

source: Obtain the source by cloning the github public repository:
es: Obtenga el código fuente clonando el repositorio público de github:

source: Navigate to the `morpho` folder and build the library:
es: Navegue a la carpeta 'morpho' y construya la biblioteca:

source: Navigate back out of the morpho folder:
es: Vuelva a salir de la carpeta morpho:

source: Build the morpho terminal app
es: Compilar la aplicación de terminal morpho

source: The terminal app provides an interactive interface to _morpho_, and can also run morpho files.
es: La aplicación de terminal proporciona una interfaz interactiva para _morpho_ y también puede ejecutar archivos morpho.

source: Navigate to the `morpho-cli` folder and build the library:
es: Vaya a la carpeta 'morpho-cli' y construya la biblioteca:

source: Check it works by typing:
es: Comprueba que funciona escribiendo:

source: Assuming that the morpho terminal app starts correctly, type `quit` to return to the shell and then
es: Suponiendo que la aplicación de terminal morpho se inicia correctamente, escriba `quit` para volver al shell y luego

source: to navigate back out of the morpho-cli folder.
es: para volver a salir de la carpeta morpho-cli.

source: Build the morphoview viewer application
es: Compilar la aplicación de visor morphoview

source: _Morphoview_ is a simple viewer application to visualize _morpho_ results.
es: _Morphoview_ es una sencilla aplicación de visualización para visualizar los resultados de _morpho_.

source: which should simply run and quit normally. You can then type
es: que simplemente debería ejecutarse y salir normalmente. A continuación, puede escribir

source: to navigate back out of the morpho-morphoview folder.
es: para volver a salir de la carpeta morpho-morphoview.

source: Windows support is provided through Windows Subsystem for Linux (WSL), which is an environment that enables windows to run linux applications. We highly recommend using WSL2, which is the most recent version and provides better support for GUI applications; some instructions for WSL1 are provided below.
es: La compatibilidad con Windows se proporciona a través del Subsistema de Windows para Linux (WSL), que es un entorno que permite a Windows ejecutar aplicaciones de Linux. Se recomienda encarecidamente usar WSL2, que es la versión más reciente y proporciona una mejor compatibilidad con las aplicaciones GUI; a continuación se proporcionan algunas instrucciones para WSL1.

source: Begin by installing the [Ubuntu App](https://ubuntu.com/desktop/wsl) from the Microsoft store. Follow all the steps in this link to ensure that graphics are working.
es: Comience instalando la [Aplicación Ubuntu](https://ubuntu.com/desktop/wsl) desde la tienda de Microsoft. Siga todos los pasos de este enlace para asegurarse de que los gráficos funcionan.

source: Once the Ubuntu terminal is working in Windows, you can install _morpho_ either through homebrew or by building from source.
es: Una vez que el terminal de Ubuntu esté funcionando en Windows, puede instalar _morpho_ a través de homebrew o construyendo desde el código fuente.

source: Graphics On WSL1
es: Gráficos en WSL1

source: If you instead are working on WSL1, then you need to follow these instructions to get graphics running. Unless mentioned otherwise, all the commands below are run in the Ubuntu terminal.
es: Si, en cambio, está trabajando en WSL1, debe seguir estas instrucciones para que se ejecuten los gráficos. A menos que se indique lo contrario, todos los comandos a continuación se ejecutan en la terminal de Ubuntu.

source: A window manager must be installed so that the WSL can create windows. On Windows, install [VcXsrv](https://sourceforge.net/projects/vcxsrv/). It shows up as XLaunch in the Windows start menu.
es: Se debe instalar un administrador de ventanas para que WSL pueda crear ventanas. En Windows, instale [VcXsrv](https://sourceforge.net/projects/vcxsrv/). Aparece como XLaunch en el menú de inicio de Windows.

source: Open Xlaunch. Then,
es: Ejecute Xlaunch. Entonces,

source: choose 'Multiple windows', set display number to 0, and hit 'Next'
es: elija 'Múltiples ventanas', establezca el número de pantalla en 0 y presione 'Siguiente'

source: choose 'start no client' and hit 'Next'
es: elija 'no iniciar ningún cliente' y presione 'Siguiente'

source: **Unselect** 'native opengl' and hit 'Next'
es: **Anule la selección** de 'opengl nativo' y pulse 'Siguiente'

source: Hit 'Finish'
es: Clic "Finalizar"

source: In Ubuntu download a package containing a full suite of desktop utilities that allows for the use of windows.
es: En Ubuntu, descargue un paquete que contiene un conjunto completo de utilidades de escritorio que permite el uso de Windows.

source: Tell ubuntu which display to use
es: Dígale a ubuntu qué pantalla usar

source: To set the DISPLAY variable on login type
es: Para establecer la variable DISPLAY en el tipo de inicio de sesión

source: _\[Note that this assumes you are using bash as your terminal; you will may to adjust this line for other terminals\]._
es: _\[Tenga en cuenta que esto supone que está usando bash como su terminal; puede ajustar esta línea para otros terminales\]._

source: Test that the window system is working by running
es: Pruebe que el sistema de ventanas funciona ejecutando

source: which should open a window with some gears.
es: que debería abrir una ventana con algunos engranajes.

source: As new versions of _morpho_ are released, you will likely want to upgrade to the latest version. From the terminal:
es: A medida que se publiquen nuevas versiones de _morpho_, es probable que desee actualizar a la última versión. Desde la terminal:

source: If you used homebrew to install morpho, simply type,
es: Si usaste homebrew para instalar morpho, simplemente escribe,

source: If you installed _morpho_ manually, and still have the git repository folder on your computer, navigate to this with `cd` and type,
es: Si usted insttaló _morpho_ manualmente, y todavía tienes la carpeta del repositorio git en tu computadora, navega hasta ella con 'cd' y escribe,

source: which downloads any updates. You can then follow the above instructions to recompile _morpho._ It's not necessary to reinstall dependencies, but note that some new releases of _morpho_ may require additional dependencies.
es: que descarga las actualizaciones. A continuación, puede seguir las instrucciones anteriores para volver a compilar _morpho._ No es necesario reinstalar las dependencias, pero tenga en cuenta que algunas nuevas versiones de _morpho_ pueden requerir dependencias adicionales.

source: If you no longer have the original _morpho_ git repository folder from which you installed morpho, simply rerun the installation from scratch as above. You shouldn't need to reinstall dependencies.
es: Si ya no tiene la carpeta original del repositorio git _morpho_ desde la que instaló morpho, simplemente vuelva a ejecutar la instalación desde cero como se indicó anteriormente. No debería ser necesario volver a instalar las dependencias.

source: If you wish to uninstall morpho, you can do so simply from the terminal application.
es: Si desea desinstalar morpho, puede hacerlo simplemente desde la aplicación de terminal.

source: If you used homebrew to install morpho, simply type
es: Si usaste homebrew para instalar morpho, simplemente escribe

source: Alternatively, if you built _morpho_ from source, you can remove everything with
es: Alternativamente, si compiló _morpho_ desde el código fuente, puede eliminar todo con

source: You may need to prefix these with `sudo`.
es: Es posible que tengas que anteponerles el prefijo 'sudo'.

source: Using _Morpho_
es: Uso de _Morpho_

source: _Morpho_ is a command line application, like `python` or `lua`. It can be used to run scripts or programs, which are generally given the _.morpho_ file extension, or run interactively responding to user commands.
es: _Morpho_ es una aplicación de línea de comandos, como `python` o `lua`. Se puede utilizar para ejecutar scripts o programas, a los que generalmente se les da la extensión de archivo _.morpho_, o ejecutarse de forma interactiva respondiendo a los comandos del usuario.

source: Running a program
es: Ejecución de un programa

source: To run a program, simply run morpho with the name of the file,
es: Para ejecutar un programa, simplemente ejecute morpho con el nombre del archivo,

source: _Morpho_ supports a number of switches:
es: _Morpho_ soporta una serie de banderas:

source: **\-w** : Run _morpho_ with more than one worker thread, e.g. `-w 4` runs morpho with 4 threads.
es: **\-w** : Ejecuta _morpho_ con más de un hilo de trabajo, por ejemplo, `-w 4` ejecuta morpho con 4 hilos.

source: **\-D**: Display disassembly of the program without running it. _\[See developer guide\]_
es: **\-D**: Muestra el desmontaje del programa sin ejecutarlo. _\[Ver guía para desarrolladores\]_

source: **\-d** : Debugging mode. Morpho will stop and enter the debugger whenever a `@` is encountered in the source. _\[See developer guide\]_
es: **\-d** : Modo de depuración. Morpho se detendrá y entrará en el depurador cada vez que se encuentre una `@` en el código fuente. _\[Ver guía para desarrolladores\]_

source: **\-p** : Profile the program execution. Useful to identify performance bottlenecks. _\[See developer guide\]_
es: **\-p** : Perfila la ejecución del programa. Útil para identificar cuellos de botella en el rendimiento. _\[Ver guía para desarrolladores\]_

source: Interactive mode
es: Modo interactivo

source: To use _morpho_ interactively, simply load the _Terminal_ application (or equivalent on your system) and type
es: Para usar _morpho_ de forma interactiva, simplemente cargue la aplicación _Terminal_ (o equivalente en su sistema) y escriba
