Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: As an illustration of what's possible using the `graphics` module directly, we'll create a visualization of the electric field due to two point charges (Fig. [6.6](#fig:ElectricField){reference-type="ref" reference="fig:ElectricField"}). Begin by setting some constants and creating the Graphics object:
es: Como ilustración de lo que es posible usando directamente el módulo `gráficos`, crearemos una visualización del campo eléctrico debido a dos cargas puntuales (Fig. [6.6] (#fig:Campo eléctrico) {reference-type="ref" reference="fig:ElectricField"}). Comience estableciendo algunas constantes y creando el objeto Graphics:

source: We'll now define the charges by creating two List objects: one contains the strength of each charge and the second stores their positions:
es: Ahora definiremos las cargas creando dos objetos List: uno contiene la fuerza de cada carga y el segundo almacena sus posiciones:

source: We'll also define a cutoff distance around each charge below which we won't draw the electric field (remember it grows \\(\to\infty\\) as we get closer!):
es: También definiremos una distancia de corte alrededor de cada carga por debajo de la cual no dibujaremos el campo eléctrico (¡recuerde que crece \\(\to\infty\\) a medida que nos acercamos!):

source: Next, we need a function that calculates the electric field at an arbitary point. We do this by summing up the electric fields due to each charge using Coulomb's law:
es: A continuación, necesitamos una función que calcule el campo eléctrico en un punto arbitrario. Hacemos esto sumando los campos eléctricos debidos a cada carga usando la ley de Coulomb:

source: To draw the electric field, we create a rectangular grid of points, calculate the electric field at each point and draw an Arrow along the orientation.
es: Para dibujar el campo eléctrico, creamos una cuadrícula rectangular de puntos, calculamos el campo eléctrico en cada punto y dibujamos una flecha a lo largo de la orientación.

source: We now draw the charges, coloring them by their sign:
es: Ahora dibujamos las cargas, coloreándolas por su signo:

source: Finally, we display the scene:
es: Por último, mostramos la escena:

source: All figures in this manual have been exported directly from the _morpho_ programs that created them using the persistence of vision raytracer or `povray`. A raytracer is a program that takes a scene description and renders graphical output by tracing the path of individual rays of light. Because the model of light propagation and image formation is physically motivated, the output is of very high quality. By contrast, `morphoview` and most graphics programs use simplified approximate rendering techniques that enable real time interactive output. At the time of writing, raytracing is gaining popularity as a technique, and some high performance graphics cards now have real time raytracing capability. `povray` is a very well established program that is widely available and cross platform.
es: Todas las figuras de este manual han sido exportadas directamente desde los programas _morpho_ que las crearon utilizando la persistencia del trazador de rayos de visión o `povray`. Un trazador de rayos es un programa que toma una descripción de la escena y renderiza una salida gráfica trazando la trayectoria de los rayos de luz individuales. Debido a que el modelo de propagación de la luz y la formación de imágenes está motivado físicamente, el resultado es de muy alta calidad. Por el contrario, `morphoview` y la mayoría de los programas gráficos utilizan técnicas de renderizado aproximado simplificadas que permiten la salida interactiva en tiempo real. En el momento de escribir este artículo, el trazado de rayos está ganando popularidad como técnica, y algunas tarjetas gráficas de alto rendimiento ahora tienen capacidad de trazado de rayos en tiempo real. `Povray` es un programa muy bien establecido que está ampliamente disponible y es multiplataforma.

source: To use the `povray` module, you need to create a POVRaytracer object and initialize it with the graphics object
es: Para usar el módulo `povray`, debe crear un objeto POVRaytracer e inicializarlo con el objeto graphics

source: You can choose features of the graphics out by setting properties of this object, for example:
es: Puede elegir las características de los gráficos estableciendo las propiedades de este objeto, por ejemplo:

source: Because the list of properties can get quite cumbersome, it's possible to specify them through a separate Camera object and initialize the raytracer to use the Camera:
es: Debido a que la lista de propiedades puede resultar bastante engorrosa, es posible especificarlas a través de un objeto Camera independiente e inicializar el trazador de rayos para usar la Camera:

source: See the Reference section for further details.
es: Consulte la sección Referencia para obtener más detalles.

source: To produce output, call the render method to create a .pov file and run povray:
es: Para producir resultados, llame al método render para crear un archivo .pov y ejecute povray:

source: By default, the resulting .png file is opened. You can stop this by calling render with `display` set to `false`:
es: De forma predeterminada, se abre el archivo .png resultante. Puede detener esto llamando a render con `display` establecido en `false`:

source: If you wish to simply create .pov file without running povray, use the write method:
es: Si simplemente desea crear un archivo .pov sin ejecutar povray, use el método write:

source: A major advantage of raytracing is natural support for transparency effects. Here we generate 50 spheres of random placement, size and transparency by setting the `transmit` option. The rendered output is shown in Fig. [6.7](#fig:Transparency).
es: Una de las principales ventajas del trazado de rayos es el soporte natural para los efectos de transparencia. Aquí generamos 50 esferas de colocación, tamaño y transparencia aleatorias configurando la opción `transmitir`. La salida renderizada se muestra en la Fig. [6.7] (#fig:Transparencia).

source: This chapter discusses the example programs provided to illustrate various _morpho_ features. These can be found in the `examples` folder of the morpho git repository and are listed here in alphabetical order. Some closely relate to material presented in other chapters for which cross-references are provided.
es: En este capítulo se analizan los programas de ejemplo proporcionados para ilustrar varias características de _morpho_. Estos se pueden encontrar en la carpeta `examples` del repositorio git de morpho y se enumeran aquí en orden alfabético. Algunos se relacionan estrechamente con el material presentado en otros capítulos para los que se proporcionan referencias cruzadas.

source: A soap film held between two parallel concentric circular rings adopts the shape of a minimal surface called a _catenoid._ This is a relatively simple optimization problem, and hence is a good example for beginners to _morpho_.
es: Una película de jabón sostenida entre dos anillos circulares concéntricos paralelos adopta la forma de una superficie mínima llamada _catenoid._ Este es un problema de optimización relativamente simple y, por lo tanto, es un buen ejemplo para que los principiantes _morpho_.

source: The initial mesh is created using AreaMesh in the `meshtools` module:
es: La malla inicial se crea usando AreaMesh en el módulo `meshtools`:

source: The boundary of the mesh must be fixed in place. We can do this by creating a Selection, and visualizing it as shown in Fig. [7.1](#fig:Catenoid), left panel:
es: El límite de la malla debe fijarse en su lugar. Podemos hacer esto creando una selección y visualizándola como se muestra en la Fig. [7.1] (#fig:Catenoide), panel izquierdo:

source: The optimization problem simply requires us to specify the area as the quantity to minimize:
es: El problema de optimización simplemente requiere que especifiquemos el área como la cantidad a minimizar:

source: We then create a ShapeOptimizer to perform the optimization,
es: A continuación, creamos un ShapeOptimizer para realizar la optimización,

source: fix the boundary elements using the selection object we created,
es: arreglar los elementos de frontera usando el objeto de selección que creamos,

source: and perform the optimization. Conjugate gradient works well for this problem and converges in a few iterations. The final optimized shape is shown in Fig. [7.1](#fig:Catenoid), right panel.
es: y realizar la optimización. El gradiente conjugado funciona bien para este problema y converge en unas pocas iteraciones. La forma final optimizada se muestra en la Fig. [7.1] (#fig:Catenoide), panel derecho.

source: A cholesteric liquid crystal, in contrast to a nematic liquid crystal as was considered in the tutorial in Chapter X, favors a twisted state. The liquid crystal elastic energy is modified to include a preferred chiral wavevector \\(q\_{0}\\), $$ \\begin{equation} F=\frac{1}{2}\int\_{C}K\_{11}\left(\nabla\cdot\mathbf{n}\right)^{2}+K\_{22}(\mathbf{n}\cdot\nabla\times\mathbf{n}-q\_{0})^{2}+K\_{33}\left|\mathbf{n}\times\nabla\times\mathbf{n}\right|^{2}dA.\label{eq:CholestericFreeEnergy} \\end{equation} $$ The cholesteric example minimizes the above equation in a square domain \\((x,y)\in\[\-L,L\]\\), with \\(L=1/2\\), together with an anchoring energy, $$W\int(\mathbf{n}\cdot\mathbf{\hat{y}})^{2}dl,$$ imposed on the top and bottom boundaries to promote _planar degenerate_ alignment, i.e. \\(\mathbf{n}\\) prefers to lie any direction in the \\(x-z\\) plane. The optimized structure with \\(q\_{0}=\pi/2\\) is displayed in Fig. ([7.2](#fig:Cholesteric)).
es: Un cristal líquido colestérico, en contraste con un cristal líquido nemático como se consideró en el tutorial del Capítulo X, favorece un estado retorcido. La energía elástica del cristal líquido se modifica para incluir un vector de onda quiral preferido \\(q\_{0}\\), $$ \\begin{equation} F=\frac{1}{2}\int\_{C}K\_{11}\left(\nabla\cdot\mathbf{n}\right)^{2}+K\_{22}(\mathbf{n}\cdot\nabla\times\mathbf{n}-q\_{0})^{2}+K\_{33}\left|\mathbf{n}\times\nabla\times\mathbf{n}\right|^{2}dA.\label{eq:CholestericFreeEnergy} \\end{equation} $$ El ejemplo colestérico minimiza la ecuación anterior en un dominio cuadrado \\((x, y)\in\[\-L,L\]\\), con \\(L=1/2\\), junto con una energía de anclaje, $$W\int(\mathbf{n}\cdot\mathbf{\hat{y}})^{2}dl,$$ impuesta en los límites superior e inferior para promover una alineación _planar degenerada_, es decir, \\(\mathbf{n}\\) prefiere situarse en cualquier dirección en el plano \\(x-z\\). La estructura optimizada con \\(q\_{0}=\pi/2\\) se muestra en la Fig. ([7.2](#fig:Colestérico)).

source: This example finds a minimal surface with fixed enclosed volume, i.e. a sphere. It closely parallels a similar example from _Surface Evolver_, and hence may aid those familiar with that program in learning to use _morpho_. Starting from an initial cube, shown in Fig. ([7.3](#fig:Cube)), and created as follows:
es: En este ejemplo se encuentra una superficie mínima con un volumen cerrado fijo, es decir, una esfera. Es muy similar a un ejemplo similar de _Surface Evolver_ y, por lo tanto, puede ayudar a aquellos familiarizados con ese programa a aprender a usar _morpho_. A partir de un cubo inicial, que se muestra en la Fig. ([7.3](#fig:Cube)), y creado de la siguiente manera:

source: The problem and optimizer are set up:
es: El problema y el optimizador están configurados:

source: The mesh is optimized, then refined, then reoptimized:
es: La malla se optimiza, luego se refina y luego se vuelve a optimizar:

source: And finally the resulting area is compared with the true area of a sphere at the same volume:
es: Y finalmente se compara el área resultante con el área real de una esfera al mismo volumen:

source: This example demonstrates use of the `delaunay` module to create a Delaunay triangulation from a point cloud. The triangulation generated is explicitly checked for the property that no point other than the vertices lies within the circumsphere of each triangle.
es: En este ejemplo se muestra el uso del módulo `delaunay` para crear una triangulación de Delaunay a partir de una nube de puntos. La triangulación generada se comprueba explícitamente para la propiedad de que ningún otro punto que no sean los vértices se encuentra dentro de la circunesfera de cada triángulo.

source: Diffusion Limited Aggregation is a process describing the formation of aggregates of sticky particles. An initial seed particle of radius \\(r\\) is placed at \\( x_0=(0,0,0) \\). Subsequent particles are added one by one from initial random points \\(\mathbf{x}\_{i}^{0}=R\mathbf{\xi}/|\mathbf{\xi}|\\) where \\(\xi\\) is a random point normally distributed in each axis; the construction \\(\mathbf{\xi}/|\mathbf{\xi}|\\) generates a random point on the unit sphere. In _morpho_, this looks like
es: La agregación limitada por difusión es un proceso que describe la formación de agregados de partículas pegajosas. Una partícula inicial de radio \\(r\\) se coloca en \\( x_0=(0,0,0) \\). Las partículas subsiguientes se agregan una por una a partir de los puntos aleatorios iniciales \\(\mathbf{x}\_{i}^{0}=R\mathbf{\xi}/|\mathbf{\xi}|\\) donde \\(\xi\\) es un punto aleatorio normalmente distribuido en cada eje; La construcción \\(\mathbf{\xi}/|\mathbf{\xi}|\\) genera un punto aleatorio en la esfera unitaria. En _morpho_, esto se ve así

source: The mobile particle moves diffusively, according to
es: La partícula móvil se mueve difusivamente, de acuerdo con

source: where \\(\delta\\) is a small number. As the particle moves, we check to see if it has collided with any other particles, $$\left|x\_{i}-x\_{j}\right|\<2r,\forall i\neq j,\label{eq:collisioncheck}$$ or if it has wandered out of bounds, $$\left|x\_{i}\right|>2R.$$ If a particle has collided with another particle, it becomes fixed in place and joins the aggregate. As particles are added, the aggregate develops a characteristic fractalline morphology as shown in Fig. [7.5](#fig:DLA){reference-type="ref" reference="fig:DLA"}. The body of the program is a double loop:
es: donde \\(\delta\\) es un número pequeño. A medida que la partícula se mueve, comprobamos si ha colisionado con alguna otra partícula, $$\left|x\_{i}-x\_{j}\right|\<2r,\forall i\neq j,\label{eq:collisioncheck}$$ o si se ha salido de los límites, $$\left|x\_{i}\right|>2R.$$ Si una partícula ha colisionado con otra partícula, queda fija en su lugar y se une al agregado. A medida que se agregan partículas, el agregado desarrolla una morfología fractalina característica, como se muestra en la Fig. [7.5] (#fig:DLA) {reference-type="ref" reference="fig:DLA"}. El cuerpo del programa es un bucle doble:

source: To perform the collision check, the example uses a data structure called a \\(k\\)-dimensional tree, provided in the `kdtree` module. A \\(k\\)-dimensional tree provides a nearest neighbor search with \\(O(\log N)\\) complexity rather than \\(O(N)\\) complexity as would be required by searching all the points directly. The collision check code looks like this:
es: Para realizar la comprobación de colisiones, el ejemplo utiliza una estructura de datos llamada árbol \\(k\\)-dimensional, que se proporciona en el módulo 'kdtree'. Un árbol \\(k\\)-dimensional proporciona una búsqueda de vecino más cercano con \\(O(\log N)\\) complejidad en lugar de \\(O(N)\\) complejidad como se requeriría buscando todos los puntos directamente. El código de comprobación de colisión tiene el siguiente aspecto:

source: Notice that we gradually expand \\(R\\) as the aggregate grows. Ideally, each point should start very far away, really at infinity, but this would be very expensive in terms of the number of diffusion steps. A value of \\(R\\) double the greatest extent of the aggregate is a good compromise between speed and a reasonable approximation of diffusion limited aggregation.
es: Observe que expandimos gradualmente \\(R\\) a medida que crece el agregado. Idealmente, cada punto debería comenzar muy lejos, realmente en el infinito, pero esto sería muy costoso en términos del número de pasos de difusión. Un valor de \\(R\\) el doble de la mayor extensión del agregado es un buen compromiso entre la velocidad y una aproximación razonable de la agregación limitada por difusión.

source: This example also demonstrates how to create a simple custom visualization directly using the `graphics `module. The particles are drawn as spheres and displayed with the following code. An example run is displayed in Fig. [7.5](#fig:DLA).
es: En este ejemplo también se muestra cómo crear una visualización personalizada sencilla directamente mediante el módulo `graphics`. Las partículas se dibujan como esferas y se muestran con el siguiente código. En la Fig. [7.5] (#fig:DLA).

source: This example shows how to solve a simple electrostatics problem with adaptive refinement, and provides a useful example of how to cast a problem that is normally thought of as solving a PDE as an optimization problem.
es: Este ejemplo muestra cómo resolver un problema electrostático simple con refinamiento adaptativo y proporciona un ejemplo útil de cómo convertir un problema que normalmente se considera como la resolución de un PDE como un problema de optimización.

source: Suppose we want to solve Laplace's equation,
es: Supongamos que queremos resolver la ecuación de Laplace,

source: on a square domain \\(C\\) defined by \\(-L/2\leq x\leq L/2\\) and \\(-L/2\leq y\leq L/2\\). An equivalent formulation suitable for _morpho_ is to minimize,
es: en un dominio cuadrado \\(C\\) definido por \\(-L/2\leq x\leq L/2\\) y \\(-L/2\leq y\leq L/2\\). Una formulación equivalente adecuada para _morpho_ es minimizar,

source: with respect to \\(\phi\\).
es: con respecto a \\(\phi\\).

source: We can show the two are equivalent by applying calculus of variations to the \eqref{eq:el1},
es: Podemos demostrar que los dos son equivalentes aplicando el cálculo de variaciones a la \eqref{eq:el1},

source: and integrating by parts,
es: e integrando por partes,

source: **Note** If you're not familiar with calculus of variations, feel free to skip paragraphs that refer to "variations". The calculus of variations generalizes calculus from differentiating with respect to variables to differentiating with respect to functions.
es: **Nota** Si no estás familiarizado con el cálculo de variaciones, siéntete libre de omitir los párrafos que se refieren a "variaciones". El cálculo de variaciones generaliza el cálculo de la diferenciación con respecto a las variables a la diferenciación con respecto a las funciones.

source: where \\(\hat{\mathbf{s}}\\) is the outward normal. Hence, allowing for arbitrary variations \\(\delta\phi\\), in order for the bulk integrand to vanish Laplace's equation \\(\nabla^{2}\phi=0\\) must be satisfied. Similarly requiring the boundary integrand to vanish yields the "natural" boundary condition \\(\nabla\phi\cdot\hat{\mathbf{s}}=0\\), known as the Neumann boundary condition. In the absence of boundary energies, solving \\(\nabla^{2}\phi=0\\) in \\(C\\) subject to \\(\nabla\phi\cdot\hat{\mathbf{s}}=0\\) on \\(\partial C\\) yields the family of uniform constant solutions \\(\phi=\text{const}.\\)
es: donde \\(\hat{\mathbf{s}}\\) es la normal externa. Por lo tanto, permitiendo variaciones arbitrarias \\(\delta\phi\\), para que el integrando masivo desaparezca, la ecuación de Laplace \\(\nabla^{2}\phi=0\\) debe ser satisfecha. De manera similar, al requerir que el integrando de frontera desaparezca, se obtiene la condición de contorno "natural" \\(\nabla\phi\cdot\hat{\mathbf{s}}=0\\), conocida como la condición de contorno de Neumann. En ausencia de energías límite, la resolución de \\(\nabla^{2}\phi=0\\) en \\(C\\) sujeta a \\(\nabla\phi\cdot\hat{\mathbf{s}}=0\\) en \\(\parcial C\\) produce la familia de soluciones constantes uniformes \\(\phi=\text{const}.\\)

source: To impose boundary data, we will supplement \eqref{eq:el1} with the additional functional,
es: Para imponer datos de límites, complementaremos \eqref{eq:el1} con la funcionalidad adicional,

source: where the function \\(\phi\_{0}\\) represents some imposed boundary potential. Taking variations of this functional,
es: donde la función \\(\phi\_{0}\\) representa algún potencial límite impuesto. Tomando variaciones de este funcional,

source: Collecting the boundary terms from \eqref{eq:bulkvariations} and \eqref{eq:boundary}, we obtain the equivalent boundary condition on \\(\phi\\), $$\nabla\phi\cdot\hat{\mathbf{s}}+2\lambda(\phi-\phi\_{0})=0,$$ which is known as a Robin boundary condition. As \\(\lambda\to\infty\\), \\(\phi\to\phi_0\\) on the boundary, recovering a fixed boundary or Dirichlet condition, while as \\(\lambda\to0\\), we recover the Neumann conditions discussed earlier.
es: Recopilando los términos de frontera de \eqref{eq:bulkvariations} y \eqref{eq:boundary}, obtenemos la condición de frontera equivalente en \\(\phi\\), $$\nabla\phi\cdot\hat{\mathbf{s}}+2\lambda(\phi-\phi\_{0})=0,$$ que se conoce como condición de límite de Robin. Como \\(\lambda\to\infty\\), \\(\phi\to\phi_0\\) en el límite, recuperando un límite fijo o condición de Dirichlet, mientras que como \\(\lambda\to0\\), recuperamos las condiciones de Neumann discutidas anteriormente.

source: In the example, we will set \\(\phi_0=0\\) on the left and lower boundary and \\(\phi_0=1\\) on the right and upper boundary, and use \\(\lambda=100\\).
es: En el ejemplo, estableceremos \\(\phi_0=0\\) en el límite izquierdo e inferior y \\(\phi_0=1\\) en el límite derecho y superior, y usaremos \\(\lambda=100\\).

source: The code illustrates a few _morpho_ tricks. First, the following code is used to select the left/bottom and upper/right sides of the mesh:
es: El código ilustra algunos trucos de _morpho_. En primer lugar, se utiliza el siguiente código para seleccionar los lados izquierdo/inferior y superior/derecho de la malla:

source: What's happening here is that we select the whole boundary in the first line and then select relevant vertices in the next two lines. The edges are then added to the selection with `addgrade`, but this also selects some interior edges. To ensure we only have boundary edges in our selections, we find the intersection of `bnd1` and `bnd`, and similarly for `bnd2`.
es: Lo que sucede aquí es que seleccionamos todo el límite en la primera línea y luego seleccionamos los vértices relevantes en las dos líneas siguientes. A continuación, los bordes se añaden a la selección con `addgrade`, pero esto también selecciona algunos bordes interiores. Para asegurarnos de que solo tenemos bordes de límite en nuestras selecciones, encontramos la intersección de `bnd1` y `bnd`, y de manera similar para `bnd2`.

source: The problem setup involves adding the electrostatic energy Eq.\eqref{eq:el1} using `GradSq` and the boundary terms Eq.\eqref{eq:anchoring} as `LineIntegral`s.
es: La configuración del problema implica sumar la energía electrostática Eq.\eqref{eq:el1} usando `GradSq` y los términos de frontera Eq.\eqref{eq:anchoring} como 'LineIntegral's.

source: Optimization is done with a `FieldOptimizer`:
es: La optimización se realiza con un `FieldOptimizer`:
