Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: The problem as posed requires \\(\phi\\) to very sharply change in the upper left and lower right cornes as the imposed potential changes, but far away from these \\(\phi\\) changes much more slowly. We would like therefore to perform _adaptive refinement_, refining the mesh only in places where \\(\phi\\) is rapidly changing and using coarse elements elsewhere.
es: El problema, tal como se plantea, requiere que \\(\phi\\) cambie muy bruscamente en las córneas superior izquierda e inferior derecha a medida que los cambios potenciales impuestos, pero lejos de estos \\(\phi\\) cambia mucho más lentamente. Por lo tanto, nos gustaría realizar un _refinamiento adaptativo_, refinando la malla solo en lugares donde \\(\phi\\) está cambiando rápidamente y usando elementos gruesos en otros lugares.

source: To identify elements to refine, we compute the electrostatic energy in each elementwe'll use this as a heuristic measure of how rapidly \\(\phi\\) is changingand find the mean energy per element. We then create a Selection and manually select elements that have an electrostatic energy more than \\(1.5\times\\) the mean.
es: Para identificar los elementos que se van a refinar, calculamos la energía electrostática en cada elemento, usaremos esto como una medida heurística de la rapidez con la que \\(\phi\\) está cambiando y encontraremos la energía media por elemento. A continuación, creamos una selección y seleccionamos manualmente los elementos que tienen una energía electrostática superior a \\(1,5\veces\\) la media.

source: Refinement is then performed with a MeshRefiner object from the `meshtools` module, which we create with a list of both the mesh to refine _and_ all quantities that refer to the mesh:
es: A continuación, el refinamiento se realiza con un objeto MeshRefiner del módulo `meshtools`, que creamos con una lista tanto de la malla para refinar _y_ todas las cantidades que hacen referencia a la malla:

source: The refinement is performed using the selection `srefine` just created
es: El refinamiento se realiza utilizando la selección `srefine` que se acaba de crear

source: which returns a Dictionary mapping the old quantities to the new refined ones. We use this dictionary to update the OptimizationProblem and FieldOptimizer,
es: que devuelve un diccionario que asigna las cantidades antiguas a las nuevas refinadas. Usamos este diccionario para actualizar OptimizationProblem y FieldOptimizer,

source: and finally update our variables
es: y finalmente actualizar nuestras variables

source: Finally, we equiangulate the mesh to help avoid narrow elements,
es: Por último, equiangulamos la malla para ayudar a evitar elementos estrechos,

source: Once refinement is complete, further optimization can occur on the newly refined mesh
es: Una vez que se completa el refinamiento, se puede producir una mayor optimización en la malla recién refinada

source: The process of refinement and optimization just described takes place in a loop. The resulting mesh after 10 iterations is shown in Fig. [7.6](#fig:Electrostatics), together with the solution \\(\phi\\). The code runs in a few seconds, providing a considerable speedup over optimizing on a fine grid to get comparable accuracy.
es: El proceso de refinamiento y optimización que acabamos de describir tiene lugar en un bucle. La malla resultante después de 10 iteraciones se muestra en la Fig. [7.6] (#fig:Electrostática), junto con la solución \\(\phi\\). El código se ejecuta en unos pocos segundos, lo que proporciona una aceleración considerable en comparación con la optimización en una cuadrícula fina para obtener una precisión comparable.

source: These examples illustrate how to use the `implicitmesh` module to generate surfaces described as the zero set of a scalar function. The `sphere.morpho` and `torus.morpho` examples are described more fully in Chapter X, Section Y. The remaining `threesurface.morpho` creates a triangulation of a surface with three handles, $$r\_{z}^{4}z^{2}-\left(1-\left(\frac{x}{r\_{x}}\right)^{2}-\left(\frac{y}{r\_{y}}\right)^{2}\right)\left((x-x\_{1})^{2}+y^{2}-r\_{1}^{2}\right)\left((x+x\_{1})^{2}+y^{2}-r\_{1}^{2}\right)\left(x^{2}+y^{2}-r\_{1}^{2}\right)=0,$$ where \\(r\_{x}\\), \\(r\_{y}\\), \\(r\_{z}\\), \\(r\_{1}\\) and \\(x\_{1}\\) are parameters. The resulting surface is shown in Fig. [7.7](#fig:Threesurface).
es: Estos ejemplos ilustran cómo utilizar el módulo `implicitmesh` para generar superficies descritas como el conjunto cero de una función escalar. Los ejemplos de `sphere.morpho` y `torus.morpho` se describen con más detalle en el Capítulo X, Sección Y. El `threesurface.morpho` restante crea una triangulación de una superficie con tres controladores, $$r\_{z}^{4}z^{2}-\left(1-\left(\frac{x}{r\_{x}}\right)^{2}-\left(\frac{y}{r\_{y}}\right)^{2}\right)\left((x-x\_{1})^{2}+y^{2}-r\_{1}^{2}\right)\left((x+x\_{1})^{2}+y^{2}-r\_{1}^{2}\right)\left(x^{2}+y^{2}-r\_{1}^{2}\right)=0,$$ donde \\(r\_{x}\\), \\(r\_{y}\\), \\(r\_{z}\\), \\(r\_{1}\\) y \\(x\_{1}\\) son parámetros. La superficie resultante se muestra en la Fig. [7.7] (#fig:Tres superficies).

source: Examples in this folder illustrate various techniques to create Meshes with the `meshgen` module. Examples in two dimensions are shown in Fig. [7.8](#fig:Meshgen-2D); those in 3D are shown in Fig. [7.9](#fig:Meshgen-3D). See also the [Meshgen Section](../working_with_meshes/meshgen_module.md) of the [Working with Meshes Chapter](../working_with_meshes.md) for additional discussion of the `meshgen` module.
es: Los ejemplos de esta carpeta ilustran varias técnicas para crear mallas con el módulo `meshgen`. En la Fig. [7.8] (#fig:Meshgen-2D); los de 3D se muestran en la Fig. [7.9] (#fig:Meshgen-3D). Véase también la [Sección Meshgen](.. /working_with_meshes/meshgen_module.md) del [Capítulo Trabajar con Mallas](.. /working_with_meshes.md) para una discusión adicional del módulo `meshgen`.

source: This example shows how to use the `meshslice` module to create a slice through a mesh for visualization purposes. The program uses a spherical mesh,
es: En este ejemplo se muestra cómo utilizar el módulo `meshslice` para crear un sector a través de una malla con fines de visualización. El programa utiliza una malla esférica,

source: and creates a couple of example Fields, one scalar,
es: y crea un par de campos de ejemplo, un escalar,

source: and one vector,
es: y un vector,

source: A MeshSlicer is created to do the slicing,
es: Se crea un MeshSlicer para realizar el corte,

source: and then interpolated Fields along this slice are created too,
es: y luego también se crean campos interpolados a lo largo de esta rebanada,

source: Grade 1 elements (edges) from the original mesh, together with the field phi interpolated onto three different slices, are shown in Fig. [7.10](#fig:Meshslice). The example program illustrates a few other different possibilities.
es: Los elementos de grado 1 (bordes) de la malla original, junto con el campo phi interpolado en tres cortes diferentes, se muestran en la Fig. [7.10] (#fig:Rebanada de malla). El programa de ejemplo ilustra algunas otras posibilidades diferentes.

source: This example illustrates drawing of meshes, plotting of fields, etc. See the [Visualization Chapter](../visualization.md) for more details.
es: Este ejemplo ilustra el dibujo de mallas, el trazado de campos, etc. Véase el [Capítulo de visualización](.. /visualization.md) para obtener más detalles.

source: Examples in this folder illustrates use of the `povray` module used to produce publication quality renderings from within _morpho_ programs. All figures in this book were generated using this module.
es: Los ejemplos de esta carpeta ilustran el uso del módulo 'povray' utilizado para producir representaciones de calidad de publicación desde dentro de los programas _morpho_. Todas las figuras de este libro se generaron utilizando este módulo.

source: This example demonstrates use of the alternative Q-tensor formulation of nematic liquid crystal theory. We briefly present the necessary theory in two subsections below, then describe the implementation in _morpho_.
es: Este ejemplo demuestra el uso de la formulación alternativa del tensor Q de la teoría nemática del cristal líquido. Presentamos brevemente la teoría necesaria en dos subsecciones a continuación, luego describimos la implementación en _morpho_.

source: The Q tensor
es: El tensor Q

source: In 2D, for a uniaxial nematic, we can define a Q-tensor: $$Q\_{ij}=S(n\_{i}n\_{j}-1/2\delta\_{ij})$$ Here, the \\(-1/2\delta\_{ij}\\) is added for convenience, to make the matrix traceless: $$\text{Tr}(\mathbf{Q})=Q\_{ii}=S(n\_{i}n\_{i}-1/2\delta\_{ii})=S(1-1/2(2))=0$$ Now, the Q-tensor is also symmetric by definition: $$Q\_{ij}=Q\_{ji}$$ Due to these two reasons we can write the Q-tensor as a function of only \\(Q\_{xx}\\) and \\(Q\_{xy}\\):
es: En 2D, para un nemático uniaxial, podemos definir un tensor Q: $$Q\_{ij}=S(n\_{i}n\_{j}-1/2\delta\_{ij})$$ Aquí, el \\(-1/2\delta\_{ij}\\) se agrega por conveniencia, para hacer que la matriz no tenga traza: $$\text{Tr}(\mathbf{Q})=Q\_{ii}=S(n\_{i}n\_{i}-1/2\delta\_{ii})=S(1-1/2(2))=0$$ Ahora, el tensor Q también es simétrico por definición: $$Q\_{ij}=Q\_{ji}$$ Debido a estas dos razones, podemos escribir el tensor Q como una función solo de \\(Q\_{xx}\\) y \\(Q\_{xy}\\):

source: Elastic Energy and Anchoring
es: Energía elástica y anclaje

source: The Landau-de Gennes equilibrium free energy for a nematic liquid crystal can be written in terms of the Q-tensor:
es: La energía libre de equilibrio de Landau-de Gennes para un cristal líquido nemático se puede escribir en términos del tensor Q:

source: where \\(a\_{2}=(\rho-1)\\) and \\(a\_{4}=(\rho+1)/\rho^{2}\\) set the isotropic to nematic transition with \\(\rho\\) being the non-dimensional density. The system is in the isotropic state for \\(\rho\<1\\) and in the nematic phase when \\(\rho>1\\). In the nematic phase, \\(\ell\_{n}=\sqrt{K/a\_{2}}\\) sets the nematic coherence length. Now,
es: donde \\(a\_{2}=(\rho-1)\\) y \\(a\_{4}=(\rho+1)/\rho^{2}\\) establecen la transición isotrópica a nemática siendo \\(\rho\\) la densidad no dimensional. El sistema está en el estado isótropo para \\(\rho\<1\\) y en la fase nemática cuando \\(\rho>1\\). En la fase nemática, \\(\ell\_{n}=\sqrt{K/a\_{2}}\\) establece la longitud de la coherencia nemática. Ahora,

source: $$\mathbf{Q}^{2}=\begin{bmatrix}Q\_{xx} & Q\_{xy} \\\\ Q\_{xy} & -Q\_{xx} \\end{bmatrix}\begin{bmatrix}Q\_{xx} & Q\_{xy} \\\\ Q\_{xy} & -Q\_{xx} \\end{bmatrix}=(Q\_{xx}^{2}+Q\_{xy}^{2})\begin{bmatrix}1 & 0 \\\\ 0 & 1 \\end{bmatrix}$$ Hence, $$\text{Tr}(\mathbf{Q}^{2})=2(Q\_{xx}^{2}+Q\_{xy}^{2})$$ Similarly, $$(\nabla\mathbf{Q})^{2}=\partial\_{i}Q\_{kj}\partial\_{i}Q\_{kj}=2{(\partial\_{x}Q\_{xx})^{2}+(\partial\_{x}Q\_{xy})^{2}+(\partial\_{y}Q\_{xx})^{2}+(\partial\_{y}Q\_{xy})^{2}}$$ Now, the second term is a boundary integral, with \\(E\_{A}\\) being the anchoring strength. \\(\mathbf{W}\\) is the tensor corresponding to the boundary condition. For instance, for parallel anchoring, $$W\_{ij}=(t\_{i}t\_{j}-1/2\delta\_{ij})$$ where \\(t\_{i}\\) is a component of the tangent vector at the boundary. \\(\mathbf{W}\\) is also a symmetric traceless tensor with two independent components \\(W\_{xx}\\) and \\(W\_{xy}\\). The boundary term becomes: $$\text{Tr}\[(\mathbf{Q}-\mathbf{W})^{2}\]=2{Q\_{xx}^{2}+Q\_{xy}^{2}-2(Q\_{xx}W\_{xx}+Q\_{xy}W\_{xy})+W\_{xx}^{2}+W\_{xy}^{2}}$$
es: $$\mathbf{Q}^{2}=\begin{bmatrix}Q\_{xx} & Q\_{xy} \\\\ Q\_{xy} & -Q\_{xx} \\end{bmatrix}\begin{bmatrix}Q\_{xx} & Q\_{xy} \\\\ Q\_{xy} & -Q\_{xx} \\end{bmatrix}=(Q\_{xx}^{2}+Q\_{xy}^{2})\begin{bmatrix}1 & 0 \\\\\ 0 & 1 \\end{bmatrix}$$ Por lo tanto, $$\text{Tr}(\mathbf{Q}^{2})=2(Q\_{xx}^{2}+Q\_{xy}^{2})$$ De manera similar, $$(\nabla\mathbf{Q})^{2}=\partial\_{i}Q\_{kj}\partial\_{i}Q\_{kj}=2{(\partial\_{x}Q\_{xx})^{2}+(\partial\_{x} Q\_{xy})^{2}+(\partial\_{y}Q\_{xx})^{2}+(\partial\_{y}Q\_{xy})^{2}}$$ Ahora, el segundo término es una integral de límite, siendo \\(E\_{A}\\) la fuerza de anclaje. \\(\mathbf{W}\\) es el tensor correspondiente a la condición de contorno. Por ejemplo, para el anclaje paralelo, $$W\_{ij}=(t\_{i}t\_{j}-1/2\delta\_{ij})$$ donde \\(t\_{i}\\) es un componente del vector tangente en el límite. \\(\mathbf{W}\\) es también un tensor simétrico sin trazas con dos componentes independientes \\(W\_{xx}\\) y \\(W\_{xy}\\). El término límite se convierte en: $$\text{Tr}\[(\mathbf{Q}-\mathbf{W})^{2}\]=2{Q\_{xx}^{2}+Q\_{xy}^{2}-2(Q\_{xx}W\_{xx}+Q\_{xy}W\_{xy})+W\_{xx}^{2}+W\_{xy}^{2}}$$

source: Optimization problem
es: Problema de optimización

source: We can formulate all the preceding expressions in terms of vector quantities: $$\vec{q}\equiv \\{ Q\_{xx},Q\_{xy} \\} $$ $$\vec{w}\equiv \\{w\_{xx},w\_{xy} \\}$$ Thus, $$\text{Tr}(\mathbf{Q}^{2})=2||\vec{q}||^{2}$$
es: Podemos formular todas las expresiones anteriores en términos de cantidades vectoriales: $$\vec{q}\equiv \\{ Q\_{xx},Q\_{xy} \\} $$ $$\vec{w}\equiv \\{w\_{xx},w\_{xy} \\}$$ Así, $$\text{Tr}(\mathbf{Q}^{2})=2||\vec{q}||^{2}$$

source: $$\text{Tr}\[(\mathbf{Q}-\mathbf{W})^{2}\]=2||\vec{q}-\vec{w}||^{2}$$ With these, we want to minimize the area-integral of $$F=\int\_{\Omega}d^{2}{\bf x}\ \left(a\_{2}||\vec{q}||^{2}+a\_{4}||\vec{q}||^{4}+K||\nabla\vec{q}||^{2}\right)$$ together with the line-integral energy $$\oint\_{\partial\Omega}d{\bf x}\ E\_{A}||\vec{q}-\vec{w}||^{2}$$
es: $$\text{Tr}\[(\mathbf{Q}-\mathbf{W})^{2}\]=2||\vec{q}-\vec{w}||^{2}$$ Con estos, queremos minimizar la integral de área de $$F=\int\_{\Omega}d^{2}{\bf x}\ \left(a\_{2}||\vec{q}||^{2}+a\_{4}||\vec{q}||^{4}+K||\nabla\vec{q}||^{2}\right)$$ junto con la energía integral de línea $$\oint\_{\partial\Omega}d{\bf x}\ E\_{A}||\vec{q}-\vec{w}||^{2}$$

source: Implementation
es: Implementación

source: This free energy is readily set up in _morpho_. For this example, we consider a 2D disk geometry with unit radius. We use \\(\rho=1.3\\), so that we are deep in the nematic regime. We fix \\(E\_{\text{A}}=3\\), which sets strong anchoring at the boundary. With this strong tangential anchoring, we get a topological charge of \\(+1\\) at the boundary, and this acts as a constraint. When the nematic coherence length is comparable to the disk diameter (\\(\ell\_{n}\sim R\\)), the \\(+1\\) charge penetrates throughout the disk, whereas if (\\(\ell\_{n}\ll R\\)), then a formation with 2 \\(+1/2\\) defects is more stable. To test this, we use two different values of \\(K\\):, 0.01 and 1.0.
es: Esta energía libre se establece fácilmente en _morpho_. Para este ejemplo, consideramos una geometría de disco 2D con radio unitario. Usamos \\(\rho=1.3\\), de modo que estamos en lo profundo del régimen nemático. Corregimos \\(E\_{\text{A}}=3\\), que establece un fuerte anclaje en el límite. Con este fuerte anclaje tangencial, obtenemos una carga topológica de \\(+1\\) en el límite, y esto actúa como una restricción. Cuando la longitud de la coherencia nemática es comparable al diámetro del disco (\\(\ell\_{n}\sim R\\)), la carga \\(+1\\) penetra en todo el disco, mientras que si (\\(\ell\_{n}\ll R\\)), entonces una formación con 2 \\(+1/2\\) defectos es más estable. Para probar esto, usamos dos valores diferentes de \\(K\\):, 0.01 y 1.0.

source: We first define all our parameters and import \\(\texttt{disk.mesh}\\) from the tactoid example:
es: Primero definimos todos nuestros parámetros e importamos \\(\texttt{disk.mesh}\\) desde el ejemplo del tactoide:

source: We define the Q-tensor in its vector form as discussed above, initializing it to small random values:
es: Definimos el tensor Q en su forma vectorial como se discutió anteriormente, inicializándolo en pequeños valores aleatorios:

source: Note that this incidentally makes the director parallel to a 45 degree line. We now define the bulk energy, the anchoring energy and the distortion free energy as follows:
es: Nótese que esto, incidentalmente, hace que el director sea paralelo a una línea de 45 grados. Ahora definimos la energía a granel, la energía de anclaje y la energía libre de distorsión de la siguiente manera:

source: Equipped with the energies, we define the `OptimizationProblem`:
es: Equipados con las energías, definimos el `Problema de Optimización`:

source: To minimize the energy with respect to the field, we define the `FieldOptimizer` and perform a `linesearch`:
es: Para minimizar la energía con respecto al campo, definimos el `FieldOptimizer` y realizamos una `búsqueda de líneas`:

source: For visualizing the final configuration, we use the same piece of code we used for the tactoid example, and define some additional helper functions to extract the director and the order from the Q-tensor:
es: Para visualizar la configuración final, usamos el mismo fragmento de código que usamos para el ejemplo del tactoide, y definimos algunas funciones auxiliares adicionales para extraer el director y el orden del tensor Q:

source: We use these to create Fields from `q_tensor`.
es: Los usamos para crear campos a partir de 'q_tensor'.

source: and display these, reusing the `visualize` function from the tactoid tutorial example.
es: y mostrarlos, reutilizando la función `visualizar` del ejemplo del tutorial de Tactoid.

source: This creates beautiful plots of the nematic, displayed in Fig. [7.11](#fig:Qtensor). Like the tactoid example, we can do adaptive mesh refinement based on the elastic energy density as well.
es: Esto crea hermosos gráficos del nemático, que se muestran en la Fig. [7.11] (#fig:Qtensor). Al igual que en el ejemplo del tactoide, también podemos hacer un refinamiento adaptativo de la malla basado en la densidad de energía elástica.

source: Consider \\(N\\) charges \\(q\\) with positions \\(x_i\\) that are each confined to lie on the unit sphere so that \\(\left| x_i\right|=1 \\) that repel each other electrostatically and hence whose configuration minimizes the energy, $$\frac{k}{2}\sum\_{i\neq j}\frac{q^{2}}{\left|x\_{i}-x\_{j}\right|}$$ The problem was posed by the physicist J. J. Thomson in 1904, in the context of an early model for the structure of an atom.
es: Considere \\(N\\) cargas \\(q\\) con posiciones \\(x_i\\) que están confinadas a estar en la esfera unitaria de modo que \\(\left| x_i\right|=1 \\) que se repelen electrostáticamente y, por lo tanto, cuya configuración minimiza la energía, $$\frac{k}{2}\sum\_{i\neq j}\frac{q^{2}}{\left|x\_{i}-x\_{j}\right|} El problema fue planteado por el físico J. J. Thomson en 1904, en el contexto de un modelo temprano para la estructura de un átomo.

source: To set this up in _morpho_, we begin by creating a mesh from a sequence of random points using a MeshBuilder object from the `meshtools` module. Notice that this is quite an unusual mesh; it consists of \\(N\\) unconnected points with no connectivity information.
es: Para configurar esto en _morpho_, comenzamos creando una malla a partir de una secuencia de puntos aleatorios usando un objeto MeshBuilder del módulo `meshtools`. Tenga en cuenta que esta es una malla bastante inusual; consiste en \\(N\\) puntos no conectados sin información de conectividad.

source: The optimization problem is then specified. We use the PairwisePotential functional from the `functionals` module and supply the Coulomb potential \\(1/r\\), together with its derivative \\(-1/r^{2}\\) as anonymous functions:
es: A continuación, se especifica el problema de optimización. Usamos el funcional PairwisePotential del módulo `functionals` y suministramos el potencial de Coulomb \\(1/r\\), junto con su derivada \\(-1/r^{2}\\) como funciones anónimas:

source: Constraining the particles to a sphere is implemented as a level set constraint: We use the ScalarPotential functional as a local constraint to ensure that each particle lies on the zero contour of the scalar function \\(x^{2}+y^{2}+z^{2}-1\\), which defines the unit sphere.
es: La restricción de las partículas a una esfera se implementa como una restricción de conjunto de niveles: Usamos el funcional ScalarPotential como una restricción local para asegurarnos de que cada partícula se encuentra en el contorno cero de la función escalar \\(x^{2}+y^{2}+z^{2}-1\\), que define la esfera unitaria.

source: Optimization is then performed:
es: A continuación, se realiza la optimización:

source: Notice that we estimate the initial stepsize from the number of particles. Since each particle will adopt a fraction \\(1/N\\) of the area, the stepsize is \\(\propto1/\sqrt{N}\\). In practice, we find that taking a few steps of gradient descent with relax helps condition the problem by pushing any particles from the initially random distribution that happened to be placed very close to one another apart. After this `conjugategradient`works well and typically converges in around \\(100\\) iterations.
es: Observe que estimamos el tamaño del paso inicial a partir del número de partículas. Dado que cada partícula adoptará una fracción \\(1/N\\) del área, el tamaño del paso es \\(\propto1/\sqrt{N}\\). En la práctica, encontramos que dar unos pocos pasos de descenso de gradiente con relajación ayuda a acondicionar el problema al separar cualquier partícula de la distribución inicialmente aleatoria que se colocó muy cerca una de la otra. Después de esto, `gradiente conjugado` funciona bien y, por lo general, converge en alrededor de \\(100\\) iteraciones.

source: A final interesting feature of this example is the use of a custom visualization. We draw a sphere with a center of mass at the location at each particle:
es: Una última característica interesante de este ejemplo es el uso de una visualización personalizada. Dibujamos una esfera con un centro de masa en la ubicación de cada partícula:

source: A typical configuration resulting from this is shown in Fig. [7.12](#fig:Thomson). Note that we made the large sphere transparent to render with the povray module; this was achieved by adding the optional argument `transmit=0.3` to the call to `Sphere`.
es: Una configuración típica resultante de esto se muestra en la Fig. [7.12] (#fig:Thomson). Tenga en cuenta que hicimos que la esfera grande fuera transparente para renderizar con el módulo povray; esto se logró agregando el argumento opcional `transmit=0.3` a la llamada a `Sphere`.

source: The wrap example finds a minimal surface constrainted to lie outside two ellipsoids. The solution, shown in Fig. [7.13](#fig:Wrap) could represent, for example, a possible configuration for a fluid bridge connecting two ellipsoidal particles.
es: En el ejemplo de ajuste se encuentra una superficie mínima restringida para que se encuentre fuera de dos elipsoides. La solución, que se muestra en la Fig. [7.13] (#fig:Wrap) podría representar, por ejemplo, una posible configuración para un puente de fluido que conecte dos partículas elipsoidales.

source: The basic idea of this code is to "shrink wrap" the ellipsoids, starting with an initial mesh is a cube that completely encloses them. This is created with PolyhedronMesh from the `meshtools` module:
es: La idea básica de este código es "envolver" los elipsoides, comenzando con una malla inicial es un cubo que los encierra por completo. Esto se crea con PolyhedronMesh desde el módulo `meshtools`:

source: The particles are implemented as level set constraints. A convenient Ellipsoid class is defined to help create appropriate constraints,
es: Las partículas se implementan como restricciones de conjunto de niveles. Se define una clase Ellipsoid conveniente para ayudar a crear las restricciones adecuadas,
