Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: `Continue` is used inside loops to skip over the rest of an iteration. For example
es: `Continue` se usa dentro de bucles para omitir el resto de una iteración. Por ejemplo

source: prints "Hello" five times but only prints 1, 2 and 3. Once the condition `i>3` is true, the `continue` statement causes execution to transfer to the start of the loop body.
es: imprime "Hola" cinco veces, pero solo imprime 1, 2 y 3. Una vez que la condición `i>3` es verdadera, la instrucción `continue` hace que la ejecución se transfiera al inicio del cuerpo del bucle.

source: Traditional `for` loops also support `continue`:
es: Los ciclos `for` tradicionales también admiten `continue`:

source: // v increment
es: // incremento de v

source: Since `continue` causes control to be transferred _to the increment section_ in this kind of loop, here the program prints 0..4 but the number 2 is skipped.
es: Dado que `continue` hace que el control se transfiera _to el incremento section_ en este tipo de bucle, aquí el programa imprime 0..4 pero se omite el número 2.

source: Use of `continue` with `while` loops is possible but isn't recommended as it can easily produce an infinite loop!
es: El uso de bucles 'continue' con 'while' es posible, pero no se recomienda, ya que puede producir fácilmente un bucle infinito!.

source: In this example, when the condition `i==2` is `true`, execution skips back to the start, but `i` _isn't_ incremented. The loop gets stuck in the iteration `i==2`.
es: En este ejemplo, cuando la condición `i==2` es `true`, la ejecución salta al principio, pero `i` _no es_ incrementada. El ciclo se atasca en la iteración `i==2`.

source: A `try` and `catch` statement allow you handle errors. For example
es: Una instrucción `try` y `catch` le permite controlar los errores. Por ejemplo

source: // Do something
es: // haz algo

source: // Handle the error
es: // controlar el error

source: Code within the block after the `try` keyword is executed. If an error is generated then Morpho looks to see if the tag associated with the error matches any of the labels in the `catch` block. If it does, the code after the matching label is executed. If no error occurs, the catch block is skipped entirely.
es: Código dentro del bloque después de que se ejecute la palabra clave `try`. Si se genera un error, Morpho busca si la etiqueta asociada con el error coincide con alguna de las etiquetas en el bloque `catch`. Si es así, se ejecuta el código después de la etiqueta coincidente. Si no se produce ningún error, el bloque catch se omite por completo.

source: A function in morpho is defined with the `fn` keyword, followed by the function's name, a list of parameters enclosed in parentheses, and the body of the function in curly braces. This example computes the square of a number:
es: Una función en morpho se define con la palabra clave `fn`, seguida del nombre de la función, una lista de parámetros entre paréntesis y el cuerpo de la función entre llaves. En este ejemplo se calcula el cuadrado de un número:

source: Once a function has been defined you can evaluate it like any other morpho function.
es: Una vez que se ha definido una función, puede evaluarla como cualquier otra función morpho.

source: As well as regular parameters, functions can also be defined with _variadic_ parameters:
es: Además de los parámetros regulares, las funciones también se pueden definir con parámetros _variadic_:

source: This function can then be called with 1 or more arguments:
es: A continuación, se puede llamar a esta función con 1 o más argumentos:

source: // All valid!
es: // Todo válido

source: The variadic parameter `v` captures all the extra arguments supplied. Functions cannot be defined with more than one variadic parameter.
es: El parámetro variádico `v` captura todos los argumentos adicionales proporcionados. Las funciones no se pueden definir con más de un parámetro variádico.

source: You can mix regular, variadic and optional parameters. Variadic parameters come before optional parameters:
es: Puede mezclar parámetros regulares, variádicos y opcionales. Los parámetros variádicos van antes que los parámetros opcionales:

source: Functions can also be defined with _optional_ parameters:
es: Las funciones también se pueden definir con parámetros _opcionales_:

source: Each optional parameter must be defined with a default value (here `1`). The function can then be called either with or without the optional parameter:
es: Cada parámetro opcional debe definirse con un valor predeterminado (aquí `1`). A continuación, se puede llamar a la función con o sin el parámetro opcional:

source: // a == 1 due to default value
es: // a == 1 debido al valor predeterminado

source: // a == 2 supplied by the user
es: // a == 2 suministrado por el usuario

source: The `return` keyword is used to exit from a function, optionally passing a given value back to the caller. `return` can be used anywhere within a function. The below example calculates the `n` th Fibonacci number,
es: La palabra clave `return` se utiliza para salir de una función, pasando opcionalmente un valor dado de vuelta a la persona que llama. `return` se puede usar en cualquier lugar dentro de una función. El siguiente ejemplo calcula el `n` ésimo número de Fibonacci,

source: by returning early if `n<2`, otherwise returning the result by recursively calling itself.
es: devolviendo antes de tiempo si `n<2`, de lo contrario devolviendo el resultado llamándose a sí mismo de forma recursiva.

source: Functions in morpho can form _closures_, i.e. they can enclose information from their local context. In this example,
es: Las funciones en morpho pueden formar _closures_, es decir, pueden encerrar información de su contexto local. En este ejemplo,

source: the function `foo` returns a function that captures the value of `a`. If we now try calling `foo` and then calling the returned functions,
es: La función `foo` devuelve una función que captura el valor de `a`. Si ahora intentamos llamar a `foo` y luego llamamos a las funciones devueltas,

source: // expect: 1
es: // espera: 1

source: we can see that `p` and `q` seem to contain different copies of `g` that encapsulate the value that `foo` was called with.
es: podemos ver que `p` y `q` parecen contener diferentes copias de `g` que encapsulan el valor con el que se llamó a `foo`.

source: Morpho hints that a returned function is actually a closure by displaying it with double brackets:
es: Morpho insinúa que una función devuelta es en realidad un cierre mostrándola con corchetes dobles:

source: // expect: <<fn g>>
es: // se espera: <<fn g>>

source: Classes are defined using the `class` keyword followed by the name of the class. The definition includes methods that the class responds to. The special `init` method is called whenever an object is created.
es: Las clases se definen utilizando la palabra clave `class` seguida del nombre de la clase. La definición incluye métodos a los que responde la clase. El método especial `init` se llama cada vez que se crea un objeto.

source: "A delicious "
es: "Un delicioso "

source: " cake"
es: “pastel"

source: Objects are created by calling the class as if it was a function:
es: Los objetos se crean llamando a la clase como si fuera una función:

source: "carrot"
es: "zanahoria"

source: Note that all objects in Morpho inherit from a base `Object` class, which provides a set of standard methods.
es: Tenga en cuenta que todos los objetos en Morpho heredan de una clase base `Object`, que proporciona un conjunto de métodos estándar.

source: See also `Object`.
es: Véase también `Objeto`.

source: The `is` keyword is used to specify a class's superclass:
es: La palabra clave `is` se utiliza para especificar la superclase de una clase:

source: All methods defined by the superclass `B` are copied into the new class `A`, _before_ any methods specified in the class definition. Hence, you can replace methods from the superclass simply by defining a method with the same name.
es: Todos los métodos definidos por la superclase `B` se copian en la nueva clase `A`, _antes_ de cualquier método especificado en la definición de clase. Por lo tanto, puede reemplazar métodos de la superclase simplemente definiendo un método con el mismo nombre.

source: The `with` keyword is used together with `is` to insert additional methods into a class definition _without_ making them the superclass. These are often called `mixins`. These methods are inserted after the superclass's methods. Multiple classes can be specified after `with`; they are added in the order specified.
es: La palabra clave `with` se usa junto con 'is' para insertar métodos adicionales en una definición de clase _sin_ convertirlos en la superclase. A menudo se denominan "mixins". Estos métodos se insertan después de los métodos de la superclase. Se pueden especificar varias clases después de `with`; se agregan en el orden especificado.

source: Here `B` is the superclass of `A`, but methods defined by `C` and `D` are also available to `A`. If `B`, `C` and `D` define methods with the same name, those in `C` take precedence over any in `B` and those in `D` take precedence over `B` and `C`.
es: Aquí `B` es la superclase de `A`, pero los métodos definidos por `C` y `D` también están disponibles para `A`. Si `B`, `C` y `D` definen métodos con el mismo nombre, los de `C` tienen prioridad sobre cualquiera de `B` y los de `D` tienen prioridad sobre `B` y `C`.

source: The `self` keyword is used to access an object's properties and methods from within its definition.
es: La palabra clave `self` se utiliza para acceder a las propiedades y métodos de un objeto desde su definición.

source: "Driving my ${self.type}."
es: “Manejando mi ${self.type}.”

source: The keyword `super` allows you to access methods provided by an object's superclass rather than its own. This is particularly useful when the programmer wants a class to extend the functionality of a parent class, but needs to make sure the old behavior is still maintained.
es: La palabra clave `super` le permite acceder a los métodos proporcionados por la superclase de un objeto en lugar de la suya propia. Esto es particularmente útil cuando el programador quiere que una clase amplíe la funcionalidad de una clase principal, pero necesita asegurarse de que el comportamiento anterior aún se mantiene.

source: For example, consider the following pair of classes:
es: Por ejemplo, considere el siguiente par de clases:

source: "Delicious soup!"
es: "¡Deliciosa sopa!"

source: The subclass Soup uses `super` to call the original initializer.
es: La subclase Soup usa `super` para llamar al inicializador original.

source: Objects in Morpho are created by calling a constructor function, which usually has the same name as the class of the object:
es: Los objetos en Morpho se crean llamando a una función constructora, que generalmente tiene el mismo nombre que la clase del objeto:

source: // 50% gray
es: // 50% gris

source: You can store information in an object by assigning to its properties:
es: Puede almacenar información en un objeto asignando a sus propiedades:

source: and you can read from them similarly:
es: y puedes leer de ellos de manera similar:

source: An object's `class` determines the methods that can be used on the object. You call them using the . operator:
es: La `clase` de un objeto determina los métodos que se pueden usar en el objeto. Los llamas usando el archivo . operador:

source: See also `class`.
es: Véase también `clase`.

source: The `has` method is used to test if an object has a particular property:
es: El método `has` se utiliza para probar si un objeto tiene una propiedad particular:

source: If you call `has` with no parameters,
es: Si llamas a `has` sin parámetros,

source: it returns a list of all property labels that an object has.
es: devuelve una lista de todas las etiquetas de propiedad que tiene un objeto.

source: The `respondsto` method is used to test if an object provides a particular method:
es: El método `respondsto` se utiliza para probar si un objeto proporciona un método en particular:

source: If you call `respondsto` with no parameters,
es: Si llamas a `respondsto` sin parámetros,

source: it returns a list of all methods that an object has available.
es: devuelve una lista de todos los métodos que un objeto tiene disponibles.

source: The `invoke` method is used to invoke a method from its label and a list of parameters:
es: El método `invoke` se utiliza para invocar un método desde su etiqueta y una lista de parámetros:

source: is equivalent to:
es: es equivalente a:

source: The `clss` method is used to get the class to which an object belongs.
es: El método `clss` se utiliza para obtener la clase a la que pertenece un objeto.

source: Morpho is extensible and provides a convenient module system that works like standard libraries in other languages. Modules may define useful variables, functions and classes, and can be made available using the `import` keyword. For example,
es: Morpho es extensible y proporciona un sistema de módulos conveniente que funciona como bibliotecas estándar en otros lenguajes. Los módulos pueden definir variables, funciones y clases útiles, y pueden estar disponibles utilizando la palabra clave 'import'. Por ejemplo,

source: loads the `color` module that provides functionality related to color.
es: carga el módulo `color` que proporciona funcionalidad relacionada con el color.

source: You can create your own modules; they're just regular morpho files that are stored in a standard place. On UNIX platforms, this is `/usr/local/share/morpho/modules`.
es: Puede crear sus propios módulos; Son solo archivos morpho normales que se almacenan en un lugar estándar. En plataformas UNIX, esto es '/usr/local/share/morpho/modules'.

source: Import provides access to the module system and including code from multiple source files.
es: Import proporciona acceso al sistema de módulos e incluye código de varios archivos de origen.

source: To import code from another file, use import with the filename:
es: Para importar código de otro archivo, use import con el nombre de archivo:

source: "file.morpho"
es: "archivo.morfo"

source: which immediately includes all the contents of `"file.morpho"`. Any classes, functions or variables defined in that file can now be used, which allows you to divide your program into multiple source files.
es: que incluye inmediatamente todo el contenido de `”file.morpho”`. Ahora se pueden usar todas las clases, funciones o variables definidas en ese archivo, lo que le permite dividir su programa en varios archivos fuente.

source: Morpho provides a number of built in modules--and you can write your own--which can be loaded like this:
es: Morpho proporciona una serie de módulos incorporados, y puede escribir los suyos propios, que se pueden cargar de la siguiente manera:

source: which imports the `color` module.
es: que importa el módulo `color`.

source: You can selectively import symbols from a modules by using the `for` keyword:
es: Puede importar símbolos de forma selectiva de un módulo utilizando la palabra clave `for`:

source: which imports only the `HueMap` class and the `Red` variable.
es: que importa solo la clase `HueMap` y la variable `Red`.

source: You can also import a module using the 'as' keyword to place the symbols in a specified namespace:
es: También puede importar un módulo utilizando la palabra clave `as` para colocar los símbolos en un espacio de nombres especificado:

source: You can then use refer to specific symbols like this:
es: A continuación, puede usar símbolos específicos como este:

source: (See the help topic 'namespaces' for more information.)
es: (Consulte el tema de ayuda ‘namespaces’ para obtener más información.)

source: A namespace is a collection of symbols that is imported from a module. You identify a namespace using the 'as' keyword when importing the module like this:
es: Un namespace es una colección de símbolos que se importa desde un módulo. Identifica un espacio de nombres utilizando la palabra clave 'as' al importar el módulo de la siguiente manera:

source: // 'col' is the namespace
es: // ‘col’ es el namespace

source: Everything defined by the module with a unique symbol, including classes, functions and global variables, can be identified using the namespace, e.g.
es: Todo lo definido por el módulo con un símbolo único, incluidas las clases, las funciones y las variables globales, se puede identificar utilizando el namespace, p. ej.

source: Since the symbols are only are defined in the namespace you imported them into, you can't refer to them directly:
es: Dado que los símbolos solo se definen en el namespace en el que los importó, no puede hacer referencia a ellos directamente:

source: Using namespaces is recommended, becuase it helps prevent conflicts between modules.
es: Se recomienda el uso de namespaces, ya que ayuda a evitar conflictos entre módulos.

source: Morpho provides an online help system. To get help about a topic called `topicname`, type
es: Morpho proporciona un sistema de ayuda en línea. Para obtener ayuda sobre un tema llamado `topicname`, escriba

source: A list of available topics is provided below and includes language keywords like `class`, `fn` and `for`, built in classes like `Matrix` and `File` or information about functions like `exp` and `random`.
es: A continuación se proporciona una lista de temas disponibles e incluye palabras clave de idioma como `class`, `fn` y `for`, clases integradas como `Matrix` y `File` o información sobre funciones como `exp` y `random`.

source: Some topics have additional subtopics: to access these type
es: Algunos temas tienen subtemas adicionales: para acceder a estos tipos

source: For example, to get help on a method for a particular class, you could type
es: Por ejemplo, para obtener ayuda sobre un método para una clase determinada, puede escribir

source: Note that `help` ignores all punctuation.
es: Tenga en cuenta que `help` ignora todos los signos de puntuación.

source: You can also use `?` as a shorthand synonym for `help`
es: También puede usar `?` como sinónimo abreviado de `ayuda`

source: A useful feature is that, if an error occurs, simply type `help` to get more information about the error.
es: Una característica útil es que, si se produce un error, simplemente escriba `ayuda` para obtener más información sobre el error.

source: The `quit` CLI command quits `morpho` run in interactive mode and returns to the shell.
es: El comando CLI `quit` sale de la ejecución `morpho` en modo interactivo y vuelve al shell.

source: When an error occurs in running a morpho program, an error message is displayed together with an explanation of where in the program that the error happened.
es: Cuando se produce un error al ejecutar un programa morpho, se muestra un mensaje de error junto con una explicación de en qué parte del programa se produjo el error.

source: You can make your own custom errors using the `Error` class:
es: Puede crear sus propios errores personalizados utilizando la clase `Error`:

source: "A message"
es: "Un mensaje"

source: Use the `throw` method to raise the error, interrupting execution unless the error is caught:
es: Utilice el método `throw` para generar el error, interrumpiendo la ejecución a menos que se detecte el error:

source: or
es: o

source: "A custom message"
es: "Un mensaje personalizado"

source: You can also use the `warning` method to alert the user of a potential issue that doesn't need the program to be interrupted.
es: También puede utilizar el método de `advertencia` para alertar al usuario de un problema potencial que no necesita que se interrumpa el programa.

source: Alloc
es: Asignación

source: This error may occur when creating new objects or resizing them. It typically indicates that the computer is under memory pressure.
es: Este error puede producirse al crear nuevos objetos o cambiar su tamaño. Por lo general, indica que la computadora está bajo presión de memoria.

source: This error indicates an internal problem with morpho. Please contact the developers for support.
es: Este error indica un problema interno con morpho. Póngase en contacto con los desarrolladores para obtener asistencia.

source: This error occurs when an operator like `+` or `-` is given operands that it doesn't understand. For example,
es: Este error se produce cuando a un operador como `+` o `-` se le asignan operandos que no entiende. Por ejemplo,

source: "Goodbye" // Causes 'InvldOp'
es: "Adiós" // Causa 'InvldOp'

source: causes this error because the multiplication operator doesn't know how to multiply strings.
es: este error se debe a que el operador de multiplicación no sabe cómo multiplicar cadenas.

source: If the operands are objects, this means that the objects don't provide a method for the requested operation, e.g. for
es: Si los operandos son objetos, esto significa que los objetos no proporcionan un método para la operación solicitada, por ejemplo, para

source: `object1` would need to provide a `div()` method that can successfully handle `object2`.
es: `object1` necesitaría proporcionar un método `div()` que pueda manejar con éxito `object2`.

source: This error occurs when concatenation of strings or other objects fails, typically because of low memory.
es: Este error se produce cuando se produce un error en la concatenación de cadenas u otros objetos, normalmente debido a una memoria baja.

source: This error occurs when you try to call something that isn't a method or a function. Here, we initialize a variable with a string and call it:
es: Este error se produce cuando se intenta llamar a algo que no es un método o una función. Aquí, inicializamos una variable con una cadena y la llamamos:

source: "Not a function"
es: "No es una función"

source: // Causes 'Uncallable'
es: // Causa ‘Uncallable’

source: This error occurs when morpho encounters a `return` keyword outside of a function or method definition.
es: Este error se produce cuando morpho encuentra una palabra clave `return` fuera de una definición de función o método.

source: This error occurs when morpho tried to create a new object, but something went wrong.
es: Este error se produce cuando morpho intenta crear un nuevo objeto, pero algo sale mal.

source: This error occurs if you try to access a property of something that isn't an object:
es: Este error se produce si intenta acceder a una propiedad de algo que no es un objeto:

source: This error occurs if you try to access a property or method that hasn't been defined for an object:
es: Este error se produce si intenta acceder a una propiedad o método que no se ha definido para un objeto:

source: or
es: o

source: This error can occur if you try to create a new object from a class that doesn't have an `init` method:
es: Este error puede ocurrir si intentas crear un nuevo objeto a partir de una clase que no tiene un método `init`:

source: Here, the argument to `Foo` causes the `NoInit` error because no `init` method is available to process it.
es: Aquí, el argumento `Foo` provoca el error `NoInit` porque no hay ningún método `init` disponible para procesarlo.

source: This error occurs if you try to invoke a method on something that isn't an object:
es: Este error se produce si intenta invocar un método en algo que no es un objeto:

source: This error occurs if you try to invoke a method on a class that doesn't exist:
es: Este error se produce si intenta invocar un método en una clase que no existe:

source: This error occurs if you call a function with the wrong number of arguments:
es: Este error se produce si se llama a una función con un número incorrecto de argumentos:
