Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: This is useful to generate meshes such as a simple straight line (Fig. [5.4](#fig:LineMesh), left panel):
es: Esto es útil para generar mallas como una línea recta simple (Fig. [5.4] (#fig:LineMesh), panel izquierdo):

source: You can also request the ends of the Mesh be joined together to form a loop by specifying `closed`. This code generates a circle (Fig. [5.4](#fig:LineMesh), center panel):
es: También puede solicitar que los extremos de la malla se unan para formar un bucle especificando `closed`. Este código genera un círculo (Fig. [5.4] (#fig: LineMesh), panel central):

source: You can increase the resolution of the circle by changing the stepsize in the Range, for example to ```2``*``Pi/20``` to double the number of points. Note the use of the exclusive Range operator here, `...`, rather than `..`to avoid duplicating the point at (1,0).
es: Puede aumentar la resolución del círculo cambiando el tamaño del paso en el Rango, por ejemplo a ```2``*``Pi/20``` para duplicar el número de puntos. Tenga en cuenta el uso del operador exclusivo Range aquí, `…`, en lugar de `..` para evitar la duplicación del punto en (1,0).

source: The output Mesh can be of any dimension, such as this helix in 3D (Fig. [5.4](#fig:LineMesh), right panel). Notice that here we use a regular function rather than an anonymous function:
es: La malla de salida puede ser de cualquier dimensión, como esta hélice en 3D (Fig. [5.4] (#fig:LineMesh), panel derecho). Tenga en cuenta que aquí usamos una función regular en lugar de una función anónima:

source: `AreaMesh` is similar to `LineMesh` function creates a Mesh from a parametric function, which now takes two parameters. To create a square,
es: `AreaMesh` es similar a la función `LineMesh` que crea una malla a partir de una función paramétrica, que ahora toma dos parámetros. Para crear un cuadrado,

source: where notice that a separate Range is required for \\(u\\) and \\(v\\). By default, the output of AreaMesh only contains grade 0 and grade 2 elements, i.e. vertices and facets, as is visible in Fig. [5.5](#fig:AreaMesh-1)(left). To add in grade 1 elements if required, call the `addgrade` method on the Mesh:
es: donde observe que se requiere un rango separado para \\(u\\) y \\(v\\). De forma predeterminada, la salida de AreaMesh solo contiene elementos de grado 0 y grado 2, es decir, vértices y facetas, como se puede ver en la Fig. [5.5] (#fig:ÁreaMesh-1) (izquierda). Para agregar elementos de grado 1 si es necesario, llame al método `addgrade` en la malla:

source: This gives the result shown in Fig. \[5.5\](#fig:AreaMesh-1(right).
es: Esto da el resultado que se muestra en la Fig. \[5.5\](#fig:AreaMesh-1(derecha).

source: As with LineMesh, the Meshes can be closed in one or both directions, enabling the creation of a cylinder,
es: Al igual que con LineMesh, las mallas se pueden cerrar en una o ambas direcciones, lo que permite la creación de un cilindro,

source: and a torus,
es: y un toroide,

source: The results of these are displayed in Fig. [5.6](#fig:AreaMesh-2). Note that the meshes generated by more modules that incorporate some degree of quality control, e.g. `implicitmesh` or `meshgen`, are generally better and should be used in preference to those created by AreaMesh.
es: Los resultados de estos se muestran en la Fig. [5.6] (#fig:ÁreaMesh-2). Tenga en cuenta que las mallas generadas por más módulos que incorporan algún grado de control de calidad, por ejemplo, 'implicitmesh' o 'meshgen', son generalmente mejores y deben usarse con preferencia a las creadas por AreaMesh.

source: PolyhedronMesh helps to create Meshes corresponding to polyhedra. To make a cube, for example, we specify the eight vertices (see Fig. [5.7](#fig:PolyhedronMesh), left),
es: PolyhedronMesh ayuda a crear mallas correspondientes a poliedros. Para hacer un cubo, por ejemplo, especificamos los ocho vértices (ver Fig. [5.7] (#fig:PoliedroMesh), izquierda),

source: and the six faces,
es: y las seis caras,

source: Note that the vertex ids must be given _in order_ going around each face (see Fig. [5.7](#fig:PolyhedronMesh){reference-type="ref" reference="fig:PolyhedronMesh"}, center). Once the faces are specified, we can create the mesh,
es: Tenga en cuenta que los identificadores de vértices deben proporcionarse _en orden_ de dar la vuelta a cada cara (ver Fig. [5.7] (#fig:PoliedroMalla) {reference-type="ref" reference="fig:PolyhedronMesh"}, centro). Una vez especificadas las caras, podemos crear la malla,

source: Note that PolyhedronMesh automatically creates additional vertices and generates triangles to complete the mesh (Fig. [5.7](#fig:PolyhedronMesh), right). We then added line elements (grade 1) as these are not automatically created by PolyhedronMesh.
es: Tenga en cuenta que PolyhedronMesh crea automáticamente vértices adicionales y genera triángulos para completar la malla (Fig. [5.7] (#fig:PoliedroMesh), derecha). A continuación, añadimos elementos de línea (grado 1), ya que no son creados automáticamente por PolyhedronMesh.

source: The DelaunayMesh constructor function performs a delaunay "triangulation" of a point set. For example, creating a random cloud of points (Fig. [5.8](#fig:DelaunayMesh), left panel):
es: La función constructora DelaunayMesh realiza una "triangulación" delaunay de un conjunto de puntos. Por ejemplo, la creación de una nube aleatoria de puntos (Fig. [5.8] (#fig:DelaunayMesh), panel izquierdo):

source: we can then call DelaunayMesh to construct a tetrahedralization. DelaunayMesh only generates elements of the highest grade (in 2D, area elements, in 3D volume elements) so if edges are needed these can be added with `addgrade`.
es: entonces podemos llamar a DelaunayMesh para construir una tetraedralización. DelaunayMesh solo genera elementos de la más alta calidad (en 2D, elementos de área, en elementos de volumen 3D), por lo que si se necesitan bordes, estos se pueden agregar con 'addgrade'.

source: The resulting tetrahedralization is shown in Fig. [5.8](#fig:DelaunayMesh), right panel.
es: La tetraedralización resultante se muestra en la Fig. [5.8] (#fig:DelaunayMesh), panel derecho.

source: Occasionally, one wishes to take a mesh embedded in one space, say two dimensions, and embed it in a space of different dimensionality. For example, you may wish to use a 2D mesh generated with MeshGen in 3D space. The function `ChangeMeshDimension` provides a convenient way to do this:
es: De vez en cuando, uno desea tomar una malla incrustada en un espacio, digamos dos dimensiones, e incrustarla en un espacio de diferente dimensionalidad. Por ejemplo, es posible que desee utilizar una malla 2D generada con MeshGen en el espacio 3D. La función `ChangeMeshDimension` proporciona una forma cómoda de hacerlo:

source: where `dim` is the target dimension of the new mesh.
es: donde `dim` es la dimensión de destino de la nueva malla.

source: The MeshBuilder class facilitates manual construction of a Mesh object. It is primarily intended to be used by other mesh building algorithms, but is occasionally useful. To begin, create a MeshBuilder object:
es: La clase MeshBuilder facilita la construcción manual de un objeto Mesh. Está destinado principalmente a ser utilizado por otros algoritmos de construcción de mallas, pero ocasionalmente es útil. Para empezar, cree un objeto MeshBuilder:

source: You can then add vertices and other elements one by one by calling appropriate methods. Let's build a tetrahedron by first adding the vertices:
es: A continuación, puede agregar vértices y otros elementos uno por uno llamando a los métodos adecuados. Construyamos un tetraedro añadiendo primero los vértices:

source: We then need to add edges connecting these vertices, and faces as well. We could do this one by one, giving a list of vertex ids for each element in turn,
es: A continuación, tenemos que añadir aristas que conecten estos vértices, y también caras. Podríamos hacer esto uno por uno, dando una lista de identificadores de vértices para cada elemento a su vez,

source: but there's a smarter way for this case. Notice that the vertex ids corresponding to the edges of the tetrahedron correspond to the sets of size 2 generated from the list ```[``0,1,2,3``]``` as can be seen by running this code:
es: pero hay una forma más inteligente para este caso. Observe que los identificadores de vértices correspondientes a las aristas del tetraedro corresponden a los conjuntos de tamaño 2 generados a partir de la lista ```[``0,1,2,3``]``` como se puede ver ejecutando este código:

source: We can therefore generate the edges automatically,
es: Por lo tanto, podemos generar las aristas automáticamente,

source: and the faces as well, which are the sets of size 3,
es: y las caras también, que son los conjuntos de tamaño 3,

source: We can finish by adding a single grade 3 element corresponding to the volume:
es: Podemos terminar añadiendo un único elemento de grado 3 correspondiente al volumen:

source: Once all these have been added, call the `build` method to create a Mesh object:
es: Una vez que se hayan agregado todos estos, llame al método `build` para crear un objeto Mesh:

source: and the resulting Mesh is shown in Fig. [5.9](#fig:MeshBuilder).
es: y la malla resultante se muestra en la Fig. [5.9] (#fig:MeshBuilder).

source: The vtk module provides importing and exporting facilities for the popular VTK file format, which is used by many other programs such as `paraview`. Unlike morpho _.mesh_ files, VTK files can include both Mesh and Field data. To load a mesh from a VTK file, use a VTKImporter object:
es: El módulo vtk proporciona facilidades de importación y exportación para el popular formato de archivo VTK, que es utilizado por muchos otros programas como `paraview`. A diferencia de los archivos morpho _.mesh_, los archivos VTK pueden incluir datos de malla y de campo. Para cargar una malla desde un archivo VTK, use un objeto VTKImporter:

source: ``` import vtk var mv = VTKImporter("file.vtk") var m = mv.mesh() ```
es: ``` Import vtk var mv = VTKImporter("archivo.vtk") var m = mv.mesh() ```

source: Fields can be loaded in a similar way. Each field in the VTK file has an identifier, which is passed to the `field` method as a string.
es: Los campos se pueden cargar de manera similar. Cada campo del archivo VTK tiene un identificador, que se pasa al método `field` como una cadena.

source: Exporting requires a VTKExporter class,
es: La exportación requiere una clase VTKExporter,

source: A potential strategy to create meshes for complicated domains is to begin by creating several simpler meshes and then merging them together into one larger mesh. The MeshMerge class in the `meshtools` package allows us to do this. To use it, we create a MeshMerge object with a list of meshes we wish to merge
es: Una estrategia potencial para crear mallas para dominios complicados es comenzar creando varias mallas más simples y luego fusionarlas en una malla más grande. La clase MeshMerge en el paquete `meshtools` nos permite hacer esto. Para usarlo, creamos un objeto MeshMerge con una lista de mallas que deseamos fusionar

source: and then call the merge method to perform the merge and return the resulting Mesh:
es: y, a continuación, llame al método merge para realizar la combinación y devolver la malla resultante:

source: As an example of this, we will build a mesh that might be an initial guess for a membrane held between two square fixed boundaries. We'll do this by creating one octant and then reflecting it along different axes. The basic unit is constructed with PolyhedronMesh, as shown in Fig. [5.11](#fig:MeshMerge):
es: Como ejemplo de esto, construiremos una malla que podría ser una suposición inicial para una membrana sostenida entre dos límites fijos cuadrados. Para ello, crearemos un octante y luego lo reflejaremos a lo largo de diferentes ejes. La unidad básica está construida con PolyhedronMesh, como se muestra en la Fig. [5.11] (#fig:MeshMerge):

source: We now need to create code that reflects a Mesh about one or more axes. There's more than one way this could be done, but we will here create a MeshReflector class that follows the builder pattern:
es: Ahora necesitamos crear código que refleje una malla sobre uno o más ejes. Hay más de una forma de hacerlo, pero aquí crearemos una clase MeshReflector que siga el patrón del constructor:

source: Having defined this class, we create a MeshReflector and use it to build seven reflected copies:
es: Una vez definida esta clase, creamos un MeshReflector y lo usamos para construir siete copias reflejadas:

source: The resulting mesh is shown in Fig. [5.11](#fig:MeshMerge), right panel. Note that MeshMerge automatically removes duplicate elements as the merge is performed, so that
es: La malla resultante se muestra en la Fig. [5.11] (#fig:MeshMerge), panel derecho. Tenga en cuenta que MeshMerge elimina automáticamente los elementos duplicados a medida que se realiza la combinación, de modo que

source: reports that there were 35 line elements in the original mesh, while
es: informa que había 35 elementos de línea en la malla original, mientras que

source: yields \\(256=8\times(35-6/2)\\) line elements, because there are 6 shared edges for each copy.
es: produce \\(256=8\times(35-6/2)\\) elementos de línea, porque hay 6 aristas compartidas para cada copia.

source: The `meshslice` module is designed to help visualize a "slice" through the mesh and associated Fields, which is often useful when working with three or higher dimensional meshes. To illustrate its use, we'll reuse the spherical mesh created with MeshGen in the [Meshgen Section](meshgen_module.md) above (see Fig. [5.3](meshgen_module.md#fig:MeshGen-3)). Ensure that the mesh has grade 2 elements present with `addgrade` if necessary. We'll also create a simple scalar field:
es: El módulo `meshslice` está diseñado para ayudar a visualizar un "corte" a través de la malla y los campos asociados, lo que a menudo es útil cuando se trabaja con mallas tridimensionales o superiores. Para ilustrar su uso, reutilizaremos la malla esférica creada con MeshGen en la [Meshgen Section](meshgen_module.md) anterior (ver Fig. [5.3] (meshgen_module.md#fig:MeshGen-3)). Asegúrese de que la malla tenga elementos de grado 2 presentes con 'addgrade' si es necesario. También crearemos un campo escalar simple:

source: Meshes
es: Mallas

source: which shows points and edges as shown in Fig. [6.1](#fig:PlotMesh)B.
es: que muestra puntos y aristas como se muestra en la Fig. [6.1] (#fig:PlotMesh)B.

source: Mesh labels
es: Etiquetas de malla

source: To show the grade 1 element ids, for example, we might use:
es: Para mostrar los identificadores de los elementos de grado 1, por ejemplo, podríamos usar:

source: When setting up a problem in _morpho_, it's very common to use Selection objects to apply Functionals to limited parts of a Mesh. It's essential to check that the Selections are correct, and `plotselection` provides an easy way to do this. To illustrate this, let's select the lower right hand elements in the Mesh,
es: Al configurar un problema en _morpho_, es muy común usar objetos de selección para aplicar funcionales a partes limitadas de una malla. Es esencial comprobar que las selecciones son correctas, y la 'selección de parcelas' proporciona una manera fácil de hacerlo. Para ilustrar esto, seleccionemos los elementos de la parte inferior derecha de la malla,

source: and visualize the Selection as shown in Fig. [6.3](#fig:PlotSelection)A:
es: y visualice la selección como se muestra en la Fig. [6.3] (#fig:SelecciónParcela) Un:

source: Similarly, we can select the boundary,
es: Del mismo modo, podemos seleccionar la frontera,

source: and visualize the selection as shown in Fig. [6.3](#fig:PlotSelection)B:
es: y visualice la selección como se muestra en la Fig. [6.3] (#fig:SelecciónParcela) B:

source: Another important use of the `plot` module is to visualize scalar Field objects. To illustrate this, we'll create an AreaMesh that has more points,
es: Otro uso importante del módulo `plot` es visualizar objetos escalares de campo. Para ilustrar esto, crearemos un AreaMesh que tenga más puntos,

source: and a corresponding Field object:
es: y un objeto Field correspondiente:

source: It's actually the third lowest energy eigenmode of a square drum, or equivalently the \\((1,1)\\) state of a 2D infinite square well in quantum mechanics.
es: En realidad, es el tercer modo propio de energía más baja de un tambor cuadrado, o equivalentemente el estado \\((1,1)\\) de un pozo cuadrado infinito 2D en mecánica cuántica.

source: By default, `plotfield` draws points at which the Field is defined, and colors them by the value as in Fig. [6.4](#fig:PlotField)A:
es: De forma predeterminada, `plotfield` dibuja los puntos en los que se define el campo y los colorea por el valor como se muestra en la Fig. [6.4] (#fig:PlotField) Un:

source: Alternatively, `plotfield` can draw higher order elements and interpolate the coloring if you select the style option appropriately as shown in Fig. [6.4](#fig:PlotField)B:
es: Alternativamente, `plotfield` puede dibujar elementos de orden superior e interpolar el color si selecciona la opción de estilo apropiadamente como se muestra en la Fig. [6.4] (#fig:PlotField) B:

source: To aid interpretation of these plots, it's common to display a ScaleBar object alongside the plot. These have quite a few options, including the position and size, as well as the number of ticks and text layout.
es: Para facilitar la interpretación de estos gráficos, es habitual mostrar un objeto ScaleBar junto al gráfico. Estos tienen bastantes opciones, incluida la posición y el tamaño, así como el número de ticks y el diseño del texto.

source: The scalebar is the then supplied as an optional argument to `plotfield`. Here, we also use a different colormap object:
es: La barra de escala es el argumento opcional de `plotfield`. Aquí, también usamos un objeto de mapa de colores diferente:

source: The `color` module supplies a number of colormaps that you can try: ViridisMap is used by default, but PlasmaMap, MagmaMap and InfernoMap are also recommended and have been specially formulated to be accessible to users with limited color perception.
es: El módulo `color` proporciona una serie de mapas de colores que puede probar: ViridisMap se usa de forma predeterminada, pero también se recomiendan PlasmaMap, MagmaMap e InfernoMap y han sido especialmente formulados para ser accesibles a usuarios con percepción limitada del color.

source: The _morpho_ versions are adapted from _Simon Garnier, Noam Ross, Robert Rudis, Antônio P. Camargo, Marco Sciaini, and Cédric Scherer (2021). viridis(Lite) - Colorblind-Friendly Color Maps for R. viridis package version 0.6.2._
es: Las versiones _morpho_ son adaptaciones de _Simon Garnier, Noam Ross, Robert Rudis, Antônio P. Camargo, Marco Sciaini y Cédric Scherer (2021). viridis(Lite) - Mapas de color para daltónicos para el paquete R. viridis versión 0.6.2._

source: GrayMap and HueMap are also available.
es: GrayMap y HueMap también están disponibles.

source: Support for low level graphics is provided by the `graphics` module, which you can use this to create custom visualizations and generate other kinds of graphical output. These can be easily combined with output from the `plot` module, which utilizes `graphics` internally.
es: El soporte para gráficos de bajo nivel es proporcionado por el módulo `graphics`, que puede usar para crear visualizaciones personalizadas y generar otros tipos de salida gráfica. Estos se pueden combinar fácilmente con la salida del módulo `plot`, que utiliza 'gráficos' internamente.

source: We begin by creating a Graphics object, which represents a _scene_ or a collection of things to be displayed.
es: Comenzamos creando un objeto Graphics, que representa una _escena_ o una colección de cosas que se mostrarán.

source: Once the Graphics object is created, we can add _display elements_, objects specifying what is to be drawn, to the scene in turn.
es: Una vez creado el objeto Graphics, podemos añadir _display elements_, objetos que especifican lo que se va a dibujar, a la escena a su vez.

source: Sometimes referred to as graphics 'primitives'.
es: A veces se denominan gráficos ’primitivos’.

source: The graphics module supports the following kinds of element:
es: El módulo de gráficos admite los siguientes tipos de elementos:

source: **Cylinder** specified by two points at each end of the cylinder on its axis. You can also specify the aspect ratio, i.e. the ratio of the radius of the cylinder to its length, and the number of points to draw.
es: **Cilindro** especificado por dos puntos en cada extremo del cilindro sobre su eje. También puede especificar la relación de aspecto, es decir, la relación entre el radio del cilindro y su longitud, y el número de puntos a dibujar.

source: **Arrow** specified in the same way as a Cylinder, e.g.
es: **Arrow** especificada de la misma manera que un Cilindro, p.ej.

source: **Sphere** specified by the center and the radius, e.g.
es: **Sphere** especificada por el centro y el radio, p. ej.

source: **Text** specified by the text to display and the location to display at. Many options can be provided, including the drawing direction and the vertical direction, the size in points (1 graphics unit=72 points), and the Font.
es: **Text** especificado por el texto que se va a mostrar y la ubicación en la que se va a mostrar. Se pueden proporcionar muchas opciones, incluida la dirección de dibujo y la dirección vertical, el tamaño en puntos (1 unidad gráfica = 72 puntos) y la fuente.

source: **Tube** specified by a sequence of points and a radius. You can also specify if the tube is closed or not.
es: **Tube** especificado por una secuencia de puntos y un radio. También puede especificar si el tubo está cerrado o no.

source: **TriangleComplex** describes a collection of triangles, which can be used to display polyhedra and other complex objects. These elements are low-level, and further information is available in the reference section.
es: **TriangleComplex** describe una colección de triángulos, que se pueden usar para mostrar poliedros y otros objetos complejos. Estos elementos son de bajo nivel, y hay más información disponible en la sección de referencia.

source: Most of these elements accept certain optional arguments:
es: La mayoría de estos elementos aceptan ciertos argumentos opcionales:

source: **color** to specify the color.
es: **color** para especificar el color.

source: **transmit** specifies the transparency of the element, which by default is 0.
es: **transmit** especifica la transparencia del elemento, que por defecto es 0.

source: **filter** alternative way of specifying transparency for use with the povray module.
es: **Filter** Forma alternativa de especificar la transparencia para su uso con el módulo Povray.

source: Once appropriate elements have been created, we can display the Graphics object with `morphoview` using Show.
es: Una vez que se han creado los elementos apropiados, podemos mostrar el objeto Graphics con `morphoview` usando Show.

source: Example: Visualizing an electric field
es: Ejemplo: Visualización de un campo eléctrico
