Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: To get the location of this nearest point, access the location property:
es: Para obtener la ubicación de este punto más cercano, acceda a la propiedad location:

source: Search
es: Buscar

source: Finds all points in a k-d tree that lie within a cuboidal bounding box. Returns a list of KDTreeNode objects.
es: Busca todos los puntos de un árbol k-d que se encuentran dentro de un cuadro delimitador cuboidal. Devuelve una lista de objetos KDTreeNode.

source: Find and display all points that lie in a cuboid 0\<=x\<=1, 0\<=y\<=2, 1\<=z\<=2:
es: Encuentre y muestre todos los puntos que se encuentran en un cuboide 0\<=x\<=1, 0\<=y\<=2, 1\<=z\<=2:

source: An object corresponding to a single node in a k-d tree. To get the location of the node, access the `location` property:
es: Un objeto correspondiente a un solo nodo en un árbol k-d. Para obtener la ubicación del nodo, acceda a la propiedad `location`:

source: The `meshgen` module is used to create `Mesh` objects corresponding to a specified domain. It provides the `MeshGen` class to perform the meshing, which are created with the following arguments:
es: El módulo `meshgen` se utiliza para crear objetos `Mesh` correspondientes a un dominio específico. Proporciona la clase `MeshGen` para realizar el mallado, que se crean con los siguientes argumentos:

source: Domains are specified by a scalar function that is positive in the region to be meshed and locally smooth. For example, to mesh the unit disk:
es: Los dominios se especifican mediante una función escalar que es positiva en la región que se va a mallar y localmente suave. Por ejemplo, para mallar el disco de la unidad:

source: A `MeshGen` object is then created and then used to build the `Mesh` like this:
es: A continuación, se crea un objeto `MeshGen` y se utiliza para construir la `Mesh` de la siguiente manera:

source: A bounding box for the mesh must be specified as a `List` of `Range` objects, one for each dimension. The increment on each `Range` gives an approximate scale for the size of elements generated.
es: Se debe especificar un cuadro delimitador para la malla como una `Lista` de objetos `Rango`, uno para cada dimensión. El incremento en cada `Rango` da una escala aproximada para el tamaño de los elementos generados.

source: To facilitate convenient creation of domains, a `Domain` class is provided that provides set operations `union`, `intersection` and `difference`.
es: Para facilitar la creación conveniente de dominios, se proporciona una clase `Domain` que proporciona operaciones de conjunto `unión`, `intersección` y `diferencia`.

source: Domain
es: Dominio

source: Attempts to equiangulate a mesh, exchanging elements to improve their regularity.
es: Intenta equiangular una malla, intercambiando elementos para mejorar su regularidad.

source: This function takes optional arguments:
es: Esta función toma argumentos opcionales:

source: Changes the dimension in which a mesh is embedded. For example, you may have created a mesh in 2D that you now wish to use in 3D.
es: Cambia la dimensión en la que se incrusta una malla. Por ejemplo, es posible que haya creado una malla en 2D que ahora desee utilizar en 3D.

source: To fix this add the vertices first.
es: Para solucionar esto, agregue primero los vértices.

source: OptimizationProblem
es: Problema de optimización

source: Add an energy:
es: Añade una energía:

source: Add an energy that operates on a selected region, and with an optional prefactor:
es: Agregue una energía que funcione en una región seleccionada y con un prefactor opcional:

source: Add a constraint:
es: Agregue una restricción:

source: Add a local constraint (here a onesided level set constraint):
es: Agregue una restricción local (en este caso, una restricción de conjunto de niveles unilateral):

source: Optimizer
es: Optimizador

source: Visualizes a `Mesh` object:
es: Visualiza un objeto `Mesh`(Malla):

source: Plotmesh accepts a number of optional arguments to control what is displayed:
es: Plotmesh acepta una serie de argumentos opcionales para controlar lo que se muestra:

source: `selection` - Only elements in a provided `Selection` are drawn.
es: `selection`: solo se dibujan los elementos de una Selection` proporcionada.

source: `grade` - Only draw the specified grade. This can also be a list of multiple grades to draw.
es: `grade` - Dibuja solo la calificación especificada. Esta también puede ser una lista de varios grados para dibujar.

source: `color` - Draw the mesh in a provided `Color`.
es: `color` - Dibuja la malla en un `Color` proporcionado.

source: `filter` and `transmit` - Used by the `povray` module to indicate transparency.
es: `filter` y `transmit` - Utilizado por el módulo `povray` para indicar transparencia.

source: Plotmeshlabels
es: Etiquetas de malla gráfica

source: Draws the ids for elements in a `Mesh`:
es: Dibuja los identificadores de los elementos de una `Mesh`:

source: Plotmeshlabels accepts a number of optional arguments to control the output:
es: Plotmeshlabels acepta una serie de argumentos opcionales para controlar la salida:

source: `selection` - Only labels in a provided `Selection` are drawn.
es: `selection`: solo se dibujan las etiquetas de una `Selección` proporcionada.

source: `offset` - Local offset vector for labels. Can be a `List`, a `Matrix` or a function.
es: `offset` - Vector de desplazamiento local para etiquetas. Puede ser una `Lista`, una `Matriz` o una función.

source: `dirn` - Text direction for labels. Can be a `List`, a `Matrix` or a function.
es: `dirn` - Dirección del texto para las etiquetas. Puede ser una `Lista`, una `Matriz` o una función.

source: `vertical` - Text vertical direction. Can be a `List`, a `Matrix` or a function.
es: `vertical` - Dirección vertical del texto. Puede ser una `Lista`, una `Matriz` o una función.

source: `color` - Label color. Can be a `Color` object or a `Dictionary` of colors for each grade.
es: `color` - Color de la etiqueta. Puede ser un objeto `Color` o un `Diccionario` de colores para cada grado.

source: `fontsize` - Font size to use.
es: `fontsize` - Tamaño de fuente a utilizar.

source: Visualizes a `Selection` object:
es: Visualiza un objeto `Selection`:

source: Plotselection accepts a number of optional arguments to control what is displayed:
es: Plotselection acepta una serie de argumentos opcionales para controlar lo que se muestra:

source: Visualizes a scalar `Field` object:
es: Visualiza un objeto `Field` (Campo) escalar:

source: Plotfield accepts a number of optional arguments to control what is displayed:
es: Plotfield acepta una serie de argumentos opcionales para controlar lo que se muestra:

source: `grade` - Draw the specified grade.
es: `grade` - Dibuja el grado especificado.

source: `colormap` - A `Colormap` object to use. The field is automatically scaled.
es: `colormap` - Un objeto `Colormap` para usar. El campo se escala automáticamente.

source: `scalebar` - A `Scalebar` object to use.
es: `scalebar` - Un objeto `Scalebar` que se va a utilizar.

source: `style` - Plot style. See below.
es: `style` - Estilo de trama. Véase más abajo.

source: `cmin` and `cmax` - Can be used to define the data range covered. Values beyond these limits will be colored by the lower/upper bound of the colormap accordingly.
es: `cmin` y `cmax`: se pueden usar para definir el rango de datos cubierto. Los valores más allá de estos límites se colorearán según el límite inferior/superior del mapa de colores en consecuencia.

source: Supported plot styles:
es: Estilos de trazado admitidos:

source: `default` - Color `Mesh` elements by the corresponding value of the `Field`.
es: `default` - Colorea los elementos `Mesh` por el valor correspondiente del `Campo`.

source: `interpolate` - Interpolate `Field` quantities onto higher elements.
es: `interpolate` - Interpolar cantidades de `Field` en elementos superiores.

source: ScaleBar
es: Barra de escala

source: Represents a scalebar for a plot:
es: Representa una barra de escala para un gráfico:

source: `ScaleBar`s can be created with many adjustable parameters:
es: `ScaleBar` se puede crear con muchos parámetros ajustables:

source: `nticks` - Maximum number of ticks to show.
es: `nticks` - Número máximo de ticks que se mostrarán.

source: `posn` - Position to draw the `ScaleBar`.
es: `posn` - Posición para dibujar la `ScaleBar`.

source: `length` - Length of `ScaleBar` to draw.
es: `length` - Longitud de la `ScaleBar` que se va a dibujar.

source: `dirn` - Direction to draw the `ScaleBar` in.
es: `dirn` - Dirección en la que se dibujará la 'ScaleBar'.

source: `tickdirn` - Direction to draw the ticks in.
es: `tickdirn` - Dirección para dibujar las garrapatas.

source: `colormap` - `ColorMap` to use.
es: `colormap` - 'ColorMap' a utilizar.

source: `textdirn` - Direction to draw labels in.
es: `textdirn` - Dirección en la que se dibujarán las etiquetas.

source: `textvertical` - Label vertical direction.
es: `textvertical` - Dirección vertical de la etiqueta.

source: `fontsize` - Fontsize for labels
es: `fontsize` - Tamaño de fuente para etiquetas

source: `textcolor` - Color for labels
es: `textcolor` - Color para etiquetas

source: You can draw the `ScaleBar` directly by calling the `draw` method:
es: Puede dibujar la `ScaleBar` directamente llamando al método `draw`:

source: where `min` and `max` are the minimum and maximum values to display on the scalebar.
es: donde `min` y `max` son los valores mínimo y máximo que se mostrarán en la barra de escala.

source: The `povray` module provides integration with POVRay, a popular open source ray-tracing package for high quality graphical rendering. To use the module, first import it:
es: El módulo `povray` proporciona integración con POVRay, un popular paquete de trazado de rayos de código abierto para una representación gráfica de alta calidad. Para usar el módulo, primero impórtelo:

source: To raytrace a graphic, begin by creating a `POVRaytracer` object:
es: Para trazar un gráfico con rayos, comience por crear un objeto `POVRaytracer`:

source: Create a .pov file that can be run with POVRay:
es: Cree un archivo .pov que se pueda ejecutar con POVRay:

source: Create, render and display a scene using POVRay:
es: Cree, renderice y muestre una escena con POVRay:

source: This also creates the .png file for the scene.
es: Esto también crea el archivo .png para la escena.

source: The `POVRaytracer` constructor supports an optional `camera` argument:
es: El constructor `POVRaytracer` admite un argumento opcional `camera`:

source: `camera` - a `Camera` object (see below / help) containing the settings for the povray camera.
es: `camera` - un objeto 'Cámara' (ver más abajo / ayuda) que contiene la configuración de la cámara povray.

source: The `Camera` object can be initialized as follows:
es: El objeto `Camera` se puede inicializar de la siguiente manera:

source: This object contains the default settings of the camera, which can be changed using the following optional arguments, or by just setting the attributes after instantiation:
es: Este objeto contiene la configuración predeterminada de la cámara, que se puede cambiar usando los siguientes argumentos opcionales, o simplemente estableciendo los atributos después de la creación de instancias:

source: `antialias` - whether to antialias the output or not (`true` by default)
es: `antialias`: si se suaviza el suavizado de la salida o no (`true` de forma predeterminada)

source: `width` - image width (`2048` by default)
es: `width` - ancho de la imagen (`2048` por defecto)

source: `height` - image height (`1536` by default)
es: `height` - altura de la imagen (`1536` por defecto)

source: `viewangle` - camera angle (higher means wider view) (`24` by default)
es: `viewangle` - ángulo de la cámara (más alto significa una vista más amplia) (`24` por defecto)

source: `viewpoint` - position of camera (`Matrix([0,0,-5])` by default)
es: `viewpoint` - posición de la cámara (`Matrix([0,0,-5])` por defecto)

source: `look_at` - coordinate to look at (`Matrix([0,0,0])` by defualt)
es: `look_at` - coordenada para mirar (`Matrix([0,0,0])` por defecto)

source: `sky` - orientation pointing to the sky (`Matrix([0,1,0])` by default)
es: `sky` - orientación que apunta al cielo (`Matrix([0,1,0])` por defecto)

source: The default settings generate a reasonable centered view of the x-y plane.
es: La configuración predeterminada genera una vista centrada razonable del plano x-y.

source: These attributes can also be set directly for the `POVRaytracer` object:
es: Estos atributos también se pueden establecer directamente para el objeto `POVRaytracer`:

source: The `render` method supports a few optional boolean arguments:
es: El método `render` admite algunos argumentos booleanos opcionales:

source: `quiet` - whether to suppress the parser and render statistics from `povray` or not (`false` by default)
es: `quiet` - si se suprime el analizador y se renderizan las estadísticas de `povray` o no (`false` por defecto)

source: `display` - whether to turn on the graphic display while rendering or not (`true` by default)
es: `display`: si se debe activar la pantalla gráfica durante el renderizado o no (`true` de forma predeterminada)

source: `shadowless` - whether to turn off the shadows while rendering (`false` by default)
es: `shadowless`: si se deben desactivar las sombras durante el renderizado ('false' de forma predeterminada)

source: `transparent` - whether to render the graphic with a transparent background in the output PNG (`false` by default)
es: `transparent`: si se debe representar el gráfico con un fondo transparente en el PNG de salida ('false' de forma predeterminada)

source: Camera
es: Cámara

source: The vtk module contains classes to allow I/O of meshes and fields using the VTK Legacy Format. Note that this currently only supports scalar or 2D/3D vector (column matrix) fields that live on the vertices ( shape `[1,0,0]`). Support for tensorial fields and fields on cells coming soon.
es: El módulo vtk contiene clases para permitir la E/S de mallas y campos utilizando el formato heredado de VTK. Tenga en cuenta que actualmente solo admite campos escalares o vectoriales 2D/3D (matriz de columnas) que se encuentran en los vértices (forma `[1,0,0]`). Próximamente se admitirán campos tensoriales y campos en celdas.

source: This class can be used to export the field(s) and/or a mesh at a given state to a single .vtk file. To use it, import the `vtk` module:
es: Esta clase se puede utilizar para exportar los campos y/o una malla en un estado determinado a un único archivo .vtk. Para usarlo, importe el módulo `vtk`:

source: Initialize the `VTKExporter`
es: Inicializar el archivo `VTKExporter`

source: where `obj` can either be
es: donde `obj` puede ser

source: A `Mesh` object: This prepares the Mesh for exporting.
es: Un objeto `Mesh`: Esto prepara la malla para la exportación.

source: A `Field` object: This prepares both the Field and the Mesh associated with it for exporting.
es: Un objeto `Campo`: Prepara tanto el campo como la malla asociada a él para la exportación.

source: Use the `export` method to export to a VTK file.
es: Utilice el método `exportar` para exportar a un archivo VTK.

source: Optionally, use the `addfield` method to add one or more fields before exporting:
es: Opcionalmente, utilice el método `addfield` para agregar uno o más campos antes de exportar:

source: where,
es: dónde,

source: `f` is the field object to be exported
es: `f` es el objeto de campo que se va a exportar

source: `fieldname` is an optional argument that assigns a name to the field in the VTK file. This name is required to be a character string without embedded whitespace. If not provided, the name would be either "scalars" or "vectors" depending on the field type\*\*.
es: `fieldname` es un argumento opcional que asigna un nombre al campo en el archivo VTK. Este nombre debe ser una cadena de caracteres sin espacios en blanco incrustados. Si no se proporciona, el nombre sería "escalares" o "vectores" según el tipo de campo\*\*.

source: \** Note that this currently only supports scalar or 2D/3D vector (column matrix) fields that live on the vertices ( shape `[1,0,0]`). Support for tensorial fields and fields on cells coming soon.
es: \** Tenga en cuenta que esto actualmente solo admite campos escalares o vectoriales 2D/3D (matriz de columnas) que residen en los vértices ( forma `[1,0,0]`). Próximamente se admitirán campos tensoriales y campos en celdas.

source: Minimal example:
es: Ejemplo mínimo:

source: // Export just the mesh
es: // Exporta solo la malla

source: // Export fields
es: // Exportación de los campos

source: This class can be used to import the field(s) and/or the mesh at a given state from a single .vtk file. To use it, import the `vtk` module:
es: Esta clase se puede utilizar para importar los campos y/o la malla en un estado determinado desde un único archivo .vtk. Para usarlo, importe el módulo `vtk`:

source: Initialize the `VTKImporter` with the filename
es: Inicialice el `VTKImporter` con el nombre del archivo

source: Use the `mesh` method to get the mesh:
es: Utilice el método `mesh` para obtener la malla:

source: Use the `field` method to get the field:
es: Utilice el método `field` para obtener el campo:

source: Use the `fieldlist` method to get the list of the names of the fields contained in the file:
es: Utilice el método `fieldlist` para obtener la lista de los nombres de los campos contenidos en el archivo:

source: Use the `containsfield` method to check whether the file contains a field by a given `fieldname`:
es: Utilice el método `containsfield` para comprobar si el archivo contiene un campo por un `fieldname` determinado:

source: where `fieldname` is the name assigned to the field in the .vtk file
es: donde `fieldname` es el nombre asignado al campo en el archivo .vtk

source: This is a conversion of the [Morpho](https://github.com/Morpho-lang/morpho) manual from the original [LyX/TeX](https://github.com/Morpho-lang/morpho-manual) to an `mdBook` format.
es: Esta es una conversión del manual [Morpho](https://github.com/Morpho-lang/morpho) del [LyX/TeX](https://github.com/Morpho-lang/morpho-manual) original a un formato 'mdBook'.

source: _Morpho_ is designed by Prof. Timothy J. Atherton at Tufts University. This conversion is my hobby-work done during my time at Tufts as a postdoctoral scholar with him.
es: _Morpho_ está diseñado por el Prof. Timothy J. Atherton en la Universidad de Tufts. Esta conversión es mi trabajo de pasatiempo realizado durante mi tiempo en Tufts como becario postdoctoral con él.

source: Here are my few design goals for this conversion. Some are already met, some are a work in progress:
es: Estos son mis pocos objetivos de diseño para esta conversión. Algunos ya se cumplen, otros son un trabajo en progreso:

source: Faithfully reproduce all the content of the manual (done)
es: Reproducir fielmente todo el contenido del manual (hecho)

source: Emphasize accessibility, especially of the math content (wip)
es: Enfatizar la accesibilidad, especialmente del contenido matemático (wip)

source: Ensure easy extension in the future by streamlining the automation. (some portions are very much not streamlined right now!)
es: Garantice una fácil ampliación en el futuro agilizando la automatización. (¡Algunas partes no están muy optimizadas en este momento!)

source: I found `mdBook` very easy to use and was able to set-up the basic website without any use of HTML/CSS. I am open to suggestions to move this to another tool.
es: Encontré 'mdBook' muy fácil de usar y pude configurar el sitio web básico sin ningún uso de HTML / CSS. Estoy abierto a sugerencias para trasladar esto a otra herramienta.

source: To build the book, you need to have [`mdbook`](https://github.com/rust-lang/mdBook) installed. You can install it with `cargo`:
es: Para construir el libro, necesitas tener ['mdbook'](https://github.com/rust-lang/mdBook) instalado. Puedes instalarlo con 'cargo':

source: Then, you need to generate the figures and the reference section by running the `build.py` script:
es: A continuación, debe generar las figuras y la sección de referencia ejecutando el script 'build.py':

source: (Make sure to change the `libmorphofolder` path to your local libmorpho folder in the `build.py` script. In the future, we will auto-download the help from GitHub.)
es: (Asegúrese de cambiar la ruta `libmorphofolder` a su carpeta libmorpho local en el script `build.py`. En el futuro, descargaremos automáticamente la ayuda de GitHub.)

source: Finally, you can build the book by running `mdbook`:
es: Por último, puedes construir el libro ejecutando `mdbook`:

source: This will generate the HTML files in the `book` directory. You can view the book by opening the `index.html` file in your browser.
es: Esto generará los archivos HTML en el directorio `book`. Puede ver el libro abriendo el archivo `index.html` en su navegador.

source: To preview the book, you can run the following command:
es: Para obtener una vista previa del libro, puede ejecutar el siguiente comando:

source: Authoring Guidelines
es: Directrices de creación

source: The general guidelines for writing a book with `mdBook` can be found in their [user guide](https://rust-lang.github.io/mdBook/index.html).
es: Las pautas generales para escribir un libro con `mdBook` se pueden encontrar en su [guía del usuario](https://rust-lang.github.io/mdBook/index.html).

source: Equations are handled using slightly modified MathJax:
es: Las ecuaciones se manejan usando MathJax ligeramente modificado:

source: Inline equations are delimited by `\\(` and `\\)` (same as `mdBook` default).
es: Las ecuaciones en línea están delimitadas por `\\(` y `\\)` (igual que `mdBook` por defecto).

source: Block equations are delimited by `$$` and `$$`.
es: Las ecuaciones de bloques están delimitadas por `$$` y `$$`.

source: Auto-numbering and cross-referencing support is limited, numbering not including chapter and section numbers, and cross-referencing limited to within a single `.md` file.
es: La numeración automática y el soporte de referencias cruzadas son limitados, la numeración no incluye los números de capítulo y sección, y las referencias cruzadas se limitan a un solo archivo `.md`.

source: Labeling an equation is same as in TeX:
es: El etiquetado de una ecuación es el mismo que en TeX:

source: Cross-referencing within the document can be done by `\eqref`:
es: Las referencias cruzadas dentro del documento se pueden realizar mediante `\eqref`:

source: See the [Electrostatics example](examples/electrostatics.md) for usage.
es: Consulte el [Ejemplo de electrostática](examples/electrostatics.md) para obtener información sobre el uso.

source: Morpho code is syntax-highlighted using the JavaScript syntax for now:
es: El código de Morpho está resaltado por sintaxis usando la sintaxis de JavaScript por ahora:

source: renders to
es: se renderiza a

source: Generating the MarkDown files from the original manual
es: Generación de los archivos MarkDown a partir del manual original

source: This mdBook was generated by a series of conversions of the [original LyX file](https://github.com/Morpho-lang/morpho/blob/main/manual/src/manual.lyx).
es: Este mdBook fue generado por una serie de conversiones del [archivo original de LyX](https://github.com/Morpho-lang/morpho/blob/main/manual/src/manual.lyx).

source: Export the LyX file as a `.tex` file
es: Exportar el archivo LyX como un archivo `.tex`

source: Convert it to markdown with MathJax using Pandoc using the following command:
es: Conviértalo en markdown con MathJax usando Pandoc usando el siguiente comando:
