Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: The `levelset` method manufactures a scalar function representing the ellipsoid and suitable for use with the ScalarPotential functional. A second method, `gradient`, returns the gradient of that function.
es: El método `levelset` fabrica una función escalar que representa el elipsoide y es adecuada para su uso con el funcional ScalarPotential. Un segundo método, `gradient`, devuelve el gradiente de esa función.

source: The two ellipsoids of interest are then created like so:
es: A continuación, se crean los dos elipsoides de interés de la siguiente manera:

source: The optimization problem is set up to include the surface area subject to satisfaction of the level set constraints; these are noted as one-sided, i.e. satisfied if the mesh lies at any point outside the constraint region.
es: El problema de optimización se configura para incluir el área de superficie sujeta al cumplimiento de las restricciones establecidas por el nivel; Estos se anotan como unilaterales, es decir, satisfechos si la malla se encuentra en cualquier punto fuera de la región de restricción.

source: ``` // We want to minimize the area var la = Area() // Subject to level set constraints var ls1 = ScalarPotential( ell1.levelset(), ell1.gradient() ) var ls2 = ScalarPotential( ell2.levelset(), ell2.gradient() ) var leq = EquiElement() var problem = OptimizationProblem(m) problem.addenergy(la) problem.addlocalconstraint(ls1, onesided=true) problem.addlocalconstraint(ls2, onesided=true) ```
es: ``` // We want to minimize the area var la = Area() // Subject to level set constraints var ls1 = ScalarPotential( ell1.levelset(), ell1.gradient() ) var ls2 = ScalarPotential( ell2.levelset(), ell2.gradient() ) var leq = EquiElement() var problem = OptimizationProblem(m) problem.addenergy(la) problem.addlocalconstraint(ls1, onesided=true) problem.addlocalconstraint(ls2, onesided=true) ```blem.addlocalconstraint(ls2, onesided=true) ```

source: To promote mesh quality, a second regularization problem is set up:
es: Para promover la calidad de la malla, se establece un segundo problema de regularización:

source: Optimization and refinement are performed iteratively:
es: La optimización y el refinamiento se realizan de forma iterativa:

source: Note that we set `stepsize` and `steplimit` on each optimizer; these values were found by trial and error. The initial shape is quite extreme, and so we use `relax` for the main optimization problem which is very robust. Calling `equiangulate` helps maintain mesh quality.
es: Tenga en cuenta que establecemos `stepsize` y `steplimit` en cada optimizador; Estos valores se encontraron por ensayo y error. La forma inicial es bastante extrema, por lo que usamos 'relax' para el problema de optimización principal, que es muy robusto. Llamar "equiangulado" ayuda a mantener la calidad de la malla.

source: This chapter mirrors the documentation of everything shipped with the core Morpho distribution. The documentation is organized in the following sections:
es: Este capítulo refleja la documentación de todo lo que se envía con la distribución principal de Morpho. La documentación está organizada en los siguientes apartados:

source: The [Language](reference/language.md) section provides a detailed description of the Morpho language, including the syntax and semantics of the language.
es: La sección [Language](reference/language.md) proporciona una descripción detallada del lenguaje Morpho, incluyendo la sintaxis y la semántica del lenguaje.

source: The [Data Types](reference/data_types.md) section describes the various data types like `List`'s, `Matrix` objects, etc.
es: La sección [Tipos de datos](reference/data_types.md) describe los distintos tipos de datos como `Lista`, objetos `Matriz`, etc.

source: The [Computational Geometry](reference/computational_geometry.md) section provides the documentation for meshes, selections, fields and functionals.
es: La sección [Computational Geometry](reference/computational_geometry.md) proporciona la documentación de mallas, selecciones, campos y funcionales.

source: The [I/O](reference/io.md) section provides the documentation for the `File` object.
es: La sección [I/O](reference/io.md) proporciona la documentación para el objeto `File`.

source: The [Modules](reference/modules.md) section provides the documentation for the various standard modules shipped with Morpho.
es: La sección [Módulos](reference/modules.md) proporciona la documentación de los distintos módulos estándar enviados con Morpho.

source: This section provides a detailed description of the Morpho language, including the syntax and semantics of the language.
es: Esta sección proporciona una descripción detallada del lenguaje Morpho, incluyendo la sintaxis y la semántica del lenguaje.

source: Morpho provides a flexible object oriented language similar to other languages in the C family (like C++, Java and Javascript) with a simplified syntax.
es: Morpho proporciona un lenguaje orientado a objetos flexible similar a otros lenguajes de la familia C (como C++, Java y Javascript) con una sintaxis simplificada.

source: Morpho programs are stored as plain text with the .morpho file extension. A program can be run from the command line by typing
es: Los programas de Morpho se almacenan como texto plano con la extensión de archivo .morpho. Un programa se puede ejecutar desde la línea de comandos escribiendo

source: Comments
es: Comentarios

source: Two types of comment are available. The first type is called a 'line comment' whereby text after `//` on the same line is ignored by the interpreter.
es: Hay dos tipos de comentarios disponibles. El primer tipo se denomina "comentario de línea" por el cual el texto después de `//` en la misma línea es ignorado por el intérprete.

source: // A comment
es: // Un comentario

source: Longer 'block' comments can be created by placing text between `/*` and `*/`. Newlines are ignored
es: Se pueden crear comentarios de 'bloque' más largos colocando texto entre `/*` y `*/`. Se ignoran las nuevas líneas

source: /* This is a longer comment */
es: /*Éste es Un comentario más largo */

source: In contrast to C, these comments can be nested
es: A diferencia de C, estos comentarios se pueden anidar

source: /* A nested /* comment */
es: /* Un comentario /*anidado */

source: enabling the programmer to quickly comment out a section of code.
es: permitiendo al programador comentar rápidamente una sección de código.

source: Symbols
es: Símbolos

source: Symbols are used to refer to named entities, including variables, classes, functions etc. Symbols must begin with a letter or underscore _ as the first character and may include letters or numbers as the remainder. Symbols are case sensitive.
es: Los símbolos se utilizan para referirse a entidades con nombre, incluidas variables, clases, funciones, etc. Los símbolos deben comenzar con una letra o guión bajo _ como primer carácter y pueden incluir letras o números como el resto. Los símbolos distinguen entre mayúsculas y minúsculas.

source: Classes are typically given names with an initial capital letter. Variable names are usually all lower case.
es: Por lo general, las clases reciben nombres con una letra mayúscula inicial. Los nombres de las variables suelen estar todos en minúsculas.

source: Newlines
es: Saltos

source: Strictly, morpho ends statements with semicolons like C, but in practice these are usually optional and you can just start a new line instead. For example, instead of
es: Estrictamente, morpho termina las declaraciones con punto y coma como C, pero en la práctica estos suelen ser opcionales y puede comenzar una nueva línea en su lugar. Por ejemplo, en lugar de

source: // The ; is optional
es: // El ; es opcional

source: you can simply use
es: simplemente puede usar

source: If you want to put several statements on the same line, you can separate them with semicolons:
es: Si desea poner varias instrucciones en la misma línea, puede separarlas con punto y coma:

source: There are a few edge cases to be aware of: The morpho parser works by accepting a newline anywhere it expects to find a semicolon. To split a statement over multiple lines, signal to morpho that you plan to continue by leaving the statement unfinished. Hence, do this:
es: Hay algunos casos extremos a tener en cuenta: El analizador de morpho funciona aceptando una nueva línea en cualquier lugar donde espere encontrar un punto y coma. Para dividir una instrucción en varias líneas, indique a morpho que planea continuar dejando la instrucción sin terminar. Por lo tanto, haga esto:

source: rather than this:
es: en lugar de esto:

source: // < Morpho thinks this is a complete statement
es: // < Morpho cree que esta es una declaración completa

source: // < and so this line will cause a syntax error
es: // < y por lo tanto esta línea causará un error de sintaxis

source: Booleans
es: Booleanos

source: Comparison operations like `==`, `<` and `>=` return `true` or `false` depending on the result of the comparison. For example,
es: Las operaciones de comparación como `==`, `<` y `>=` devuelven `verdadero` o `falso` dependiendo del resultado de la comparación. Por ejemplo,

source: prints `false`. The constants `true` or `false` are provided for you to use in your own code:
es: imprime `false`. Las constantes `true` o `false` se proporcionan para que las use en su propio código:

source: The keyword `nil` is used to represent the absence of an object or value.
es: La palabra clave `nil` se utiliza para representar la ausencia de un objeto o valor.

source: Note that in `if` statements, a value of `nil` is treated like `false`.
es: Tenga en cuenta que en las instrucciones `if`, un valor de `nil` se trata como `false`.

source: // Never executed.
es: // Nunca se ejecuta.

source: Blocks
es: Bloques

source: Code is divided into _blocks_, which are delimited by curly brackets like this:
es: El código se divide en _bloques_, que están delimitados por llaves como esta:

source: "Hello"
es: "Hola"

source: This syntax is used in function declarations, loops and conditional statements.
es: Esta sintaxis se utiliza en declaraciones de funciones, bucles e instrucciones condicionales.

source: Any variables declared within a block become _local_ to that block, and cannot be seen outside of it. For example,
es: Cualquier variable declarada dentro de un bloque se convierte en _local_ para ese bloque y no se puede ver fuera de él. Por ejemplo,

source: would print "Bar" then "Foo"; the version of `a` inside the code block is said to _shadow_ the outer version.
es: imprimiría "Bar" y luego "Foo"; Se dice que la versión de `a` dentro del bloque de código _sombra_ de la versión externa.

source: Precedence
es: Precedencia

source: Precedence refers to the order in which morpho evaluates operations. For example,
es: La precedencia se refiere al orden en el que morpho evalúa las operaciones. Por ejemplo,

source: prints `7` because `2*3` is evaluated before the addition; the operator `*` is said to have higher precedence than `+`.
es: imprime `7` porque `2*3` se evalúa antes de la suma; Se dice que el operador '*' tiene mayor prioridad que `+`.

source: You can always modify the order of evaluation by using parentheses:
es: Siempre puede modificar el orden de evaluación mediante paréntesis:

source: // prints 9
es: // imprime 9

source: Print
es: Imprimir

source: The `print` keyword is used to print information to the console. It can be followed by any value, e.g.
es: La palabra `print` se utiliza para imprimir información en la consola. Puede ir seguido de cualquier valor, p. ej.

source: Values are the basic unit of information in morpho: All functions in morpho accept values as arguments and return values.
es: Los valores son la unidad básica de información en morpho: Todas las funciones en morpho aceptan valores como argumentos y devuelven valores.

source: Morpho provides integers, which work as you would expect in other languages, although you rarely need to worry about the distinction between floats and integers.
es: Morpho proporciona números enteros, que funcionan como cabría esperar en otros idiomas, aunque rara vez es necesario preocuparse por la distinción entre números flotantes y enteros.

source: Convert a floating point number to an Integer:
es: Convierta un número de coma flotante en un número entero:

source: // expect: 1
es: // esperado: 1

source: Convert a string to an integer:
es: Convierta una cuerda en un entero:

source: // expect: 11
es: // esperado: 11

source: Float
es: Flotar

source: Morpho provides double precision floating point numbers.
es: Morpho proporciona números de coma flotante de doble precisión.

source: Convert a string to a floating point number:
es: Convierta una cadena en un número de coma flotante:

source: // expect: 121
es: // esperado: 121

source: Returns the smallest integer larger than or equal to its argument:
es: Devuelve el entero más pequeño mayor o igual que su argumento:

source: // expect: 2
es: // esperado: 2

source: Returns the largest integer smaller than or equal to its argument:
es: Devuelve el entero más grande menor o igual que su argumento:

source: Format
es: Formato

source: The format method converts a number to a `String` using a given format specifier:
es: El método format convierte un número en un `String` utilizando un especificador de formato dado:

source: // Outputs 0.33
es: // Salidas: 0.33

source: The specifier must begin with '%' and may include:
es: El especificador debe comenzar con `%` y puede incluir:

source: A minimum width, given as an integer.
es: Un ancho mínimo, dado como un número entero.

source: Number of decimal places to show, with '.' in front.
es: Número de decimales que se mostrarán, con '.' delante.

source: A formatting option, either 'f' or 'g' where:
es: Una opción de formato, ya sea 'f' o 'g' donde:

source: The syntax for the formatting string is similar to that used in C and Python.
es: La sintaxis de la cadena de formato es similar a la utilizada en C y Python.

source: Variables are defined using the `var` keyword followed by the variable name:
es: Las variables se definen utilizando la palabra clave `var` seguida del nombre de la variable:

source: Optionally, an initial assignment may be given:
es: Opcionalmente, se puede dar una tarea inicial:

source: Variables defined in a block of code are visible only within that block, so
es: Las variables definidas en un bloque de código solo son visibles dentro de ese bloque, por lo que

source: "Goodbye"
es: “Adios”

source: will print
es: imprimirá

source: Multiple variables can be defined at once by separating them with commas
es: Se pueden definir varias variables a la vez separándolas con comas

source: where each can have its own initializer (or not).
es: donde cada uno puede tener su propio inicializador (o no).

source: Indexing
es: Indexación

source: Morpho provides a number of collection objects, such as `List`, `Range`, `Array`, `Dictionary`, `Matrix` and `Sparse`, that can contain more than one value. Index notation (sometimes called subscript notation) is used to access elements of these objects.
es: Morpho proporciona una serie de objetos de colección, como `List`, `Range`, `Array`, `Dictionary`, `Matrix` y `Sparse`, que pueden contener más de un valor. La notación de índice (a veces llamada notación de subíndice) se utiliza para acceder a los elementos de estos objetos.

source: To retrieve an item from a collection, you use the `[` and `]` brackets like this:
es: Para recuperar un elemento de una colección, use los corchetes `[` y `]` de la siguiente manera:

source: "Apple"
es: "Manzana"

source: "Bag"
es: "Bolsa"

source: "Cat"
es: "Gato"

source: which prints _Apple_. Note that the first element is accessed with `0` not `1`.
es: que imprime _Apple_. Tenga en cuenta que se accede al primer elemento con `0`, no con `1`.

source: Similarly, to set an entry in a collection, use:
es: Del mismo modo, para establecer una entrada en una colección, use:

source: "Adder"
es: "Víbora"

source: which would replaces the first element in `a` with `"Adder"`.
es: que reemplazaría el primer elemento de `a` por `’’Adder’’`.

source: Some collection objects need more than one index,
es: Algunos objetos de colección necesitan más de un índice,

source: and others such as `Dictionary` use non-numerical indices,
es: y otros como `Dictionary` utilizan índices no numéricos,

source: as in this dictionary of state capitals.
es: como en este diccionario de capitales de estado.

source: Control flow statements are used to determine whether and how many times a selected piece of code is executed. These include:
es: Las instrucciones de flujo de control se utilizan para determinar si se ejecuta un fragmento de código seleccionado y cuántas veces. Entre ellas se encuentran:

source: `if` - Selectively execute a piece of code if a condition is met.
es: `if` - ejecuta selectivamente un fragmento de código si se cumple una condición.

source: `else` - Execute a different block of code if the test in an `if` statement fails.
es: `else` - ejecuta un bloque de código diferente si se produce un error en la prueba de una instrucción 'if'.

source: `for` - Repeatedly execute a section of code with a counter
es: `for` - ejecuta repetidamente una sección de código con un contador

source: `while` - Repeatedly execute a section of code while a condition is true.
es: `while` - ejecuta repetidamente una sección de código mientras se cumple una condición.

source: `If` allows you to selectively execute a section of code depending on whether a condition is met. The simplest version looks like this:
es: `If` le permite ejecutar selectivamente una sección de código dependiendo de si se cumple una condición. La versión más simple se ve así:

source: where the body of the loop, `print x`, is only executed if x is less than 1. The body can be a code block to accommodate longer sections of code:
es: donde el cuerpo del bucle, `print x`, solo se ejecuta si x es menor que 1. El cuerpo puede ser un bloque de código para dar cabida a secciones de código más largas:

source: // do something
es: // haz algo

source: If you want to choose between two alternatives, use `else`:
es: Si quieres elegir entre dos alternativas, usa `else`:

source: // this code is executed only if the condition is false
es: Este código solo se ejecuta si la condición es falsa

source: You can even chain multiple tests together like this:
es: Incluso puede encadenar varias pruebas de la siguiente manera:

source: // option 1
es: // opción 1

source: // option 2
es: // opción 2

source: // something else
es: // algo más

source: While loops repeat a section of code while a condition is true. For example,
es: Los bucles while repiten una sección de código mientras una condición es verdadera. Por ejemplo,

source: prints the numbers 1 to 4. The loop has two sections: `cond` is the condition to be executed and `body` is the section of code to be repeated.
es: imprime los números del 1 al 4. El bucle tiene dos secciones: `cond` es la condición que se va a ejecutar y `body` es la sección de código que se va a repetir.

source: Simple loops like the above example, especially those that involve counting out a sequence of numbers, are more conveniently written using a `for` loop,
es: Los bucles simples como el ejemplo anterior, especialmente aquellos que implican contar una secuencia de números, se escriben más convenientemente usando un ciclo `for`,

source: Where `while` loops can be very useful is where the state of an object is being changed in the loop, e.g.
es: Donde los ciclos `while` pueden ser muy útiles es cuando se cambia el estado de un objeto en el ciclo, p. ej.

source: which prints 4,3,2,1.
es: que imprime 4,3,2,1.

source: A `do`...`while` loop repeats code while a condition is true---similar to a `while` loop---but the test happens at the end:
es: Un ciclo `do`…`while` repite el código mientras una condición es verdadera---similar a un bucle `while`—pero la prueba ocurre al final:

source: which prints 1,2,3,4
es: que imprime 1,2,3,4

source: Hence this type of loop executes at least one interation
es: Por lo tanto, este tipo de bucle ejecuta al menos una interacción

source: For loops allow you to repeatedly execute a section of code. They come in two versions: the simpler version looks like this,
es: Los ciclos For permiten ejecutar repetidamente una sección de código. Vienen en dos versiones: la versión más simple se ve así,

source: which prints the numbers 1 to 5 in turn. The variable `i` is the _loop variable_, which takes on a different value each iteration. `1..5` is a range, which denotes a sequence of numbers. The _body_ of the loop, `print i`, is the code to be repeatedly executed.
es: que imprime los números del 1 al 5 a su vez. La variable `i` es la _loop variable_, que adquiere un valor diferente en cada iteración. `1..5` es un rango, que denota una secuencia de números. El _body_ del bucle, `print i`, es el código que se ejecutará repetidamente.

source: Morpho will implicitly insert a `var` before the loop variable if it's missing, so this works too:
es: Morpho insertará implícitamente una `var` antes de la variable de bucle si falta, por lo que esto también funciona:

source: If you want your loop variable to count in increments other than 1, you can specify a stepsize in the range:
es: Si desea que la variable de bucle cuente en incrementos distintos de 1, puede especificar un tamaño de paso en el rango:

source: Ranges need not be integer:
es: No es necesario que los rangos sean enteros:

source: You can also replace the range with other kinds of collection object to loop over their contents:
es: También puede reemplazar el intervalo por otros tipos de objetos de colección para recorrer su contenido:

source: Morpho iterates over the collection object using an integer _counter variable_ that's normally hidden. If you want to know the current value of the counter (e.g. to get the index of an element as well as its value), you can use the following:
es: Morpho itera sobre el objeto de colección usando una _variable contador_ entero que normalmente está oculto. Si desea conocer el valor actual del contador (por ejemplo, para obtener el índice de un elemento, así como su valor), puede utilizar lo siguiente:

source: Morpho also provides a second form of `for` loop similar to that in C:
es: Morpho también proporciona una segunda forma de bucle `for` similar a la de C:

source: which is executed as follows: start: the variable `i` is declared and initially set to zero. test: before each iteration, the test is evaluated. If the test is `false`, the loop terminates. body: the body of the loop is executed. inc: the variable `i` is increased by 1.
es: que se ejecuta de la siguiente manera: start: la variable `i` se declara y se establece inicialmente en cero. Prueba: Antes de cada iteración, se evalúa la prueba. Si la prueba es `false`, el bucle termina. body: se ejecuta el cuerpo del bucle. INC: la variable `i` se incrementa en 1.

source: You can include any code that you like in each of the sections.
es: Puedes incluir cualquier código que desees en cada una de las secciones.

source: `Break` is used inside loops to finish the loop early. For example
es: `Break` se usa dentro de los ciclos para terminarlos antes de tiempo. Por ejemplo

source: // | (Once i>3)
es: // | (Una vez i>3)

source: would only print 1, 2 and 3. Once the condition `i>3` is true, the `break` statement causes execution to continue after the loop body.
es: solo imprimiría 1, 2 y 3. Una vez que la condición `i>3` es verdadera, la instrucción `break` hace que la ejecución continúe después del cuerpo del bucle.

source: Both `for` and `while` loops support break.
es: Tanto los bucles `for` como `while` admiten break.
