Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: By default, the increment between values is 1, but you can use a different value like this:
es: De forma predeterminada, el incremento entre valores es 1, pero puede usar un valor diferente como este:

source: // 1 - 5 with an increment of 0.5.
es: // 1 - 5 con un incremento de 0,5.

source: You can also create Range objects using the appropriate constructor function:
es: También puede crear objetos Range mediante la función constructora adecuada:

source: Ranges are particularly useful in writing loops:
es: Los rangos son particularmente útiles en la escritura de bucles:

source: They can easily be converted to a list of values:
es: Se pueden convertir fácilmente en una lista de valores:

source: To find the number of elements in a Range, use the `count` method
es: Para encontrar el número de elementos en un rango, use el método `count`

source: The Sparse class provides support for sparse matrices. An empty sparse matrix can be initialized with a given size,
es: La clase Sparse proporciona compatibilidad con matrices dispersas. Una matriz dispersa vacía se puede inicializar con un tamaño dado,

source: Alternatively, a matrix can be created from an array of triplets,
es: Alternativamente, se puede crear una matriz a partir de una matriz de tripletes,

source: For example,
es: Por ejemplo,

source: creates the matrix
es: crea la matriz

source: Once a sparse matrix is created, you can use all the regular arithmetic operators with matrix operands, e.g.
es: Una vez que se crea una matriz dispersa, puede usar todos los operadores aritméticos regulares con operandos de matriz, p. ej.

source: Strings represent textual information. They are written in Morpho like this:
es: Las cadenas representan información textual. Están escritas en Morpho así:

source: "hello world"
es: “hola mundo"

source: Unicode characters including emoji are supported.
es: Se admiten caracteres Unicode, incluidos los emojis.

source: You can also create strings using the constructor function `String`, which takes any number of parameters:
es: También puede crear cadenas utilizando la función constructora `String`, que toma cualquier número de parámetros:

source: "World"
es: "Mundo"

source: A very useful feature, called _string interpolation_, enables the results of any morpho expression can be interpolated into a string. Here, the values of `i` and `func(i)` will be inserted into the string as it is created:
es: Una característica muy útil, llamada _string interpolation_, permite que los resultados de cualquier expresión morpho se puedan interpolar en una cadena. Aquí, los valores de `i` y `func(i)` se insertarán en la cadena a medida que se crea:

source: To get an individual character, use index notatation
es: Para obtener un carácter individual, utilice la notación de índice

source: You can loop over each character like this:
es: Puede recorrer cada carácter de la siguiente manera:

source: Note that strings are immutable, and hence
es: Tenga en cuenta que las cadenas son inmutables y, por lo tanto

source: raises an error.
es: genera un error.

source: The split method splits a String into a list of substrings. It takes one argument, which is a string of characters to use to split the string:
es: El método split divide una cadena en una lista de subcadenas. Se necesita un argumento, que es una cadena de caracteres que se usará para dividir la cadena:

source: gives
es: da

source: Tuples are collection objects that contain a sequence of values each associated with an integer index. Unlike Lists, they can't be changed after creation.
es: Las tuplas son objetos de colección que contienen una secuencia de valores, cada uno asociado a un índice entero. A diferencia de las listas, no se pueden cambiar después de la creación.

source: Create a tuple like this:
es: Crea una tupla como esta:

source: Indexing can also be done with slices:
es: La indexación también se puede realizar con segmentos:

source: Loop over elements of a tuple:
es: Bucle sobre los elementos de una tupla:

source: Tests if a value is a member of a tuple:
es: Comprueba si un valor es miembro de una tupla:

source: // expect: (1,2,3,4,5,6)
es: // esperado: (1,2,3,4,5,6)

source: This section provides the documentation for meshes, selections, fields and functionals.
es: En esta sección se proporciona la documentación de mallas, selecciones, campos y funcionalidades.

source: Fields are used to store information, including numbers or matrices, associated with the elements of a `Mesh` object.
es: Los campos se utilizan para almacenar información, incluidos números o matrices, asociados con los elementos de un objeto `Mesh`.

source: You can create a `Field` by applying a function to each of the vertices,
es: Puede crear un `Campo` aplicando una función a cada uno de los vértices,

source: or by supplying a single constant value,
es: o suministrando un único valor constante,

source: Fields can then be added and subtracted using the `+` and `-` operators.
es: A continuación, se pueden añadir y restar campos utilizando los operadores `+` y `-`.

source: To access elements of a `Field`, use index notation:
es: Para acceder a los elementos de un `Campo`, utilice la notación de índice:

source: where
es: dónde

source: `grade` is the grade to select
es: `grade` es el grado que se va a seleccionar

source: `element` is the element id
es: `element` es el ID del elemento

source: `index` is the element index
es: `index` es el índice del elemento

source: As a shorthand, it's possible to omit the grade and index; these are then both assumed to be `0`:
es: Como abreviatura, es posible omitir el grado y el índice; A continuación, se supone que ambos son `0`:

source: Returns the Mesh associated with a Field object:
es: Devuelve la malla asociada a un objeto Field:

source: To create fields that include grades other than just vertices, use the `grade` option to `Field`. This can be just a grade index,
es: Para crear campos que incluyan grados que no sean solo vértices, use la opción `grade` para `Field`. Esto puede ser solo un índice de calificación,

source: which creates an empty field with `0` for each of the facets of the mesh `mesh`.
es: que crea un campo vacío con `0` para cada una de las facetas de la malla `mall`.

source: You can store more than one item per element by supplying a list to the `grade` option indicating how many items you want to store on each grade. For example,
es: Puede almacenar más de un elemento por elemento proporcionando una lista a la opción `grade` que indique cuántos elementos desea almacenar en cada grado. Por ejemplo,

source: stores two numbers on the line (grade 1) elements and one number on the facets (grade 2) elements. Each number in the field is initialized to the value `1.0`.
es: almacena dos números en los elementos Line (Grado 1) y un número en los elementos Facetas (Grado 2). Cada número del campo se inicializa con el valor `1.0`.

source: The `shape` method returns a list indicating the number of items stored on each element of a particular grade. This has the same format as the list you supply to the `grade` option of the `Field` constructor. For example,
es: El método `shape` devuelve una lista que indica el número de elementos almacenados en cada elemento de un grado en particular. Tiene el mismo formato que la lista que se proporciona a la opción 'grade' del constructor 'Field'. Por ejemplo,

source: would indicate one item stored on each vertex and two items stored on each facet.
es: indicaría un elemento almacenado en cada vértice y dos elementos almacenados en cada faceta.

source: The `op` method applies a function to every item stored in a `Field`, returning the result as elements of a new `Field` object. For example,
es: El método `op` aplica una función a cada elemento almacenado en un `Campo`, devolviendo el resultado como elementos de un nuevo objeto `Campo`. Por ejemplo,

source: calls the `norm` method on each element stored in `f`.
es: llama al método `norm` en cada elemento almacenado en `f`.

source: Additional `Field` objects may be supplied as extra arguments to `op`. These must have the same shape (the same number of items stored on each grade). The function supplied to `op` will now be called with the corresponding element from each field as arguments. For example,
es: Se pueden proporcionar objetos `Field` adicionales como argumentos adicionales a `op`. Estos deben tener la misma forma (el mismo número de elementos almacenados en cada grado). La función suministrada a 'op' ahora se llamará con el elemento correspondiente de cada campo como argumentos. Por ejemplo,

source: calculates an elementwise inner product between the elements of Fields `f` and `g`.
es: calcula un producto interno elemental entre los elementos de los campos `f` y `g`.

source: A number of `functionals` are available in Morpho. Each of these represents an integral over some `Mesh` and `Field` objects (on a particular `Selection`) and are used to define energies and constraints in an `OptimizationProblem` provided by the `optimize` module.
es: Una serie de `funcionals` están disponibles en Morpho. Cada uno de ellos representa una integral sobre algunos objetos `Mesh` y `Field` (en una `Selection` particular) y se utilizan para definir energías y restricciones en un `OptimizationProblem` proporcionado por el módulo `optimize`.

source: Many functionals are built in. Additional functionals are available by importing the `functionals` module:
es: Muchas funciones están integradas. Las funcionalidades adicionales están disponibles importando el módulo `funcionals`:

source: Functionals provide a number of standard methods:
es: Los funcionales proporcionan una serie de métodos estándar:

source: `total`(mesh) - returns the value of the integral with a provided mesh, selection and fields
es: `total`(mesh) - devuelve el valor de la integral con una malla, selección y campos proporcionados

source: `integrand`(mesh) - returns the contribution to the integral from each element
es: `integrand`(mesh) - devuelve la contribución a la integral de cada elemento

source: `gradient`(mesh) - returns the gradient of the functional with respect to vertex motions.
es: `gradiente` (malla) - devuelve el gradiente del funcional con respecto a los movimientos de los vértices.

source: `fieldgradient`(mesh, field) - returns the gradient of the functional with respect to components of the field
es: `fieldgradient`(malla, campo): devuelve el gradiente del funcional con respecto a los componentes del campo

source: Each of these may be called with a mesh, a field and a selection.
es: Cada uno de ellos puede llamarse con una malla, un campo y una selección.

source: Length
es: Lenght

source: A `Length` functional calculates the length of a line element in a mesh.
es: Un funcional `Lenght` calcula la longitud de un elemento de línea en una malla.

source: Evaluate the length of a circular loop:
es: Evalúe la longitud de un bucle circular:

source: An `AreaEnclosed` functional calculates the area enclosed by a loop of line elements.
es: Un funcional `AreaEnclosed` calcula el área delimitada por un bucle de elementos de línea.

source: An `Area` functional calculates the area of the area elements in a mesh:
es: Un funcional `Area` calcula el área de los elementos de área en una malla:

source: A `VolumeEnclosed` functional is used to calculate the volume enclosed by a surface. Note that this estimate may become inaccurate for highly deformed surfaces.
es: Un funcional `VolumeEnclosed` se usa para calcular el volumen encerrado por una superficie. Tenga en cuenta que esta estimación puede resultar inexacta para superficies muy deformadas.

source: A `Volume` functional calculates the volume of volume elements.
es: Un funcional `Volume` calcula el volumen de los elementos de volumen.

source: The `ScalarPotential` functional is applied to point elements.
es: La función `ScalarPotential` se aplica a elementos puntuales.

source: You must supply a function (which may be anonymous) that returns the potential. You may optionally provide a function that returns the gradient as well at initialization:
es: Debe proporcionar una función (que puede ser anónima) que devuelva el potencial. Opcionalmente, puede proporcionar una función que devuelva el gradiente también en la inicialización:

source: This functional is often used to constrain the mesh to the level set of a function. For example, to confine a set of points to a sphere:
es: Esta función se utiliza a menudo para restringir la malla al conjunto de niveles de una función. Por ejemplo, para confinar un conjunto de puntos a una esfera:

source: See the thomson example for use of this technique.
es: Vea el ejemplo de Thomson para el uso de esta técnica.

source: The `LinearElasticity` functional measures the linear elastic energy away from a reference state.
es: El funcional `LinearElasticity` mide la energía elástica lineal lejos de un estado de referencia.

source: You must initialize with a reference mesh:
es: Debe inicializar con una malla de referencia:

source: Manually set the poisson's ratio and grade to operate on:
es: Configure manualmente la relación de Poisson y el grado en el que operar:

source: The `EquiElement` functional measures the discrepency between the size of elements adjacent to each vertex. It can be used to equalize elements for regularization purposes.
es: El funcional `EquiElement` mide la discrepancia entre el tamaño de los elementos adyacentes a cada vértice. Se puede utilizar para igualar elementos con fines de regularización.

source: The `LineCurvatureSq` functional measures the integrated curvature squared of a sequence of line elements.
es: El funcional `LineCurvatureSq` mide la curvatura integrada al cuadrado de una secuencia de elementos de línea.

source: The `LineTorsionSq` functional measures the integrated torsion squared of a sequence of line elements.
es: El funcional `LineTorsionSq` mide la torsión integrada al cuadrado de una secuencia de elementos de línea.

source: The `MeanCurvatureSq` functional computes the integrated mean curvature over a surface.
es: El funcional `MeanCurvatureSq` calcula la curvatura media integrada sobre una superficie.

source: The `GaussCurvature` computes the integrated gaussian curvature over a surface.
es: La `GaussCurvature` calcula la curvatura gaussiana integrada sobre una superficie.

source: Note that for surfaces with a boundary, the integrand is correct only for the interior points. To compute the geodesic curvature of the boundary in that case, you can set the optional flag `geodesic` to `true` and compute the total on the boundary selection. Here is an example for a 2D disk mesh.
es: Tenga en cuenta que para las superficies con un contorno, el integrando es correcto solo para los puntos interiores. Para calcular la curvatura geodésica del límite en ese caso, puede establecer la bandera opcional `geodesic` en `true` y calcular el total en la selección del límite. A continuación se muestra un ejemplo de una malla de disco 2D.

source: // expect: 2*Pi
es: // esperado: 2*Pi

source: The `GradSq` functional measures the integral of the gradient squared of a field. The field can be a scalar, vector or matrix function.
es: El funcional `GradSq` mide la integral del gradiente al cuadrado de un campo. El campo puede ser una función escalar, vectorial o matricial.

source: Initialize with the required field:
es: Inicialice con el campo obligatorio:

source: The `Nematic` functional measures the elastic energy of a nematic liquid crystal.
es: El funcional `Nematic` mide la energía elástica de un cristal líquido nemático.

source: There are a number of optional parameters that can be used to set the splay, twist and bend constants:
es: Hay una serie de parámetros opcionales que se pueden utilizar para establecer las constantes de separación, torsión y plegado:

source: These are stored as properties of the object and can be retrieved as follows:
es: Estos se almacenan como propiedades del objeto y se pueden recuperar de la siguiente manera:

source: The `NematicElectric` functional measures the integral of a nematic and electric coupling term integral((n.E)^2) where the electric field E may be computed from a scalar potential or supplied as a vector.
es: El funcional `NematicElectric` mide la integral de un término de acoplamiento nemático y eléctrico integral((n.E)^2) donde el campo eléctrico E puede calcularse a partir de un potencial escalar o suministrarse como un vector.

source: Initialize with a director field `nn` and a scalar potential `phi`:
es: Inicialice con un campo de director `nn` y un potencial escalar `phi`:

source: The `NormSq` functional measures the elementwise L2 norm squared of a field.
es: El funcional `NormSq` mide la norma L2 al cuadrado de un campo.

source: The `LineIntegral` functional computes the line integral of a function. You supply an integrand function that takes a position matrix as an argument.
es: El funcional `LineIntegral` calcula la integral de línea de una función. Se proporciona una función integrando que toma una matriz de posición como argumento.

source: To compute `integral(x^2+y^2)` over a line element:
es: Para calcular ‘`ntegral(x^2+y^2)` sobre un elemento de línea:

source: The function `tangent()` returns a unit vector tangent to the current element:
es: La función `tangent()` devuelve un vector unitario tangente al elemento actual:

source: You can also integrate functions that involve fields:
es: También puede integrar funciones que impliquen campos:

source: where `n` is a vector field. The local interpolated value of this field is passed to your integrand function. More than one field can be used; they are passed as arguments to the integrand function in the order you supply them to `LineIntegral`.
es: donde `n` es un campo vectorial. El valor interpolado local de este campo se pasa a la función integrando. Se puede utilizar más de un campo; se pasan como argumentos a la función integrando en el orden en que se proporcionan a `LineIntegral`.

source: The gradient of a field is available within an integrand function using the `gradient()` function.
es: El gradiente de un campo está disponible dentro de una función integrando usando la función `gradient()`.

source: The `AreaIntegral` functional computes the area integral of a function. You supply an integrand function that takes a position matrix as an argument.
es: El funcional `AreaIntegral` calcula la integral de área de una función. Se proporciona una función integrando que toma una matriz de posición como argumento.

source: To compute integral(x\*y) over an area element:
es: Para calcular la integral(x\*y) sobre un elemento de área:

source: The local facet normal can be accessed in an integrand using the `normal()` function:
es: Se puede acceder a la faceta normal local en un integrando usando la función `normal()`:

source: More than one field can be used; they are passed as arguments to the integrand function in the order you supply them to `AreaIntegral`.
es: Se puede utilizar más de un campo; se pasan como argumentos a la función integrando en el orden en que se proporcionan a `AreaIntegral`.

source: The `VolumeIntegral` functional computes the volume integral of a function. You supply an integrand function that takes a position matrix as an argument.
es: El funcional `VolumeIntegral` calcula la integral de volumen de una función. Se proporciona una función integrando que toma una matriz de posición como argumento.

source: To compute integral(x_y_z) over an volume element:
es: Para calcular integral(x_y_z) sobre un elemento de volumen:

source: More than one field can be used; they are passed as arguments to the integrand function in the order you supply them to `VolumeIntegral`.
es: Se puede utilizar más de un campo; se pasan como argumentos a la función integrando en el orden en que se proporcionan a `VolumeIntegral`.

source: The `Hydrogel` functional computes the Flory-Rehner energy over an element:
es: El funcional `Hydrogel` calcula la energía de Flory-Rehner sobre un elemento:

source: The first three terms come from the Flory-Huggins mixing energy, whereas the fourth term proportional to d comes from the Flory-Rehner elastic energy.
es: Los tres primeros términos provienen de la energía de mezcla de Flory-Huggins, mientras que el cuarto término proporcional a d proviene de la energía elástica de Flory-Rehner.

source: The value of phi is calculated from a reference mesh that you provide on initializing the Functional:
es: El valor de phi se calcula a partir de una malla de referencia que se proporciona al inicializar el Funcional:

source: Here, a, b, c, d and phiref are parameters you can supply (they are `nil` by default), V is the current volume and V0 is the reference volume of a given element. You also need to supply the initial value of phi, labeled as phi0, which is assumed to be the same for all the elements. Manually set the coefficients and grade to operate on:
es: Aquí, a, b, c, d y phiref son parámetros que puede proporcionar (son `nil` por defecto), V es el volumen actual y V0 es el volumen de referencia de un elemento determinado. También debe proporcionar el valor inicial de phi, etiquetado como phi0, que se supone que es el mismo para todos los elementos. Configure manualmente los coeficientes y la pendiente en los que operar:

source: The `Mesh` class provides support for meshes. Meshes may consist of different kinds of element, including vertices, line elements, facets or area elements, tetrahedra or volume elements.
es: La clase `Mesh` proporciona soporte para mallas. Las mallas pueden constar de diferentes tipos de elementos, incluidos vértices, elementos de línea, facetas o elementos de área, tetraedros o elementos de volumen.

source: To create a mesh, you can import it from a file:
es: Para crear una malla, puede importarla desde un archivo:

source: or use one of the functions available in `meshtools` or `implicitmesh` packages.
es: o utilice una de las funciones disponibles en los paquetes `meshtools` o `implicitmesh`.

source: Each type of element is referred to as belonging to a different `grade`. Point-like elements (vertices) are _grade 0_; line-like elements (edges) are _grade 1_; area-like elements (facets; triangles) are _grade 2_ etc.
es: Se hace referencia a cada tipo de elemento como perteneciente a un `grade` diferente. Los elementos puntuales (vértices) son _grade 0_; Los elementos en forma de línea (bordes) son _grade 1_; Los elementos similares a áreas (facetas, triángulos) son _grade 2_, etc.

source: The `plot` package includes functions to visualize meshes.
es: El paquete `plot` incluye funciones para visualizar mallas.

source: Saves a mesh as a .mesh file.
es: Guarda una malla como un archivo .mesh.

source: Retrieves the position of a vertex given an id:
es: Recupera la posición de un vértice dado un id:

source: Sets the position of a vertex given an id and a position vector:
es: Establece la posición de un vértice dado un id y un vector de posición:

source: Adds a new grade to a mesh. This is commonly used when, for example, a mesh file includes facets but not edges. To add the missing edges:
es: Añade una nueva calificación a una malla. Esto se usa comúnmente cuando, por ejemplo, un archivo de malla incluye facetas pero no bordes. Para agregar los bordes que faltan:

source: Adds a symmetry to a mesh. Experimental in version 0.5.
es: Añade una simetría a una malla. Experimental en la versión 0.5.

source: Returns the highest grade element present:
es: Devuelve el elemento de grado más alto presente:
