Repository: joshichaitanya3/morpho-manual
Catalog: po/*.po
Languages: es

source: Now we have a collection of functional objects that we can use to define the problem. So far, we haven't specified which functionals are energies and which are constraints; nor have we specified which parts of the mesh the functionals are to be evaluated over. All that information is collected in an `OptimizationProblem` object, which we will now create:
es: Ahora tenemos una colección de objetos funcionales que podemos usar para definir el problema. Hasta ahora, no hemos especificado qué funcionales son energías y cuáles son restricciones; Tampoco hemos especificado sobre qué partes de la malla se evaluarán los funcionales. Toda esa información se recopila en un objeto `OptimizationProblem`, que ahora crearemos:

source: ``` // Set up the optimization problem var W = 1 var sigma = 1 var problem = OptimizationProblem(m) problem.addenergy(lf) problem.addenergy(la, selection=bnd, prefactor=-W/2) problem.addenergy(lt, selection=bnd, prefactor=sigma) problem.addconstraint(laa) problem.addlocalconstraint(ln, field=nn, target=1) ```
es: ``` // Configurar el problema de optimización var W = 1 var sigma = 1 var problema = OptimizationProblem(m) problema.addenergy(lf) problem.addenergy(la, selection=bnd, prefactor=-W/2) problem.addenergy(lt, selection=bnd, prefactor=sigma) problem.addconstraint(laa) problem.addlocalconstraint(ln, field=nn, target=1) ```

source: Notice that some of these functionals only act on a selection such as the boundary and hence we use the optional `selection` parameter to specify this. We can also specify the prefactor of the functional.
es: Tenga en cuenta que algunas de estas funciones solo actúan sobre una selección, como el límite, y por lo tanto usamos el parámetro opcional `selection` para especificarlo. También podemos especificar el prefactor del funcional.

source: We're now ready to perform the optimization, for which we need an `Optimizer` object. These come in two flavors: a `ShapeOptimizer` and a `FieldOptimizer` that respectively act on the shape and a field. We create them with the problem and quantity they're supposed to act on:
es: Ahora estamos listos para realizar la optimización, para lo cual necesitamos un objeto 'Optimizer'. Estos vienen en dos sabores: un `ShapeOptimizer` y un `FieldOptimizer` que actúan respectivamente sobre la forma y un campo. Los creamos con el problema y la cantidad sobre la que se supone que deben actuar:

source: // Create shape and field optimizers
es: // Crear optimizadores de formas y campos

source: Having created these, we can perform the optimizion by calling the `linesearch` method with a specified number of iterations for each:
es: Una vez creados estos, podemos realizar la optimización llamando al método `linesearch` con un número específico de iteraciones para cada uno:

source: // Optimization loop
es: // Bucle de optimización

source: Each iteration of a `linesearch` evolves the field (or shape) down the gradient of the target functional, subject to constraints, and finds an optimal stepsize to reduce the value of the functional. Here, we alternate between optimizing the field and optimizing the shape, performing twenty iterations of each, and overall do this one hundred times. These numbers have been chosen rather arbitrarily, and if you look at the output you will notice that _morpho_ doesn't always execute twenty iterations of each. Rather, at each iteration it checks to see if the change in energy satisfies, $$|E|\<\\epsilon,$$ or, $$\left|\frac{\Delta E}{E}\right|\<\\epsilon$$ where the value of \\(\epsilon\\), the convergence tolerance can be changed by setting the `etol` property of the Optimizer object:
es: Cada iteración de `linesearch` hace evolucionar el campo (o forma) hacia abajo en el gradiente del funcional de destino, sujeto a restricciones, y encuentra un tamaño de paso óptimo para reducir el valor del funcional. Aquí, alternamos entre optimizar el campo y optimizar la forma, realizando veinte iteraciones de cada uno, y en general hacemos esto cien veces. Estos números han sido elegidos de forma bastante arbitraria, y si nos fijamos en el resultado nos daremos cuenta de que _morpho_ no siempre ejecuta veinte iteraciones de cada uno. Más bien, en cada iteración comprueba si el cambio en la energía satisface, $$|E|\<\\epsilon,$$ o, $$\left|\frac{\Delta E}{E}\right|\<\\epsilon$$ donde el valor de \\(\epsilon\\), la tolerancia de convergencia se puede cambiar estableciendo la propiedad `etol` del objeto Optimizer:

source: // default value is 1e-8
es: // el valor predeterminado es 1E-8

source: Some other properties of an `Optimizer` that may be useful for the user to adjust are as follows:
es: Algunas otras propiedades de un `Optimizador` que pueden ser útiles para que el usuario las ajuste son las siguientes:

source: Property
es: Propiedad

source: Default value
es: Valor predeterminado

source: Energy tolerance (relative error)
es: Tolerancia en la energía (error relativo)

source: Constraint tolerance (how well are constraints satisfied)
es: Tolerancia a restricciones (qué tan bien se satisfacen las restricciones)

source: Stepsize for `relax` (changed by linesearch)
es: Tamaño de paso para `relax` (cambiado por búsqueda de líneas)

source: Largest stepsize a `linesearch` can take
es: El tamaño de paso más grande que puede tomar una `linesearch`

source: Number of steps the optimizer may take to ensure constraints are satisfied
es: Número de pasos que el optimizador puede realizar para garantizar que se satisfagan las restricciones

source: Whether to print output as the optimization happens
es: Si se imprime la salida a medida que se produce la optimización

source: Visualizing results
es: Visualización de resultados

source: _Morpho_ provides a highly flexible graphics system, with an external viewer application _morphoview_, to enable rich visualizations of results. Visualizations typically involve one or more `Graphics` objects, which act as a container for graphical elements to be displayed. Various _graphics primitives_, such as spheres, cylinders, arrows, tubes, etc. can be added to a `Graphics` object to make a drawing.
es: _Morpho_ proporciona un sistema de gráficos altamente flexible, con una aplicación de visualización externa _morphoview_, para permitir visualizaciones enriquecidas de los resultados. Las visualizaciones suelen implicar uno o más objetos `Gráphics`, que actúan como contenedor para que se muestren los elementos gráficos. Se pueden agregar varios _graphics primitives_, como esferas, cilindros, flechas, tubos, etc. a un objeto `Gráphics` para hacer un dibujo.

source: We are now ready to visualize the results of the optimization. First, we'll draw the mesh. Because we're interested in seeing the mesh structure, we'll draw the edges (i.e. the grade 1 elements). The function to do this is provided as part of the `plot` module that we imported in section [Importing modules](./importing_modules.md):
es: Ahora estamos listos para visualizar los resultados de la optimización. Primero, dibujaremos la malla. Debido a que estamos interesados en ver la estructura de la malla, dibujaremos los bordes (es decir, los elementos de grado 1). La función para hacer esto se proporciona como parte del módulo `plot` que importamos en la sección [Importación de módulos](./importing_modules.md):

source: Next, we'll create a separate `Graphics` object that contains the director. Since the director \\(\mathbf{n}\\) is a unit vector field, and the sign is not significant (the nematic elastic energy is actually invariant under \\(\mathbf{n}\to-\mathbf{n}\\)), an appropriate way to display a single director is as a cylinder oriented along \\(\mathbf{n}\\). We will therefore make a helper function that creates a `Graphics` object and draws such a cylinder at every mesh point:
es: A continuación, crearemos un objeto `Graphics` separado que contenga al director. Dado que el director \\(\mathbf{n}\\) es un campo vectorial unitario, y el signo no es significativo (la energía elástica nemática es en realidad invariante bajo \\(\mathbf{n}\to-\mathbf{n}\\)), una forma apropiada de mostrar un solo director es como un cilindro orientado a lo largo de \\(\mathbf{n}\\). Por lo tanto, crearemos una función auxiliar que cree un objeto 'Graphics' y dibuje un cilindro de este tipo en cada punto de malla:

source: // Function to visualize a director field // m - the mesh // nn - the director Field to visualize // dl - scale the director
es: // Función para visualizar un campo de director // m - la malla // nn - el Campo del director a visualizar // dl - Escalar el director

source: // Number of vertices
es: // Número de vértices

source: // Create a graphics object
es: // Creación de un objeto gráfico

source: // Get the ith vertex // Draw a cylinder aligned with nn at this vertex
es: // Obtener el i-ésimo vértice // Dibuja un cilindro alineado con nn en este vértice

source: Once we've defined this function, we can use it:
es: Una vez que hemos definido esta función, podemos usarla:

source: The variables \\(g\\) and \\(gnn\\) now refer to two separate Graphics objects. We can combine them using the \\(+\\) operator, and display them like so:
es: Las variables \\(g\\) y \\(gnn\\) ahora se refieren a dos objetos Graphics separados. Podemos combinarlos usando el operador \\(+\\) y mostrarlos así:

source: The resulting visualization is shown in Fig. [4.5](#fig:FinalResult).
es: La visualización resultante se muestra en la Fig. [4.5] (#fig:FinalResult).

source: We have now solved our first shape optimization problem, and the complete problem script is provided in the `examples/tutorial` folder inside the git repository as `tutorial.morpho`. The result we have obtained in Fig. [4.5](#fig:FinalResult) is, however, a very coarse, low resolution solution comprising only a relatively small number of elements. To gain an improved solution, we need to _refine_ our mesh. Because modifying the mesh also requires us to update other data structures like fields and selections, a special `MeshRefiner` object is used to perform the refinement.
es: Ahora hemos resuelto nuestro primer problema de optimización de formas, y el script completo del problema se proporciona en la carpeta 'examples/tutorial' dentro del repositorio de git como 'tutorial.morpho'. El resultado que hemos obtenido en la Fig. [4.5] (#fig:FinalResult) es, sin embargo, una solución muy gruesa y de baja resolución que comprende solo un número relativamente pequeño de elementos. Para obtener una solución mejorada, necesitamos _refinar_ nuestra malla. Debido a que la modificación de la malla también requiere que actualicemos otras estructuras de datos como campos y selecciones, se utiliza un objeto especial 'MeshRefiner' para realizar el refinamiento.

source: To perform refinement we:
es: Para llevar a cabo el refinamiento:

source: Create a `MeshRefiner` object, providing it a list of all the `Mesh`, `Field` and `Selection` objects (i.e. the mesh and objects that directly depend on it) that need to be updated:
es: Cree un objeto `MeshRefiner`, proporcionándole una lista de todos los objetos 'Mesh', 'Field' y 'Selection' (es decir, la malla y los objetos que dependen directamente de él) que deben actualizarse:

source: // Set the refiner up
es: // Configurar el refinador

source: Call the `refine` method on the `MeshRefiner` object to actually perform the refinement. This method returns a `Dictionary` object that maps the old objects to potentially newly created ones.
es: Llame al método 'refine' en el objeto `MeshRefiner` para realizar realmente el refinamiento. Este método devuelve un objeto `Dictionary` que asigna los objetos antiguos a los potencialmente recién creados.

source: // Perform the refinement
es: // Realizar el refinamiento

source: Tell any other objects that refer to the mesh, fields or selections to update their references using `refmap`. For example, `OptimizationProblem` and `Optimizer` objects are typically updated at this step.
es: Dígale a cualquier otro objeto que haga referencia a la malla, campos o selecciones que actualice sus referencias usando `refmap`. Por ejemplo, los objetos `OptimizationProblem` y `Optimizer` normalmente se actualizan en este paso.

source: // Update the problem
es: // Actualizar el problema

source: Update our own references
es: Actualizar nuestras propias referencias

source: // Update variables
es: // Actualizar variables

source: We insert this code after our optimization section, which causes _morpho_ to successively optimize and refine.
es: Insertamos este código después de nuestra sección de optimización, lo que hace que _morpho_ se optimice y refine sucesivamente.

source: The complete code including refinement is in `examples/tutorial` folder inside the git repository as `tutorial2.morpho`
es: El código completo, incluido el refinamiento, se encuentra en la carpeta `examples/tutorial` dentro del repositorio git como `tutorial2.morpho`

source: The resulting optimized shapes are displayed in Fig. [4.6](#fig:Refinement).
es: Las formas optimizadas resultantes se muestran en la Fig. [4.6] (#fig:Refinamiento).

source: ``` // Optimization loop var refmax = 3 for (refiter in 1..refmax) { print "===Refinement level ${refiter}===" for (i in 1..100) { fopt.linesearch(20) sopt.linesearch(20) } if (refiter==refmax) break // Refinement var mr=MeshRefiner([m, nn, bnd]) // Set the refiner up var refmap=mr.refine() // Perform the refinement for (el in [problem, sopt, fopt]) el.update(refmap) // Update the problem m=refmap[m]; nn=refmap[nn]; bnd=refmap[bnd] // Update variables } ```
es: ``` // Bucle de optimización var refmax = 3 for (refiter in 1..refmax) { print "===Nivel de refinamiento ${refiter}===" for (i en 1..100) { fopt.linesearch(20) sopt.linesearch(20) } if (refiter==refmax) rompe Refinamiento var mr=MeshRefiner([m, nn, bnd]) // Configurar el refinador var refmap=mr.refine() // Realizar el refinamiento for (el in [problem, sopt, fopt]) el.update(refmap) // Actualiza el problema m=refmap[m]; nn=refmap[nn]; bnd=refmap[bnd] // Actualizar variables } ```

source: Having completed this tutorial, you may wish to explore the effect of changing some of the parameters in the file. What happens if you change `sigma` and W, the coefficients in front of the terms in the energy? What happens if you take a different number of steps? Or change properties of the Optimizers like `stepsize` and `steplimit`?
es: Una vez completado este tutorial, es posible que desee explorar el efecto de cambiar algunos de los parámetros del archivo. ¿Qué pasa si cambias `sigma` y W, los coeficientes delante de los términos de la energía? ¿Qué pasa si das un número diferente de pasos? ¿O cambiar las propiedades de los optimizadores como `stepsize` y `steplimit`?

source: You should look at other example files provided in the `examples` folder of the git repository. The remainder of the manual comprises chapters exploring certain _morpho_ concepts in more detail, followed by a detailed reference manual for _morpho_ functionality, and a complete description of the scripting language.
es: Deberías mirar otros archivos de ejemplo proporcionados en la carpeta `examples` del repositorio de git. El resto del manual comprende capítulos que exploran ciertos conceptos de _morpho_ con más detalle, seguidos de un manual de referencia detallado para la funcionalidad de _morpho_ y una descripción completa del lenguaje de scripting.

source: Working with Meshes
es: Trabajando con mallas

source: This chapter explains a number of ways the user can create and manipulate Mesh objects in _morpho_. The simplest way to create a mesh for a desired domain is to use the `meshgen` module, which provides a very high level and convenient interface. The `meshtools` module provides low level mesh creation operations and a number of useful routines to manipulate meshes. The `implicitmesh` module produces surfaces from implicit functions. Finally, you can use an external program to create a mesh that exports the data in vtk format using the `vtk` module.
es: Este capítulo explica varias formas en que el usuario puede crear y manipular objetos Mesh en _morpho_. La forma más sencilla de crear una malla para un dominio deseado es utilizar el módulo `meshgen`, que proporciona una interfaz conveniente y de muy alto nivel. El módulo `meshtools` proporciona operaciones de creación de mallas de bajo nivel y una serie de rutinas útiles para manipular mallas. El módulo `implicitmesh` produce superficies a partir de funciones implícitas. Por último, puede utilizar un programa externo para crear una malla que exporte los datos en formato vtk utilizando el módulo `vtk`.

source: Mesh creation follows two patterns. Some methods use a **constructor** pattern where you call a single function that creates the Mesh, e.g.
es: La creación de mallas sigue dos patrones. Algunos métodos utilizan un patrón **constructor** en el que se llama a una sola función que crea la malla, p. ej.

source: Other approaches follow a **builder** pattern, where you first create a special helper object,
es: Otros enfoques siguen un patrón **builder**, en el que primero se crea un objeto auxiliar especial,

source: and manipulate it, e.g. by adding elements or setting options. The Mesh is then created by calling the build method:
es: y manipularlo, por ejemplo, añadiendo elementos u opciones de configuración. A continuación, se crea la malla llamando al método de compilación:

source: The `meshgen` module conveniently produces high quality meshes for many kinds of domain. It follows the builder pattern with a MeshGen helper object that performs the construction. To use `meshgen`, the user must provide a scalar function that is positive everywhere that they want to be meshed.
es: El módulo `meshgen` produce convenientemente mallas de alta calidad para muchos tipos de dominio. Sigue el patrón del generador con un objeto auxiliar MeshGen que realiza la construcción. Para usar `meshgen`, el usuario debe proporcionar una función escalar que sea positiva en todos los lugares en los que desea que se malla.

source: **Note** One example is referred to in the literature as a _signed distance function_, which is the Euclidean distance of a given point \\(x\\) to the boundary of a set \\(\Omega\\) with the sign positive if \\(x\\) is in the interior of \\(\Omega\\). MeshGen does not require signed distance functions, but accepts any continuous and reasonably smooth function.
es: **Nota** Un ejemplo se conoce en la literatura como una function_ de distancia _con signo, que es la distancia euclidiana de un punto dado \\(x\\) al límite de un conjunto \\(\Omega\\) con el signo positivo si \\(x\\) está en el interior de \\(\Omega\\). MeshGen no requiere funciones de distancia con signo, pero acepta cualquier función continua y razonablemente suave.

source: For example, the interior of the unit disk in two dimensions, is described by the function $$f(x,y)=1-(x^{2}+y^{2}).$$ To create the corresponding Mesh, we must first specify a suitable _morpho_ function that describes the domain. This function will be called repeatedly by MeshGen, which will pass it a position vector `x`. Hence, the \\((x,y)\\) components must be accessed from the argument `x` by indexing:
es: Por ejemplo, el interior del disco unitario en dos dimensiones, se describe mediante la función $$f(x,y)=1-(x^{2}+y^{2}).$$ Para crear la malla correspondiente, primero debemos especificar una función _morpho_ adecuada que describa el dominio. Esta función será llamada repetidamente por MeshGen, que le pasará un vector de posición `x`. Por lo tanto, se debe acceder a los componentes \\((x,y)\\) desde el argumento `x` indexando:

source: Now that the function is specified, we can create a MeshGen object:
es: Ahora que se especifica la función, podemos crear un objeto MeshGen:

source: The second parameter is a list of Ranges that provide overall bounds on the domain to be meshed. Here we will use \\(x,y\in\[\-1,1\]\\). By setting the stepsize, the user can provide MeshGen with an overall suggestion of the resolution.
es: El segundo parámetro es una lista de rangos que proporcionan límites generales en el dominio que se va a mallar. Aquí usaremos \\(x,y\in\[\-1,1\]\\). Al establecer el tamaño del paso, el usuario puede proporcionar a MeshGen una sugerencia general de la resolución.

source: Finally, we create the Mesh by calling the build method:
es: Por último, creamos el Mesh llamando al método build:

source: The resulting Mesh is shown in Fig. [5.1](#fig:MeshGen-disk), left panel. A higher resolution Mesh can be generated by changing the Range objects passed to MeshGen:
es: La malla resultante se muestra en la Fig. [5.1] (#fig:MeshGen-disk), panel izquierdo. Se puede generar una malla de mayor resolución cambiando los objetos Range pasados a MeshGen:

source: This generates a much higher resolution Mesh, with approximately four times the number of vertices as shown in Fig. [5.1](#fig:MeshGen-disk), right panel.
es: Esto genera una malla de resolución mucho mayor, con aproximadamente cuatro veces el número de vértices como se muestra en la Fig. [5.1] (#fig:MeshGen-disk), panel derecho.

source: MeshGen can also mesh more complicated domains. To facilitate this, it provides a Domain class that accepts a scalar function in its constructor. For example, this code creates an ellipse as shown in Fig. [5.2](#fig:MeshGen-2), left panel:
es: MeshGen también puede mallar dominios más complicados. Para facilitar esto, proporciona una clase Domain que acepta una función escalar en su constructor. Por ejemplo, este código crea una elipse como se muestra en la Fig. [5.2] (#fig:MeshGen-2), panel izquierdo:

source: The benefit of this is that Domain objects can be combined using set operation methods `union`, `intersection` and `difference`. To illustrate the possibilities with this, we use a special constructor to create three domains corresponding to disks,
es: La ventaja de esto es que los objetos de dominio se pueden combinar utilizando los métodos de operación de conjunto `union`, `intersección` y `diferencia`. Para ilustrar las posibilidades con esto, usamos un constructor especial para crear tres dominios correspondientes a discos,

source: then combine them,
es: luego combínalos,

source: and mesh the resulting domain,
es: y la malla el dominio resultante,

source: with the result shown in Fig. [5.2](#fig:MeshGen-2), right panel.
es: con el resultado que se muestra en la Fig. [5.2] (#fig:MeshGen-2), panel derecho.

source: Three dimensional meshes are created very similarly. Here we create a spherical mesh, displayed in Fig. [5.3](#fig:MeshGen-3)
es: Las mallas tridimensionales se crean de manera muy similar. Aquí creamos una malla esférica, que se muestra en la Fig. [5.3] (#fig:MeshGen-3)

source: Meshtools provides many useful functions for working with Meshes, including constructors to create certain kinds of Mesh and also classes for refining, coarsening and merging Meshes.
es: Meshtools proporciona muchas funciones útiles para trabajar con mallas, incluidos constructores para crear ciertos tipos de mallas y también clases para refinar, desengrasar y fusionar mallas.

source: The `LineMesh` function is a convenient way to create a Mesh from a one-parameter parametric function. You must specify the function to use and a Range of points to generate. `LineMesh` then evaluates each point in the Range and joins them together with a line element.
es: La función `LineMesh` es una forma conveniente de crear una malla a partir de una función paramétrica de un parámetro. Debe especificar la función que se va a utilizar y un rango de puntos que se va a generar. A continuación, `LineMesh` evalúa cada punto del rango y los une con un elemento de línea.
